{"detailed_guest_info": "Jerry Maguire is a 1996 American film directed by Cameron Crowe and starring Tom Cruise, Cuba Gooding Jr., and Renée Zellweger. Inspired by a real-life experience of sports agent Leigh Steinberg, the film received positive reviews from critics and was a financial success, grossing over $273 million worldwide. It was nominated for multiple awards, including five Academy Awards and three Golden Globes, with Cuba Gooding Jr. winning Best Supporting Actor.", "podcast_details": {"podcast_details": {"links": [{"href": "https://feeds.soundcloud.com/users/soundcloud:users:119277822/sounds.rss", "rel": "self", "type": "application/rss+xml"}, {"href": "https://feeds.soundcloud.com/users/soundcloud:users:119277822/sounds.rss?before=173277531", "rel": "next", "type": "application/rss+xml"}, {"rel": "alternate", "type": "text/html", "href": "http://lineardigressions.com"}], "title": "Linear Digressions", "title_detail": {"type": "text/plain", "language": null, "base": "https://feeds.feedburner.com/udacity-linear-digressions?format=xml", "value": "Linear Digressions"}, "link": "http://lineardigressions.com", "published": "Sun, 26 Jul 2020 23:32:44 +0000", "published_parsed": [2020, 7, 26, 23, 32, 44, 6, 208, 0], "updated": "Sun, 26 Jul 2020 23:32:44 +0000", "updated_parsed": [2020, 7, 26, 23, 32, 44, 6, 208, 0], "ttl": "60", "language": "en", "rights": "All rights reserved", "rights_detail": {"type": "text/plain", "language": null, "base": "https://feeds.feedburner.com/udacity-linear-digressions?format=xml", "value": "All rights reserved"}, "publisher": "feeds@soundcloud.com (SoundCloud Feeds)", "publisher_detail": {"name": "Ben Jaffe and Katie Malone", "email": "hello@lineardigressions.com"}, "subtitle": "Explorations in Machine Learning and Data Science", "subtitle_detail": {"type": "text/plain", "language": null, "base": "https://feeds.feedburner.com/udacity-linear-digressions?format=xml", "value": "Explorations in Machine Learning and Data Science"}, "authors": [{"name": "Ben Jaffe and Katie Malone", "email": "hello@lineardigressions.com"}], "author": "Ben Jaffe and Katie Malone (hello@lineardigressions.com)", "author_detail": {"name": "Ben Jaffe and Katie Malone", "email": "hello@lineardigressions.com"}, "itunes_explicit": null, "image": {"href": "https://i1.sndcdn.com/avatars-000193869760-sy993g-original.jpg", "title": "Linear Digressions", "title_detail": {"type": "text/plain", "language": null, "base": "https://feeds.feedburner.com/udacity-linear-digressions?format=xml", "value": "Linear Digressions"}, "links": [{"rel": "alternate", "type": "text/html", "href": "http://lineardigressions.com"}], "link": "http://lineardigressions.com"}, "tags": [{"term": "data", "scheme": "http://www.itunes.com/", "label": null}, {"term": "science", "scheme": "http://www.itunes.com/", "label": null}, {"term": "machine", "scheme": "http://www.itunes.com/", "label": null}, {"term": "learning", "scheme": "http://www.itunes.com/", "label": null}, {"term": "linear", "scheme": "http://www.itunes.com/", "label": null}, {"term": "digressions", "scheme": "http://www.itunes.com/", "label": null}, {"term": "Technology", "scheme": "http://www.itunes.com/", "label": null}], "summary": "In each episode, your hosts explore machine learning and data science through interesting (and often very unusual) applications.", "summary_detail": {"type": "text/plain", "language": null, "base": "https://feeds.feedburner.com/udacity-linear-digressions?format=xml", "value": "In each episode, your hosts explore machine learning and data science through interesting (and often very unusual) applications."}}, "first_episode": {"id": "tag:soundcloud,2010:tracks/865092628", "guidislink": false, "title": "So long, and thanks for all the fish", "title_detail": {"type": "text/plain", "language": null, "base": "https://feeds.feedburner.com/udacity-linear-digressions?format=xml", "value": "So long, and thanks for all the fish"}, "published": "Sun, 26 Jul 2020 23:32:44 +0000", "published_parsed": [2020, 7, 26, 23, 32, 44, 6, 208, 0], "links": [{"rel": "alternate", "type": "text/html", "href": "https://soundcloud.com/linear-digressions/so-long-and-thanks-for-all-the-fish"}, {"length": "17156421", "type": "audio/mpeg", "href": "https://feeds.soundcloud.com/stream/865092628-linear-digressions-so-long-and-thanks-for-all-the-fish.mp3", "rel": "enclosure"}], "link": "https://soundcloud.com/linear-digressions/so-long-and-thanks-for-all-the-fish", "itunes_duration": "00:35:44", "authors": [{"name": "Ben Jaffe and Katie Malone"}, {"name": "Ben Jaffe and Katie Malone", "email": "hello@lineardigressions.com"}], "author": "hello@lineardigressions.com (Ben Jaffe and Katie Malone)", "author_detail": {"name": "Ben Jaffe and Katie Malone"}, "itunes_explicit": null, "summary": "All good things must come to an end, including this podcast. This is the last episode we plan to release, and it doesn’t cover data science—it’s mostly reminiscing, thanking our wonderful audience (that’s you!), and marveling at how this thing that started out as a side project grew into a huge part of our lives for over 5 years.\n\nIt’s been a ride, and a real pleasure and privilege to talk to you each week. Thanks, best wishes, and good night!\n\n—Katie and Ben", "summary_detail": {"type": "text/plain", "language": null, "base": "https://feeds.feedburner.com/udacity-linear-digressions?format=xml", "value": "All good things must come to an end, including this podcast. This is the last episode we plan to release, and it doesn’t cover data science—it’s mostly reminiscing, thanking our wonderful audience (that’s you!), and marveling at how this thing that started out as a side project grew into a huge part of our lives for over 5 years.\n\nIt’s been a ride, and a real pleasure and privilege to talk to you each week. Thanks, best wishes, and good night!\n\n—Katie and Ben"}, "subtitle": "All good things must come to an end, including th…", "subtitle_detail": {"type": "text/plain", "language": null, "base": "https://feeds.feedburner.com/udacity-linear-digressions?format=xml", "value": "All good things must come to an end, including th…"}, "content": [{"type": "text/plain", "language": null, "base": "https://feeds.feedburner.com/udacity-linear-digressions?format=xml", "value": "All good things must come to an end, including this podcast. This is the last episode we plan to release, and it doesn’t cover data science—it’s mostly reminiscing, thanking our wonderful audience (that’s you!), and marveling at how this thing that started out as a side project grew into a huge part of our lives for over 5 years.\n\nIt’s been a ride, and a real pleasure and privilege to talk to you each week. Thanks, best wishes, and good night!\n\n—Katie and Ben"}], "image": {"href": "https://i1.sndcdn.com/avatars-000193869760-sy993g-original.jpg"}, "tags": [{"term": "data", "scheme": "http://www.itunes.com/", "label": null}, {"term": "science", "scheme": "http://www.itunes.com/", "label": null}, {"term": "machine", "scheme": "http://www.itunes.com/", "label": null}, {"term": "learning", "scheme": "http://www.itunes.com/", "label": null}, {"term": "linear", "scheme": "http://www.itunes.com/", "label": null}, {"term": "digressions", "scheme": "http://www.itunes.com/", "label": null}]}, "transcribed_data": {"podcast_title": "Linear Digressions", "episode_title": "So long, and thanks for all the fish", "episode_image": "https://i1.sndcdn.com/avatars-000193869760-sy993g-original.jpg", "episode_transcript": " Ben Cushman Hey, Katie. Katie Svoboda Hi, Ben. Ben Cushman So it has been five and a half years since we started this podcast, over five and a half years since we started this podcast. We've covered a lot of topics. And we're out of stuff to talk about. There's no more data science. No, I'm... Ben Cushman This is the end of the road. Katie Svoboda I'm being facetious about that, but no, in all seriousness, this is probably the last you might hear from us for a while. We're gonna hang up our microphones, so to speak, and kind of call it a day with this podcast, I think. We wanted to do this as like a last episode to, I don't know, take a walk down memory lane or whatever. But this isn't, it's not going to be a data science episode that you have here, but more a little bit of like a retrospective and a thank you and that sort of thing. Ben Cushman Yeah, okay. Well, let's let's do it. You're listening to Linear Digressions. So Ben, I want to kick it off with a question to you. So like you said, I think you said this in the intro, we've been doing this for about five and a half years. This is episode number 293. Is that correct? Ben Cushman But who's counting? Katie Svoboda But who's counting? I'm curious, like we started to reminisce about this a couple weeks ago when we when we, you know, really started talking about winding this down, we kind of cut it off so that we could record it. Like, I'm really curious, I if you had asked me when we started this podcast, how long I thought it would last and how much of a response I thought we would get. The wildest numbers I could have come up with would not have been anywhere near what we've actually done here, which is really cool. How about you? Is that like, has that been your experience now looking back on it? Ben Cushman That's a good question. Um, I mean, it's really hard to access a memory from five and a half years ago without retconning it, you know, but I mean, okay, so what are some of the numbers? We're we're recording this on July 13th, we're going to release in a couple of weeks, probably. So as of July 13th, the day that we're recording this, it's been 2106 days since we started. We've recorded 200, this is 293 episodes. We had- Lauren Ruffin Are you counting reruns in there? Ben Cushman Oh, yeah, I guess I'm counting reruns. Lauren Ruffin So, fewer than that in terms of unique episodes. Ben Cushman Yeah, probably 285 or something or 282. Lauren Ruffin I'll allow it. Ben Cushman I'll allow it. Lauren Ruffin I'll allow it. Ben Cushman But yeah, those are kind of insane numbers. And I don't think I would have predicted we would have been recording for over five years. I don't think, I think maybe I would have guessed 110 episodes or something. Lauren Ruffin There's no universe in which I think I would have anticipated like, oh, yeah, almost six years from now, I'll still be doing this. Yeah. But I don't know, we just like kind of never, we never really stop doing it. Ben Cushman Yeah, yeah. Lauren Ruffin Here we are. Ben Cushman I also today went on iTunes and I looked at our reviews. And at the end of every episode, it says, you know, if you can leave us a review on iTunes. And the reason we say that is because it helps bump up the podcast in what iTunes and Apple promote and also other podcasting services. But I had never gone and really read all of them. And it really helped me understand the influence that this podcast has actually had on a number of people's lives. And it's just something that I guess I knew intellectually, but I never really grok'd it. And I, to be honest, I'm not even sure that I've grok'd it now. Lauren Ruffin Yeah, it's, I've done that occasionally, too over the years. It's a humbling experience to, because, you know, podcasting, it's a strength and a weakness of the medium that like, I don't know, I'm just sitting here in my office by myself. This is, and I'm talking to my buddy on the phone. It's the least intimidating thing you can imagine. But if I were to imagine giving a talk in front of a commensurate number of people to like effectively how many people we're talking to right now, I would find that very off putting. So on the one hand, it's a nice insulation from stage fright. And it allows me to really focus on the material and think about what I think is cool. And I don't feel a lot of pressure to perform every week or anything. But at the same time, it also means that there's a little bit of separation from the listener sometimes. And many people, as you know, have gotten in touch through the years. There are people that we've had wonderful conversations with when they've sent us emails. So all of those little opportunities to feel like we're in some kind of conversation with our listenership, even if it's only a tiny slice of it, feeling like there's folks on the other side of the microphone has been really lovely. I think it's, at least for me, kept me sometimes engaged during some of those weeks and months when I don't want to do a podcast. I want to just shut my computer after a long day's work and not have to think about it anymore. So yeah, I think that in brief, the longevity that we've enjoyed and the amount that we've both gotten out of this has been in large part because our audience has been so great. So thank you all so much, whether you started listening last week or you've been with us since the first episode. As an aside, I'm really curious how many people are listening to us now that have started listening to us in, gosh, this would have been like November of 2014. So I don't know, tweet at us or something if you've been there since the beginning, because I don't know, I want to buy you a beer or something. But October 7th, 2014. October 7th. Okay. Okay. Yeah. Anyway, it's the day. It's nuts. We're going to keep the email address and the website up for some significant amount of time. And so if you feel like writing to us, we will read your email. Yeah, if you're finding this far in the future of July of 2020, reach out. We're probably still around, although who's to say based on when you get this. Yeah, it's like a time capsule. Every podcast is like a time capsule. I'm curious to know how in over five years this process has evolved for you. I know that when we first started, we were literally going into a conference room at Udacity for the first couple of episodes and just sitting there and talking around a microphone. And then you moved to Chicago and we started both recording our own voices with our own microphones and having a phone call with headphones. And then we sync those up in post-production and combine them. But I don't know, has your process around thinking about the podcast or doing research or anything changed over the years? Well, at a certain point, we had enough content that I could start doing reruns and that was a game changer because then I could take a week off. That's not what you meant. But yeah, I think there are big parts of it that, especially process parts of it, that kind of become second nature after a while. So I don't know if people know this, but I edit all of the episodes. So when we record, it's usually pretty close to straight through. Like I have a very light touch when it comes to editing. We've gotten a couple of emails from people being like, hey, do you want to pay me to edit your podcast? Yeah. I think it's fine. No, it's actually I've been tempted on a few occasions because it's, you know, it takes an hour or two to do that, go through that editing process. And sometimes, you know, I got other stuff going on. But yeah, I think one thing that's changed is I can edit the podcast and totally multitask other times. Like I'll sit there and like read the newspaper or something while I'm editing. And I can hear pauses and ums and these kinds of things that normally I would edit out without. I have like maybe 5% of my brain engaged, but I can, I could edit in my sleep if I needed to. So I don't know if that's, yeah, I don't know if that's what you meant, but I guess I mean, that's, that's fascinating. An adaptation. There was the one time that I accidentally uploaded the wrong file. And so everyone heard this pretty recently. This was like six months ago, maybe. And so everybody heard like the one that we hadn't edited that had all the pauses and the ums and the table talk and stuff. So it's not available on the feed anymore. If you heard it, that was like a, I don't know, it's like a stamp that's got a misprint on it or something. Yeah. That would be any baby with five legs. Exactly. Yeah. But that was, that was only a little bit mortifying. And you know, I, I actually, I'm kind of, I think if when I was younger, I would have been a little embarrassed about that, but I think it's kind of delightful knowing a little bit more about how the sausage gets made gets made. I don't know very much about machine learning or data science. And so in a lot of these pauses, you know, you'll finish saying something and then I'll I'll say, okay, where do you want to go? Like where, where do you want to take this so I can ask the right question? Or because I just have no idea what to ask. So it's, it's definitely, I mean, my side of it, it's very collaborative because you, you've always helped kind of guide me to have the right understanding enough that I can guide the listener. And I've, I've always been really appreciative of that. Well, and I think that's part of the strength of this particular setup that we have. There are many, you know, wonderful ways that two people can host a podcast together. But I think with data science and machine learning, you know, because so much of what we talk about is fairly technical, you know, I try to make it accessible. I try to tread lightly on some of the heaviest technical aspects. But at the end of the day, having you there as a genuine, interested, intelligent, non-expert, I think actually makes the podcast much more successful than it would be if it were just me nerding out on my own. Oh, and as an aside, as we were talking about longevity of this whole project, like if this were just me doing it by myself and I sat in a room for 20 or 30 minutes every week and talk to myself about machine learning, like I would have quit this like so many years ago. It's not even funny. So I think there's a, there's for sure a, it's not just like a thing that we do together, but there's like a real teamwork to it. So, yeah, yeah, pleasures online for sure. Do you want to talk at all about like why we're quitting? Just because like we haven't said, I don't want to make a big thing, but... Yeah, yeah, yeah. Okay. Speaking of table talk. Yeah, right. We could just leave this in. I have half a mind to do that, but I don't know. I'll sleep on it. Why not? Yeah. So, Katie, why are we stopping the podcast? Oh, no particular reason. Honestly, it just like can't do this forever. But yeah, I mean, I've been, I was being mostly facetious at the beginning of this when I said that we had data science was done and we had covered it all. But that's a little bit of the feeling sometimes that I've had more often in the last year or two is, you know, data science has been actively evolving as a field over the course of the time we've been running this podcast. And I think that's been reflected a lot in the content that, at least for me, that I've chosen to cover. It's reflected the fact that, you know, much of data science machine learning is now as much about how do we manage this field? How do we do it responsibly? How do we think about doing it at scale? It's as much about that as like the technical algorithms, which was primarily where we focused at the beginning part of the podcast when people were just didn't even know what the realm of the possible was. And so in the course of that evolution, I've also felt like, you know, a podcast I still think is a great medium. And I love it as an overall way of communicating. But feeling like there are other ways of contributing that are, I think, a little bit more exciting to me right now and that I would like to have a little bit more time and space to focus on. And feeling like having a weekly podcast that just keeps going forever. You know, feeling like there was less of a less of a pull of the content that excited me the most. And it's not to say that, yeah, I haven't liked learning about all this stuff. I always love learning about all this stuff. But there were a lot more times recently in the last couple of years where I'm like, oh, I have to think of something to talk about instead of being like, oh, here's a thing that I had that I had been thinking about anyway. And the podcast gives me an opportunity to talk about it. Does that make sense? Yeah, it does. And actually, I'm remembering how you were talking about this is on the four year anniversary episode that we did a year and a half ago. I asked about how your motivations have changed. And you talked about the original motivation was you just had all of these scraps, all of these ideas and things that as you were making the course for Udacity, you found there all of these things that you wanted to talk about that were really interesting. But there wasn't really a way to squeeze them into the course. And so, you know, they got left on the cutting room floor. And so the part of the genesis of the podcast was thinking, wow, there are all these things to talk about. Why not make a podcast and talk about them? And it can, you know, all the episodes can be shorter than like a full course or a lesson. And we can talk about these pieces. And so we did that for maybe six months. And then we had chewed through the backlog. Right. And they were like, oh, but there's still all this other interesting stuff. Yeah. And then at a certain point, we chewed through all of that backlog, too. And I was like, well, I guess we need to go start learning some more stuff so that we have things to talk about. And honestly, that's been one of the most rewarding parts about all of this is it for sure has pushed me. There are many weeks where I have to basically go out and learn something that week so that I have something to talk about. And that will being in that mindset week after week, month after month, year after year pushes you to think about things that you otherwise never would have learned about. Right. I think at this point, I have for sure started to forget many of the things that I have talked about. So at a certain point, you're stuffing content in the top of your brain and the old stuff is falling out the back. It's falling at the bottom. Yeah. I'm not sure that it doesn't accrue infinitely. But as a general exercise, I've found that to be very cool and rewarding. And I will miss that forcing mechanism, I think. But that's life. I've learned a lot doing this too. And I really do feel like I just feel incredibly lucky that every week or every two weeks, I guess we record two every two weeks, I get to show up and I get to learn something new about something that I probably wouldn't learn. And all of these different technical fields are kind of connected in different ways. It's useful to know what a Markov chain is in my field. Not really, really useful, but I learned that here talking to you. You know, I learned how neural nets work or at least the basics of it. I learned about supervised learning, which is a really simple concept, but it formalized it as a thing in my mind. You know? And we just talked about a lot of really interesting things too. We talked about gravitational waves and the search for those. We talked about a bunch of medical stuff. One of the titles of our episodes was curing cancer with machine learning is super hard. And also answered a lot of the questions I had. If you have an algorithm that can identify something in an X-ray better than a doctor, well, you've solved the problem, right? And the answer is no, you haven't solved the problem because there are a lot of things that a doctor can do that a machine learning algorithm by definition can't do. Yeah, GPT-2, we talked about a lot of things over the years and more than any individual episode teaching me a thing comprehensively. I feel like now after listening, after making and listening to all of these episodes, I have this fuzzy understanding of machine learning that's actually really valuable in my field as just a software engineer. So, yeah, it's been a really wild ride and I had no idea that I was going to learn this stuff. That makes me feel warm and fuzzy. Is there anything that we didn't cover that you wish we had? I feel like you had five years to be doing requests. So if there's anything left, it's your fault, not mine. But I'm curious if there's anything that strikes you. Let me not phrase that as topics you wish we'd covered because that seems a little less interesting. Opportunities, like, man, that was a really cool episode. That one stands out to me as a high point. I wish we'd been able to do more of those. Experiments that we talked about trying but maybe never really fully executed on. Anything like that. Yeah. One of them I would say, I wish you had finished the UM detector. Remember, you're making the UM detector to remove all of the UMs from our raw recordings. People loved that episode. I heard people would mention that for years afterwards. I was shocked. Yeah. And I just found that fascinating. Also, it is interesting to note that as that problem got really difficult and you realized, maybe I'm not going to solve this, you just stopped saying UM as much. Well, I edited out, too. Well, that's true. I picked up a new verbal tick, though. Here's one that I edited out. I say, you know, or I say kind of. Those are my qualifiers that I will use when I want to be slightly indirect. Okay. What are my oddities, then? Because I don't edit the episodes. So one of the things that you do is you're usually the first voice that speaks after the guitar, like, baa-brrm-brrm at the beginning. And what you almost always start with is, okay, so. Really? Yeah. I can't. I think I usually leave it in. So that would be easy enough to listen for because it usually happens in the first minute. Okay. And then, yeah, and it's also your, it's your kind of cold start intro. So a lot of times if we will have an aside where we're trying to craft out a little bit, like a question or a comment for you to interject so we can keep the episode moving, very often that will be the way that you will pick up when your, you know, your speech starts. There was my, you know. I heard it. I heard it this time. I heard it. Yeah. Oh, man. Things, this will never be the same. Nope. Okay, so I wanted to, I wanted to ask you about what are some of the challenges that you found over the years in recording? Yeah, that's a really good question. I mean, personally, sometimes I'm just tired. I don't know if that's what you meant, but that's a real thing. Oh, yeah, that's, that's one. Yeah, I think there's a certain amount of, it is not easy to come up with fresh, interesting content, week over week. So to some extent you can, you can delay that and push it off a little bit by doing reruns and, you know, totally candidly, not every episode we've released. I've been like, wow, that was, that was amazing. Some weeks you're like, I just need to put something out. And A minus is what it's going to be this week. I don't have anything in particular in mind when I say that, but just to acknowledge that, you know, week over week, fresh content is very challenging, I found. I also think that with data science, with certain topics, I feel like there's some obligation on my part to deal with their technical complexity, if that's a really important part of appreciating the algorithm or understanding it or the topic. And, you know, I am not a an expert in all of the things that we talk about. A lot of times I'm reading the paper and trying to learn it so that I can talk about it within this context. And so feeling like I'm able to download all of that technical content, synthesize it enough that I can play it back in a way that's approachable and that's the right amount is as accurate as possible for sure. Although I'm sure I've made many mistakes, hopefully none of them gaping ones, but I'm sure there are many, many things I haven't gotten quite technically correct if there were, say, an expert listening. Right. Yeah. And sometimes we get those emails actually. Yeah, and everyone has been always super kind and constructive. Yeah. So I actually, I really don't mind them at all. And sometimes they have challenged me to think about things in a new way or they've helped me realize that there was something that I didn't see. So I never, I never have any problem with that. But yes, occasionally people will reach out and give me a gentle correction, let's say, and I appreciate that. There's also background noise. I'm very familiar with the sound of your dog's collar. My dog's collar. I live in downtown Chicago. And so there have been many times where we have had to wait for a firetruck siren firetruck. Yep. Yep. Yep. You talk to your cat a lot. I do. I mean, I know that my, yeah, I guess I do. Also, this is a challenge I did not expect. I should have foreseen this when I, when I got her, my cat Ella, is I'm always terrified that she's going to hop on the table and step on the wrong button and stop recording and delete the recording. And then we'll have to start all over again. That would be a mess. Yeah. So I'm, I'm always terrified of that. And that's a challenge. But she's never done it. She's never done it. No. Good cat. Okay, so I have a strange question for you. Just as we kind of finish this episode up. If, if you could magically have knowledge in a particular direction, where would you have taken linear digressions? Like, if I could snap my fingers and have a rich vein of expertise in some kind of domain that could then be presumably fodder for another year's worth of episodes or something. Yeah. Oh, that's a good question. I think it would be around technical issues, and especially ones that become most relevant when you're working on production allies models and like really large scale systems and you know I've worked at a couple of startups. I was a grad student when I started this. So I guess like when I was a grad student, we were looking working with pretty big data sets in physics. But for example, like you work at Facebook and Netflix, and there are technical issues and also like processes and best practices and all kinds of stuff that comes into play when you're dealing with data sets of that size and organizations of that size. And so I think that those, those kinds of technical and organizational topics are, I think they're really interesting. I think they're only a subset of the field really has to deal with them so I'll acknowledge that, you know, it would have been a little bit, the podcast might have taken on a slightly different flavor. More niche. Yeah, but I think they're, it's important and I think it's a critical part of thinking about data science as a long term field not just like what is data science right now but how is it going to evolve over the coming years how has it been evolving over the previous years and like the big technical systems that people are are architecting to orchestrate and productionalize and monitor all of these systems like there's a lot of technical complexity that goes into solving those problems and I think having a, you know, having that be the basis of a series of conversations would have been for sure really interesting to me. I think, if it were me. One area I'm really interested in is, I don't know exactly what to call it but the direction of AI and like singularity and, oh, generalized AI and super AI what their super intelligent super intelligent Yeah. Um, that's a really interesting kind of field of study with huge ramifications, and not very much like real world applicability right now. It's, it's kind of future tripping in some ways but trying to use data to do it. So it's a really interesting. It's a really interesting field. I think anybody wants to start that podcast and they're looking for a co host. Yeah, right. Ben at linear.com, I will do it. Yes. Um, so what other podcasts, do you listen to. I listened to mostly non technical podcasts. My favorite is one called everything is alive. And it's totally random. Yeah. I've heard of it. Yeah, it's interviews with inanimate objects. Exactly, that are still a I mean they're played by actors who are articulating what it's like to be a balloon or a mirror, or a subway seat, or whatever. And it's, it's a very strange concept but it works so well. That's my favorite. Also listen to this American life. I like the daily from the New York Times. Yeah. 99% visible. How about you. I like reply all. Oh yeah, that's good. That's, that's a great one. There's an episode called no dumb questions. Sorry, there's a podcast called no dumb questions, which if you've ever seen the YouTube channel smarter every day, it's that guy, and another guy. And it's just always really interesting content. And also, I would say a podcast called the soundtrack show. This guy David W Collins basically takes movie soundtracks and pulls them apart and examines them in a very accessible way. I just love that one. Yeah, you're kind of a music guy so that yeah sense to me. Cool. What do you. So what are you going to do with your time now that you're not, you know, spending an hour researching. Every week, and an hour editing every week. I have a backlog of books, I want to read so I'm probably just going to catch up my on my reading a little bit, I am interested in spending a little bit more time coding, and perhaps contributing to some open source projects, so want a little bit of a poking around at a couple things right now, trying to sniff out what might be a good thing to work on but I really like coding, and it's something that I don't get to do as much as a part of my day job anymore as I did perhaps when I started this so that's how I'm thinking about it right now. Nice. Yeah. How about you. I guess for you it's a little bit more like recording is the main. Yeah, is the main time commitment you don't have to prep or. Less time. Yeah, less time. Yeah. But I am picking up the cello. It's my latest instrument. Cool. It's hard. It's so hard. Well, I mean if you ever want to give a little, give a little concert. I mean like you said we're going to keep the feed up and, and make it available for folks for a long time to come so who knows maybe there will be an occasional drop in. Don't unsubscribe yet let's say just like leave the leave the feed open maybe there will be an occasional line that we will drop you but I can, I can give you a quick concert which is, you are listening to linear digressions. Very good. There you go. Yeah, I guess we're kind of, we're kind of at the end of it. Yeah, I think that's it. I don't have anything else to say. I, it's been really fun. Thank you for listening to us ramble for the last 30 minutes or so. If anybody's still listening. That'd be, that'd be amazing. If someone listened to 293 episodes and then got bored in the last 10 minutes. Yeah, I'm done. Yeah. But yeah, it's been really fun. I will, you know, I'm, I'm so glad we did this, I will be proud of this forever. And just thanks to everyone who's been a subscriber or a supporter, or has interacted with us, whether you're listening or not we appreciate all of you. We'll miss you. But if you ever, I don't know, bump into me at a conference or something please come up and say hello. Yeah, always always feel free to drop us a line. Yeah, Ben or Katie, with an IE at LinearDigressions.com. Thanks everybody. It's been fun. Thank you, Ben. You've been wonderful. Thank you, Katie. I have learned so much over the last five and a half years and so you were saying earlier, if it was just you in a room sitting, talking to yourself about machine learning, the podcast wouldn't have gone on for five and a half years. If it was just me in a room talking to myself about machine learning, the podcast would have lasted for half an episode. So I mean, really, really thank you so much for everything and I'm just, I just feel so privileged to have been on this ride with you. Thanks. And goodbye forever. Goodbye forever. Maybe. Linear Digressions is a creative commons endeavor, which means you can share or use it any way you like. Just tell them we said hi. To find out more about this or any other episode of Linear Digressions, go to LinearDigressions.com. And if you like this podcast, go ahead and leave us a review on iTunes so other people get to listen to this content too. You can always get in touch with either of us. Our emails are Ben at LinearDigressions.com and Katie at LinearDigressions.com. In case you have comments or suggestions for future shows, you can tweet us at Lynn Digressions. Thank you for joining us and we'll see you next time."}}, "transcribed_data": {"podcast_title": "Linear Digressions", "episode_title": "So long, and thanks for all the fish", "episode_image": "https://i1.sndcdn.com/avatars-000193869760-sy993g-original.jpg", "episode_transcript": " Ben Cushman Hey, Katie. Katie Svoboda Hi, Ben. Ben Cushman So it has been five and a half years since we started this podcast, over five and a half years since we started this podcast. We've covered a lot of topics. And we're out of stuff to talk about. There's no more data science. No, I'm... Ben Cushman This is the end of the road. Katie Svoboda I'm being facetious about that, but no, in all seriousness, this is probably the last you might hear from us for a while. We're gonna hang up our microphones, so to speak, and kind of call it a day with this podcast, I think. We wanted to do this as like a last episode to, I don't know, take a walk down memory lane or whatever. But this isn't, it's not going to be a data science episode that you have here, but more a little bit of like a retrospective and a thank you and that sort of thing. Ben Cushman Yeah, okay. Well, let's let's do it. You're listening to Linear Digressions. So Ben, I want to kick it off with a question to you. So like you said, I think you said this in the intro, we've been doing this for about five and a half years. This is episode number 293. Is that correct? Ben Cushman But who's counting? Katie Svoboda But who's counting? I'm curious, like we started to reminisce about this a couple weeks ago when we when we, you know, really started talking about winding this down, we kind of cut it off so that we could record it. Like, I'm really curious, I if you had asked me when we started this podcast, how long I thought it would last and how much of a response I thought we would get. The wildest numbers I could have come up with would not have been anywhere near what we've actually done here, which is really cool. How about you? Is that like, has that been your experience now looking back on it? Ben Cushman That's a good question. Um, I mean, it's really hard to access a memory from five and a half years ago without retconning it, you know, but I mean, okay, so what are some of the numbers? We're we're recording this on July 13th, we're going to release in a couple of weeks, probably. So as of July 13th, the day that we're recording this, it's been 2106 days since we started. We've recorded 200, this is 293 episodes. We had- Lauren Ruffin Are you counting reruns in there? Ben Cushman Oh, yeah, I guess I'm counting reruns. Lauren Ruffin So, fewer than that in terms of unique episodes. Ben Cushman Yeah, probably 285 or something or 282. Lauren Ruffin I'll allow it. Ben Cushman I'll allow it. Lauren Ruffin I'll allow it. Ben Cushman But yeah, those are kind of insane numbers. And I don't think I would have predicted we would have been recording for over five years. I don't think, I think maybe I would have guessed 110 episodes or something. Lauren Ruffin There's no universe in which I think I would have anticipated like, oh, yeah, almost six years from now, I'll still be doing this. Yeah. But I don't know, we just like kind of never, we never really stop doing it. Ben Cushman Yeah, yeah. Lauren Ruffin Here we are. Ben Cushman I also today went on iTunes and I looked at our reviews. And at the end of every episode, it says, you know, if you can leave us a review on iTunes. And the reason we say that is because it helps bump up the podcast in what iTunes and Apple promote and also other podcasting services. But I had never gone and really read all of them. And it really helped me understand the influence that this podcast has actually had on a number of people's lives. And it's just something that I guess I knew intellectually, but I never really grok'd it. And I, to be honest, I'm not even sure that I've grok'd it now. Lauren Ruffin Yeah, it's, I've done that occasionally, too over the years. It's a humbling experience to, because, you know, podcasting, it's a strength and a weakness of the medium that like, I don't know, I'm just sitting here in my office by myself. This is, and I'm talking to my buddy on the phone. It's the least intimidating thing you can imagine. But if I were to imagine giving a talk in front of a commensurate number of people to like effectively how many people we're talking to right now, I would find that very off putting. So on the one hand, it's a nice insulation from stage fright. And it allows me to really focus on the material and think about what I think is cool. And I don't feel a lot of pressure to perform every week or anything. But at the same time, it also means that there's a little bit of separation from the listener sometimes. And many people, as you know, have gotten in touch through the years. There are people that we've had wonderful conversations with when they've sent us emails. So all of those little opportunities to feel like we're in some kind of conversation with our listenership, even if it's only a tiny slice of it, feeling like there's folks on the other side of the microphone has been really lovely. I think it's, at least for me, kept me sometimes engaged during some of those weeks and months when I don't want to do a podcast. I want to just shut my computer after a long day's work and not have to think about it anymore. So yeah, I think that in brief, the longevity that we've enjoyed and the amount that we've both gotten out of this has been in large part because our audience has been so great. So thank you all so much, whether you started listening last week or you've been with us since the first episode. As an aside, I'm really curious how many people are listening to us now that have started listening to us in, gosh, this would have been like November of 2014. So I don't know, tweet at us or something if you've been there since the beginning, because I don't know, I want to buy you a beer or something. But October 7th, 2014. October 7th. Okay. Okay. Yeah. Anyway, it's the day. It's nuts. We're going to keep the email address and the website up for some significant amount of time. And so if you feel like writing to us, we will read your email. Yeah, if you're finding this far in the future of July of 2020, reach out. We're probably still around, although who's to say based on when you get this. Yeah, it's like a time capsule. Every podcast is like a time capsule. I'm curious to know how in over five years this process has evolved for you. I know that when we first started, we were literally going into a conference room at Udacity for the first couple of episodes and just sitting there and talking around a microphone. And then you moved to Chicago and we started both recording our own voices with our own microphones and having a phone call with headphones. And then we sync those up in post-production and combine them. But I don't know, has your process around thinking about the podcast or doing research or anything changed over the years? Well, at a certain point, we had enough content that I could start doing reruns and that was a game changer because then I could take a week off. That's not what you meant. But yeah, I think there are big parts of it that, especially process parts of it, that kind of become second nature after a while. So I don't know if people know this, but I edit all of the episodes. So when we record, it's usually pretty close to straight through. Like I have a very light touch when it comes to editing. We've gotten a couple of emails from people being like, hey, do you want to pay me to edit your podcast? Yeah. I think it's fine. No, it's actually I've been tempted on a few occasions because it's, you know, it takes an hour or two to do that, go through that editing process. And sometimes, you know, I got other stuff going on. But yeah, I think one thing that's changed is I can edit the podcast and totally multitask other times. Like I'll sit there and like read the newspaper or something while I'm editing. And I can hear pauses and ums and these kinds of things that normally I would edit out without. I have like maybe 5% of my brain engaged, but I can, I could edit in my sleep if I needed to. So I don't know if that's, yeah, I don't know if that's what you meant, but I guess I mean, that's, that's fascinating. An adaptation. There was the one time that I accidentally uploaded the wrong file. And so everyone heard this pretty recently. This was like six months ago, maybe. And so everybody heard like the one that we hadn't edited that had all the pauses and the ums and the table talk and stuff. So it's not available on the feed anymore. If you heard it, that was like a, I don't know, it's like a stamp that's got a misprint on it or something. Yeah. That would be any baby with five legs. Exactly. Yeah. But that was, that was only a little bit mortifying. And you know, I, I actually, I'm kind of, I think if when I was younger, I would have been a little embarrassed about that, but I think it's kind of delightful knowing a little bit more about how the sausage gets made gets made. I don't know very much about machine learning or data science. And so in a lot of these pauses, you know, you'll finish saying something and then I'll I'll say, okay, where do you want to go? Like where, where do you want to take this so I can ask the right question? Or because I just have no idea what to ask. So it's, it's definitely, I mean, my side of it, it's very collaborative because you, you've always helped kind of guide me to have the right understanding enough that I can guide the listener. And I've, I've always been really appreciative of that. Well, and I think that's part of the strength of this particular setup that we have. There are many, you know, wonderful ways that two people can host a podcast together. But I think with data science and machine learning, you know, because so much of what we talk about is fairly technical, you know, I try to make it accessible. I try to tread lightly on some of the heaviest technical aspects. But at the end of the day, having you there as a genuine, interested, intelligent, non-expert, I think actually makes the podcast much more successful than it would be if it were just me nerding out on my own. Oh, and as an aside, as we were talking about longevity of this whole project, like if this were just me doing it by myself and I sat in a room for 20 or 30 minutes every week and talk to myself about machine learning, like I would have quit this like so many years ago. It's not even funny. So I think there's a, there's for sure a, it's not just like a thing that we do together, but there's like a real teamwork to it. So, yeah, yeah, pleasures online for sure. Do you want to talk at all about like why we're quitting? Just because like we haven't said, I don't want to make a big thing, but... Yeah, yeah, yeah. Okay. Speaking of table talk. Yeah, right. We could just leave this in. I have half a mind to do that, but I don't know. I'll sleep on it. Why not? Yeah. So, Katie, why are we stopping the podcast? Oh, no particular reason. Honestly, it just like can't do this forever. But yeah, I mean, I've been, I was being mostly facetious at the beginning of this when I said that we had data science was done and we had covered it all. But that's a little bit of the feeling sometimes that I've had more often in the last year or two is, you know, data science has been actively evolving as a field over the course of the time we've been running this podcast. And I think that's been reflected a lot in the content that, at least for me, that I've chosen to cover. It's reflected the fact that, you know, much of data science machine learning is now as much about how do we manage this field? How do we do it responsibly? How do we think about doing it at scale? It's as much about that as like the technical algorithms, which was primarily where we focused at the beginning part of the podcast when people were just didn't even know what the realm of the possible was. And so in the course of that evolution, I've also felt like, you know, a podcast I still think is a great medium. And I love it as an overall way of communicating. But feeling like there are other ways of contributing that are, I think, a little bit more exciting to me right now and that I would like to have a little bit more time and space to focus on. And feeling like having a weekly podcast that just keeps going forever. You know, feeling like there was less of a less of a pull of the content that excited me the most. And it's not to say that, yeah, I haven't liked learning about all this stuff. I always love learning about all this stuff. But there were a lot more times recently in the last couple of years where I'm like, oh, I have to think of something to talk about instead of being like, oh, here's a thing that I had that I had been thinking about anyway. And the podcast gives me an opportunity to talk about it. Does that make sense? Yeah, it does. And actually, I'm remembering how you were talking about this is on the four year anniversary episode that we did a year and a half ago. I asked about how your motivations have changed. And you talked about the original motivation was you just had all of these scraps, all of these ideas and things that as you were making the course for Udacity, you found there all of these things that you wanted to talk about that were really interesting. But there wasn't really a way to squeeze them into the course. And so, you know, they got left on the cutting room floor. And so the part of the genesis of the podcast was thinking, wow, there are all these things to talk about. Why not make a podcast and talk about them? And it can, you know, all the episodes can be shorter than like a full course or a lesson. And we can talk about these pieces. And so we did that for maybe six months. And then we had chewed through the backlog. Right. And they were like, oh, but there's still all this other interesting stuff. Yeah. And then at a certain point, we chewed through all of that backlog, too. And I was like, well, I guess we need to go start learning some more stuff so that we have things to talk about. And honestly, that's been one of the most rewarding parts about all of this is it for sure has pushed me. There are many weeks where I have to basically go out and learn something that week so that I have something to talk about. And that will being in that mindset week after week, month after month, year after year pushes you to think about things that you otherwise never would have learned about. Right. I think at this point, I have for sure started to forget many of the things that I have talked about. So at a certain point, you're stuffing content in the top of your brain and the old stuff is falling out the back. It's falling at the bottom. Yeah. I'm not sure that it doesn't accrue infinitely. But as a general exercise, I've found that to be very cool and rewarding. And I will miss that forcing mechanism, I think. But that's life. I've learned a lot doing this too. And I really do feel like I just feel incredibly lucky that every week or every two weeks, I guess we record two every two weeks, I get to show up and I get to learn something new about something that I probably wouldn't learn. And all of these different technical fields are kind of connected in different ways. It's useful to know what a Markov chain is in my field. Not really, really useful, but I learned that here talking to you. You know, I learned how neural nets work or at least the basics of it. I learned about supervised learning, which is a really simple concept, but it formalized it as a thing in my mind. You know? And we just talked about a lot of really interesting things too. We talked about gravitational waves and the search for those. We talked about a bunch of medical stuff. One of the titles of our episodes was curing cancer with machine learning is super hard. And also answered a lot of the questions I had. If you have an algorithm that can identify something in an X-ray better than a doctor, well, you've solved the problem, right? And the answer is no, you haven't solved the problem because there are a lot of things that a doctor can do that a machine learning algorithm by definition can't do. Yeah, GPT-2, we talked about a lot of things over the years and more than any individual episode teaching me a thing comprehensively. I feel like now after listening, after making and listening to all of these episodes, I have this fuzzy understanding of machine learning that's actually really valuable in my field as just a software engineer. So, yeah, it's been a really wild ride and I had no idea that I was going to learn this stuff. That makes me feel warm and fuzzy. Is there anything that we didn't cover that you wish we had? I feel like you had five years to be doing requests. So if there's anything left, it's your fault, not mine. But I'm curious if there's anything that strikes you. Let me not phrase that as topics you wish we'd covered because that seems a little less interesting. Opportunities, like, man, that was a really cool episode. That one stands out to me as a high point. I wish we'd been able to do more of those. Experiments that we talked about trying but maybe never really fully executed on. Anything like that. Yeah. One of them I would say, I wish you had finished the UM detector. Remember, you're making the UM detector to remove all of the UMs from our raw recordings. People loved that episode. I heard people would mention that for years afterwards. I was shocked. Yeah. And I just found that fascinating. Also, it is interesting to note that as that problem got really difficult and you realized, maybe I'm not going to solve this, you just stopped saying UM as much. Well, I edited out, too. Well, that's true. I picked up a new verbal tick, though. Here's one that I edited out. I say, you know, or I say kind of. Those are my qualifiers that I will use when I want to be slightly indirect. Okay. What are my oddities, then? Because I don't edit the episodes. So one of the things that you do is you're usually the first voice that speaks after the guitar, like, baa-brrm-brrm at the beginning. And what you almost always start with is, okay, so. Really? Yeah. I can't. I think I usually leave it in. So that would be easy enough to listen for because it usually happens in the first minute. Okay. And then, yeah, and it's also your, it's your kind of cold start intro. So a lot of times if we will have an aside where we're trying to craft out a little bit, like a question or a comment for you to interject so we can keep the episode moving, very often that will be the way that you will pick up when your, you know, your speech starts. There was my, you know. I heard it. I heard it this time. I heard it. Yeah. Oh, man. Things, this will never be the same. Nope. Okay, so I wanted to, I wanted to ask you about what are some of the challenges that you found over the years in recording? Yeah, that's a really good question. I mean, personally, sometimes I'm just tired. I don't know if that's what you meant, but that's a real thing. Oh, yeah, that's, that's one. Yeah, I think there's a certain amount of, it is not easy to come up with fresh, interesting content, week over week. So to some extent you can, you can delay that and push it off a little bit by doing reruns and, you know, totally candidly, not every episode we've released. I've been like, wow, that was, that was amazing. Some weeks you're like, I just need to put something out. And A minus is what it's going to be this week. I don't have anything in particular in mind when I say that, but just to acknowledge that, you know, week over week, fresh content is very challenging, I found. I also think that with data science, with certain topics, I feel like there's some obligation on my part to deal with their technical complexity, if that's a really important part of appreciating the algorithm or understanding it or the topic. And, you know, I am not a an expert in all of the things that we talk about. A lot of times I'm reading the paper and trying to learn it so that I can talk about it within this context. And so feeling like I'm able to download all of that technical content, synthesize it enough that I can play it back in a way that's approachable and that's the right amount is as accurate as possible for sure. Although I'm sure I've made many mistakes, hopefully none of them gaping ones, but I'm sure there are many, many things I haven't gotten quite technically correct if there were, say, an expert listening. Right. Yeah. And sometimes we get those emails actually. Yeah, and everyone has been always super kind and constructive. Yeah. So I actually, I really don't mind them at all. And sometimes they have challenged me to think about things in a new way or they've helped me realize that there was something that I didn't see. So I never, I never have any problem with that. But yes, occasionally people will reach out and give me a gentle correction, let's say, and I appreciate that. There's also background noise. I'm very familiar with the sound of your dog's collar. My dog's collar. I live in downtown Chicago. And so there have been many times where we have had to wait for a firetruck siren firetruck. Yep. Yep. Yep. You talk to your cat a lot. I do. I mean, I know that my, yeah, I guess I do. Also, this is a challenge I did not expect. I should have foreseen this when I, when I got her, my cat Ella, is I'm always terrified that she's going to hop on the table and step on the wrong button and stop recording and delete the recording. And then we'll have to start all over again. That would be a mess. Yeah. So I'm, I'm always terrified of that. And that's a challenge. But she's never done it. She's never done it. No. Good cat. Okay, so I have a strange question for you. Just as we kind of finish this episode up. If, if you could magically have knowledge in a particular direction, where would you have taken linear digressions? Like, if I could snap my fingers and have a rich vein of expertise in some kind of domain that could then be presumably fodder for another year's worth of episodes or something. Yeah. Oh, that's a good question. I think it would be around technical issues, and especially ones that become most relevant when you're working on production allies models and like really large scale systems and you know I've worked at a couple of startups. I was a grad student when I started this. So I guess like when I was a grad student, we were looking working with pretty big data sets in physics. But for example, like you work at Facebook and Netflix, and there are technical issues and also like processes and best practices and all kinds of stuff that comes into play when you're dealing with data sets of that size and organizations of that size. And so I think that those, those kinds of technical and organizational topics are, I think they're really interesting. I think they're only a subset of the field really has to deal with them so I'll acknowledge that, you know, it would have been a little bit, the podcast might have taken on a slightly different flavor. More niche. Yeah, but I think they're, it's important and I think it's a critical part of thinking about data science as a long term field not just like what is data science right now but how is it going to evolve over the coming years how has it been evolving over the previous years and like the big technical systems that people are are architecting to orchestrate and productionalize and monitor all of these systems like there's a lot of technical complexity that goes into solving those problems and I think having a, you know, having that be the basis of a series of conversations would have been for sure really interesting to me. I think, if it were me. One area I'm really interested in is, I don't know exactly what to call it but the direction of AI and like singularity and, oh, generalized AI and super AI what their super intelligent super intelligent Yeah. Um, that's a really interesting kind of field of study with huge ramifications, and not very much like real world applicability right now. It's, it's kind of future tripping in some ways but trying to use data to do it. So it's a really interesting. It's a really interesting field. I think anybody wants to start that podcast and they're looking for a co host. Yeah, right. Ben at linear.com, I will do it. Yes. Um, so what other podcasts, do you listen to. I listened to mostly non technical podcasts. My favorite is one called everything is alive. And it's totally random. Yeah. I've heard of it. Yeah, it's interviews with inanimate objects. Exactly, that are still a I mean they're played by actors who are articulating what it's like to be a balloon or a mirror, or a subway seat, or whatever. And it's, it's a very strange concept but it works so well. That's my favorite. Also listen to this American life. I like the daily from the New York Times. Yeah. 99% visible. How about you. I like reply all. Oh yeah, that's good. That's, that's a great one. There's an episode called no dumb questions. Sorry, there's a podcast called no dumb questions, which if you've ever seen the YouTube channel smarter every day, it's that guy, and another guy. And it's just always really interesting content. And also, I would say a podcast called the soundtrack show. This guy David W Collins basically takes movie soundtracks and pulls them apart and examines them in a very accessible way. I just love that one. Yeah, you're kind of a music guy so that yeah sense to me. Cool. What do you. So what are you going to do with your time now that you're not, you know, spending an hour researching. Every week, and an hour editing every week. I have a backlog of books, I want to read so I'm probably just going to catch up my on my reading a little bit, I am interested in spending a little bit more time coding, and perhaps contributing to some open source projects, so want a little bit of a poking around at a couple things right now, trying to sniff out what might be a good thing to work on but I really like coding, and it's something that I don't get to do as much as a part of my day job anymore as I did perhaps when I started this so that's how I'm thinking about it right now. Nice. Yeah. How about you. I guess for you it's a little bit more like recording is the main. Yeah, is the main time commitment you don't have to prep or. Less time. Yeah, less time. Yeah. But I am picking up the cello. It's my latest instrument. Cool. It's hard. It's so hard. Well, I mean if you ever want to give a little, give a little concert. I mean like you said we're going to keep the feed up and, and make it available for folks for a long time to come so who knows maybe there will be an occasional drop in. Don't unsubscribe yet let's say just like leave the leave the feed open maybe there will be an occasional line that we will drop you but I can, I can give you a quick concert which is, you are listening to linear digressions. Very good. There you go. Yeah, I guess we're kind of, we're kind of at the end of it. Yeah, I think that's it. I don't have anything else to say. I, it's been really fun. Thank you for listening to us ramble for the last 30 minutes or so. If anybody's still listening. That'd be, that'd be amazing. If someone listened to 293 episodes and then got bored in the last 10 minutes. Yeah, I'm done. Yeah. But yeah, it's been really fun. I will, you know, I'm, I'm so glad we did this, I will be proud of this forever. And just thanks to everyone who's been a subscriber or a supporter, or has interacted with us, whether you're listening or not we appreciate all of you. We'll miss you. But if you ever, I don't know, bump into me at a conference or something please come up and say hello. Yeah, always always feel free to drop us a line. Yeah, Ben or Katie, with an IE at LinearDigressions.com. Thanks everybody. It's been fun. Thank you, Ben. You've been wonderful. Thank you, Katie. I have learned so much over the last five and a half years and so you were saying earlier, if it was just you in a room sitting, talking to yourself about machine learning, the podcast wouldn't have gone on for five and a half years. If it was just me in a room talking to myself about machine learning, the podcast would have lasted for half an episode. So I mean, really, really thank you so much for everything and I'm just, I just feel so privileged to have been on this ride with you. Thanks. And goodbye forever. Goodbye forever. Maybe. Linear Digressions is a creative commons endeavor, which means you can share or use it any way you like. Just tell them we said hi. To find out more about this or any other episode of Linear Digressions, go to LinearDigressions.com. And if you like this podcast, go ahead and leave us a review on iTunes so other people get to listen to this content too. You can always get in touch with either of us. Our emails are Ben at LinearDigressions.com and Katie at LinearDigressions.com. In case you have comments or suggestions for future shows, you can tweet us at Lynn Digressions. Thank you for joining us and we'll see you next time."}, "podcast_summary": "- TL;DR: The podcast hosts are ending the podcast after five and a half years.\n- They reflect on the journey of the podcast and express gratitude for their listeners.\n- They discuss the challenges of creating fresh content and the importance of technical expertise in the field of data science.\n- The hosts share their plans for the future, including reading books and exploring open source projects.\n- They invite listeners to reach out and say hello if they run into them in person.\n- The hosts express their appreciation for each other and for the opportunity to learn and grow through the podcast.", "podcast_guest": "Ben Cushman", "podcast_highlights": "Chapter 1: The Beginning of the End\nChapter 2: Reflecting on Five and a Half Years\nChapter 3: Challenging Topics and Evolving Processes\nChapter 4: Podcasting Challenges and Strange Moments\nChapter 5: Lessons Learned and Areas of Interest\nChapter 6: The Future of Linear Digressions\nChapter 7: Fond Farewell"}