<<<<<<< HEAD
{"detailed_guest_info": "Martin Hayter Short is a Canadian-American actor, comedian, and writer who has received numerous awards, including two Primetime Emmy Awards and a Tony Award. He is known for his work on TV shows like SCTV and Saturday Night Live, as well as his performances in Broadway productions and comedy films. Short has also collaborated with Steve Martin and currently stars in the Hulu comedy series Only Murders in the Building.", "podcast_details": {"podcast_details": {"links": [{"href": "https://feeds.simplecast.com/dHoohVNH", "rel": "self", "title": "MP3 Audio", "type": "application/atom+xml"}, {"href": "https://simplecast.superfeedr.com/", "rel": "hub", "type": "text/html"}, {"rel": "alternate", "type": "text/html", "href": "https://teamcoco.com/"}], "generator_detail": {"name": "https://simplecast.com"}, "generator": "https://simplecast.com", "title": "Conan O’Brien Needs A Friend", "title_detail": {"type": "text/plain", "language": null, "base": "https://feeds.simplecast.com/dHoohVNH", "value": "Conan O’Brien Needs A Friend"}, "subtitle": "After 25 years at the Late Night desk, Conan realized that the only people at his holiday party are the men and women who work for him. Over the years and despite thousands of interviews, Conan has never made a real and lasting friendship with any of his celebrity guests. So, he started a podcast to do just that. Deeper, unboundedly playful, and free from FCC regulations, Conan O’Brien Needs a Friend is a weekly opportunity for Conan to hang out with the people he enjoys most and perhaps find some real friendship along the way.", "subtitle_detail": {"type": "text/html", "language": null, "base": "https://feeds.simplecast.com/dHoohVNH", "value": "After 25 years at the Late Night desk, Conan realized that the only people at his holiday party are the men and women who work for him. Over the years and despite thousands of interviews, Conan has never made a real and lasting friendship with any of his celebrity guests. So, he started a podcast to do just that. Deeper, unboundedly playful, and free from FCC regulations, Conan O’Brien Needs a Friend is a weekly opportunity for Conan to hang out with the people he enjoys most and perhaps find some real friendship along the way."}, "rights": "2021 Team Coco & Earwolf", "rights_detail": {"type": "text/plain", "language": null, "base": "https://feeds.simplecast.com/dHoohVNH", "value": "2021 Team Coco & Earwolf"}, "language": "en-us", "published": "Mon, 21 Aug 2023 04:05:00 +0000", "published_parsed": [2023, 8, 21, 4, 5, 0, 0, 233, 0], "updated": "Mon, 21 Aug 2023 04:05:20 +0000", "updated_parsed": [2023, 8, 21, 4, 5, 20, 0, 233, 0], "image": {"href": "https://image.simplecastcdn.com/images/d139afc2-e8b0-4ec2-bc74-fdc3c88f649a/d59c963f-c9dc-41d8-9005-369e80634b3b/3000x3000/screen-shot-2023-05-01-at-12-14-01-pm.jpg?aid=rss_feed"}, "link": "https://teamcoco.com/", "itunes_type": "episodic", "summary": "After 25 years at the Late Night desk, Conan realized that the only people at his holiday party are the men and women who work for him. Over the years and despite thousands of interviews, Conan has never made a real and lasting friendship with any of his celebrity guests. So, he started a podcast to do just that. Deeper, unboundedly playful, and free from FCC regulations, Conan O’Brien Needs a Friend is a weekly opportunity for Conan to hang out with the people he enjoys most and perhaps find some real friendship along the way.", "summary_detail": {"type": "text/plain", "language": null, "base": "https://feeds.simplecast.com/dHoohVNH", "value": "After 25 years at the Late Night desk, Conan realized that the only people at his holiday party are the men and women who work for him. Over the years and despite thousands of interviews, Conan has never made a real and lasting friendship with any of his celebrity guests. So, he started a podcast to do just that. Deeper, unboundedly playful, and free from FCC regulations, Conan O’Brien Needs a Friend is a weekly opportunity for Conan to hang out with the people he enjoys most and perhaps find some real friendship along the way."}, "authors": [{"name": "Team Coco & Earwolf", "email": "conaf@teamcoco.com"}], "author": "Team Coco & Earwolf", "author_detail": {"name": "Team Coco & Earwolf", "email": "conaf@teamcoco.com"}, "itunes_explicit": true, "itunes_new-feed-url": "https://feeds.simplecast.com/dHoohVNH", "publisher_detail": {"name": "Team Coco & Earwolf", "email": "conaf@teamcoco.com"}, "tags": [{"term": "Comedy", "scheme": "http://www.itunes.com/", "label": null}]}, "first_episode": {"id": "f8e873cc-2903-4771-a20a-f507d7e3772a", "guidislink": false, "title": "Steve Martin and Martin Short", "title_detail": {"type": "text/plain", "language": null, "base": "https://feeds.simplecast.com/dHoohVNH", "value": "Steve Martin and Martin Short"}, "summary": "Martin Short feels duped about being Conan O’Brien’s friend. Steve Martin feels sad about being Conan O’Brien’s only friend.\n\n\n\nMartin and Steve sit down to talk with Conan about his cameo appearance in their live show, season 3 of Only Murders in the Building, the origin of their working partnership, and run-ins with Elvis and Frank Sinatra.\n\n\n\nFor Conan videos, tour dates and more visit TeamCoco.com.\n\n\n\nThis episode was recorded on 5/17/2023.", "summary_detail": {"type": "text/plain", "language": null, "base": "https://feeds.simplecast.com/dHoohVNH", "value": "Martin Short feels duped about being Conan O’Brien’s friend. Steve Martin feels sad about being Conan O’Brien’s only friend.\n\n\n\nMartin and Steve sit down to talk with Conan about his cameo appearance in their live show, season 3 of Only Murders in the Building, the origin of their working partnership, and run-ins with Elvis and Frank Sinatra.\n\n\n\nFor Conan videos, tour dates and more visit TeamCoco.com.\n\n\n\nThis episode was recorded on 5/17/2023."}, "published": "Mon, 21 Aug 2023 04:05:00 +0000", "published_parsed": [2023, 8, 21, 4, 5, 0, 0, 233, 0], "authors": [{"name": "Team Coco & Earwolf", "email": "conaf@teamcoco.com"}, {"name": "Team Coco & Earwolf"}], "author": "Team Coco & Earwolf", "author_detail": {"name": "Team Coco & Earwolf", "email": "conaf@teamcoco.com"}, "links": [{"rel": "alternate", "type": "text/html", "href": "https://teamcoco.com/"}, {"length": "66360747", "type": "audio/mpeg", "href": "https://chtbl.com/track/9E9755/arttrk.com/p/ST44R/stitcher.simplecastaudio.com/c945bd13-c7f3-4f22-95b5-4bf98e12b21f/episodes/f3b78879-55a2-42c1-ad4a-07bb107c4860/audio/128/default.mp3?aid=rss_feed&awCollectionId=c945bd13-c7f3-4f22-95b5-4bf98e12b21f&awEpisodeId=f3b78879-55a2-42c1-ad4a-07bb107c4860&feed=dHoohVNH", "rel": "enclosure"}], "link": "https://teamcoco.com/", "content": [{"type": "text/html", "language": null, "base": "https://feeds.simplecast.com/dHoohVNH", "value": "<p>Martin Short feels duped about being Conan O’Brien’s friend. Steve Martin feels sad about being Conan O’Brien’s <i>only</i> friend.</p><p> </p><p>Martin and Steve sit down to talk with Conan about his cameo appearance in their live show, season 3 of Only Murders in the Building, the origin of their working partnership, and run-ins with Elvis and Frank Sinatra.</p><p> </p><p>For Conan videos, tour dates and more visit <a href=\"https://teamcoco.com/\" target=\"_blank\">TeamCoco.com</a>.</p><p> </p><p>This episode was recorded on 5/17/2023.</p>"}], "itunes_title": "Steve Martin and Martin Short", "itunes_duration": "01:09:07", "subtitle": "Martin Short feels duped about being Conan O’Brien’s friend. Steve Martin feels sad about being Conan O’Brien’s only friend.\n\n\n\nMartin and Steve sit down to talk with Conan about his cameo appearance in their live show, season 3 of Only Murders in the Building, the origin of their working partnership, and run-ins with Elvis and Frank Sinatra.\n\n\n\nFor Conan videos, tour dates and more visit TeamCoco.com.\n\n\n\nThis episode was recorded on 5/17/2023.", "subtitle_detail": {"type": "text/plain", "language": null, "base": "https://feeds.simplecast.com/dHoohVNH", "value": "Martin Short feels duped about being Conan O’Brien’s friend. Steve Martin feels sad about being Conan O’Brien’s only friend.\n\n\n\nMartin and Steve sit down to talk with Conan about his cameo appearance in their live show, season 3 of Only Murders in the Building, the origin of their working partnership, and run-ins with Elvis and Frank Sinatra.\n\n\n\nFor Conan videos, tour dates and more visit TeamCoco.com.\n\n\n\nThis episode was recorded on 5/17/2023."}, "itunes_explicit": true, "itunes_episodetype": "full"}, "transcribed_data": {"podcast_title": "Conan O’Brien Needs A Friend", "episode_title": "Steve Martin and Martin Short", "episode_image": "https://image.simplecastcdn.com/images/d139afc2-e8b0-4ec2-bc74-fdc3c88f649a/d59c963f-c9dc-41d8-9005-369e80634b3b/3000x3000/screen-shot-2023-05-01-at-12-14-01-pm.jpg?aid=rss_feed", "episode_transcript": " Hi, my name is Martin Short and I feel duped about being Conan O'Brien's friend. Hi, my name is Steve Martin and I feel sad about being Conan O'Brien's only friend. Hey there, welcome to Conan O'Brien Needs a Friend. And no, Sona was not just punching me before she fled back to her chair. You swatted her elbow first. Yeah, you did. You scooted over in your chair. No, I was trying to help her. She seemed unsteady and I would never swat at anyone. She seemed unsteady and I was helping her adjust herself in her seat. Oh, okay. I didn't realize. I think you were just angry. I was talking about how many cups you had. I didn't realize. There was a narc over here. Yeah, that's right. Get ready. This guy's working for jobs. Listen, there were some shenanigans just before the podcast started. Maybe I took a swing at Sona's shoulder, slightly missed it, and then she needed to retaliate. And then of course, teacher, teacher, I saw what happened from Mr. Matt Gourley over here. I did, and I tell the truth. I appreciate it, Matt. You're a truth teller. Even though no one asked you. You're my big geek baby. What the fuck was that? Sometimes I start speaking before I know where I'm headed. Wait a minute, sometimes. That is 97% of the time. Here are the three things that went through my head Robocop style. Like I had a readout of options. It was my big baby, my big daddy, and my big gay boy. I'm none of those things. You're none of those things. I'm not saying this is like good or right or healthy. I have a problem. I like that this seconds ago, I was taking a swing at Sona and she was returning fire by swatting at me. And then you end up the villain. Am I the villain or am I just the misunderstood genius? I appreciate it. I'm looking it up right now and no, villain and fool. Okay, big giggy. Man, you're just the worst. Well, it's faulty. The wiring's off, but someday it'll get there. I used to love when people would get really angry and try to yell at someone and swear but not be able to pull it off. And I knew people that would do that. I know someone in particular, I won't name them, but they'd be like... Shit, sir. Fuckler. And they just couldn't put it together. That's me. I'll damn you, shit man. What? Yeah. It's just so easy to curse though. Let's see it. Go ahead, genius. You fucking piece of shit, dick fuck. You're just a big sandpaper baby who's got little feet and don't even know who cheek people are. That's a good one. And the fact that you don't know who cheek people are is your worst quality. Yeah. Go buy some lips, you reach around. What? Okay. You know what? Now you're on fire. Okay. You started out, I mean, good Lord. You didn't have it earlier. Yeah, now it works. Yeah, now it's fantastic. Yeah. But Sona, you are very good. I've seen Sona get mad many times. That's amazing. And often, I have to say, not at me, just at random people. And you are terrific at swearing. I am great. I am really good at it. You are concise. Yes. They explode out of your face, these curses. Is this the way you grew up? No. My mom would be horrified that I'd be cursing. They're nice people. And I think that's why I got good at it. What do you mean? Because my mom didn't want me to curse. And so I was like, well, I'm going to show you, I'm going to curse the best out of anybody. Curse of blue streak. Yeah. Well, good for you. Thank you so much. You overcame your obstacles. My dad, no joke, cursed a lot. And I'm wondering why that's why I'm bad at cursing because I never got to exercise that muscle. My father, I have a specific memory, which is my father, you know, there wasn't much swearing in our house. Occasionally, you know. What? There wasn't. There wasn't much swearing in our house. Occasionally. You're Irish. Okay. That's nice. Wait, I'm being serious. That's terrific. You guys are good at cursing. What are you talking about? You keep youth Irish. No, the Irish curse means we have small penises. Not the Irish curse. That makes more sense. Yeah, please. That's the Irish curse. Okay. All right. I mean, I've been looking for mine for years. Oh, man. I mean, give me a map. Hell! What were you going to say? No, we're going to stick on this theme now. I've used ways to find it. Hell! Okay. No, we could go somewhere else. It's fine. Solid C+. Anyway... You dropped your penis. It's at the bottom of that tequila bottle. So anyway, no, I grew up in a very proper house. My mother really didn't want, you know, swearing, and there wasn't a lot of swearing. Really none at all. And then I'll never forget, I had my room was up in the attic. I lived up there with my brother Neil and my sister Kate. And we were, there were so many of us, they said, okay, some of you were going up to the attic and it was pretty clear who was headed up there. So I'm at the end of the attic. Now what I remember is... You're saying you didn't draw straws. Oh, no, no, we didn't draw straws. It was you three, you three up into the attic now. And we'll send a plate of food and you can figure out who gets it. There was plenty of space. A lot of empty bedrooms. Tons of rooms. Tons of rooms. Boarding house, basically. We had a car on a revolving display on the second floor. That's how much extra room we had. 1975 Buick Skylark. There was just so much extra room. But anyway, so I'm up there and I'm in my bedroom and it's dark out. And all I remember is my father was coming up and he was trying to, he was trying to find something and it was very late. And my sister Kate was not in her room at the time. I think they were doing some work in that room. And all I know is that there was a bunch of junk in there, including a big bed frame that was jutting out at a weird angle. And so I'm in my bed and I'm just about to fall asleep and my closet connected to my sister's closet. Like you could walk from one right through to the other. What? So there was, yeah, it was just a way for my sister to escape or for me to escape. It's the kind of house we lived in. Anyway, but I'm not lying. They did connect. It was just an opening and you could walk right into the other room. And so it's dark out and I'm just kind of falling asleep and my father comes up the stairs and he's looking for something in Kate's room. But it's dark. And all of a sudden I hear this unmistakable sound of his shin hitting the iron bed frame that's jutting out in the darkness. And I heard, Every single, every single swear you could ever imagine. Oh, you're censoring yourself, but he didn't. Well, I like it's funnier to me that it's just it's I remember it. It was so jarring and so traumatic. I remember it as That's how it's coming out. And I heard every swear that's ever been invented from this like, you know, very brilliant scientist. You learned it all in one fell swoop. Oh, in one. I mean, I had a recorder running and I've had them all. It's like, yep, he got every single one. And I remember just pulling the blanket over my head. Oh, my God. Did you did he have like colloquial swears? Because my dad, for some reason, had his own like jazz swear lingo where he would go, God damn it anyway. And God damn it all. Make sure you damn it every single way you can and all of it. And he would like, what does God damn it anyway mean? He would put it anyway after God damn it just completely takes the power away to God damn it anyway. It takes the power away. He put up the Christmas tree and it wouldn't work. And I love this man and I love him for this, but he'd be like, God damn it anyway. God damn it all. And these were just like, I don't know if they were like passed down through the family or what. But I now will stub a toe or something. And like I have to stop myself from going, God damn it anyway. I think that's why I go to like you're a cheek people or a tooth lover. I don't know. I just want to get away from I want to stop the cycle. We had a lot of ethnic curse words in our like a lot of Turkish ones and Armenian ones. Yeah. Well, one of my this is bad for people who actually know what I'm saying. They're bad. But like one was like, Baba Jananasiçim or, you know, Pezivekisholisheg. Things like that. Those are the things my dad said when he hit his shin. He was Turkish. My dad's Turkish. Oh my God. He said, Bada Habeshabeshi. One was I'll shit on your dad's soul. And my dad would say that to people. And sometimes like, you know, he'd do it as a throwaway. I'll shit on your dad's soul. That is fantastic. Oh, Turkey. You devils. What was the other one? One's like Pezivek is like a like a pimp or siktir is like fuck it or, you know, isholisheg is like a son of a donkey. You know, it's fine. I mean, whatever. But I'll shit on your dad's soul. Yeah, that should they should win the Olympics. Yeah, because that's graphic and poetic. Yeah. It's like figurative. It is also very gross. And I think of the show the soul as being ethereal like shit would drop through it. But no, this is proof that the soul has some viscosity. But what if the only way you could materialize a soul is to shit on it and you find like, you know, when you pour paint on the invisible man. Right. If you shit on the soul, you can trap a soul. Right. Yeah. Check your toilet bowl next time. Make sure there's nobody's soul in there. Oh, no, I just flushed Grandma. Oh, man. Well, she's going to a better place. Don't shit on Grandma's soul. She's going to a better place. The water solidization plant. Yeah. In our house, it was all Jesus, Mary and Joseph. I mean, it was all Catholic stuff. And so it didn't really it was just more of a prayer. More of a litany. Your grandma didn't swear? Oh, my God. No. My grandma, Mottie, who lived with us. I didn't I don't know why I didn't think Irish people are just they swear. No, you're thinking of pirates. No, no, my Irish grandmother was the most she was a very well educated school teacher and she lived with us and she would say, Oh, Moses. Oh, Moses. That was the and she would say it all the time. Like, what's wrong, Mottie? Nothing. Oh, Moses. Oh, God. That's like a haunted house like Flores para los Muertos. You just hear that in the night. Well, she loved bad news, too. She loved it. Oh, Mottie, something terrible happened. Oh, tell me, tell me. And she would love because the Irish love bad news. So once it was her birthday. And so I said, Hey, Mottie, happy birthday. And I jumped off the top steps of our stairway and pretended to get hurt because I thought that would make her happy. Happy birthday. And I jumped. And then I was like, Did you like that? You thought it was hurt for a second. Oh, Moses. Thank you. Thank you. Anyway, this was very educational, I think. So I will never shit on your soul. Oh, that's really nice. Wait, thinking. No, I won't. Oh, OK. OK, everybody, settle down. Settle down. Please. I want you to settle down. Sorry. I've got some exciting news. And when do I have exciting news? It's never happened. Conan O'Brien Needs a Friend is coming to you live at the Brooklyn Academy of Music for two shows, November 7th, November 8th, as part of the New York Comedy Festival. Presale tickets will be available starting this Wednesday, August 23rd at 11 a.m. That's Eastern Time with the code NYCF before the general on sale, which is Friday, August 25th at 11 a.m. ET. I'm very excited about this. I'm very excited about this. To get your tickets and all information that you need, head to nycomedyfestival.com and we will see you very soon in Brooklyn. Yes. All right. Can't waste any more time. Let's do this. Because this is very rare. My guests today, they are legends, without doubt comedic legends at the top. And they're also my personal heroes. And I'm so thrilled they're on the show today. They star in the hit Hulu series, Only Murders in the Building. I am beyond thrilled. There aren't words. Just so happy they're here. Steve Martin and Martin Short, welcome. Gentlemen, it's a rare honor to have you both here. Oh, thank you, Conan. In the same room. I'll tell you one thing. It's rare to be here. It is. I left out the word honor, but. It's just an oversight. Just before we started recording, Marty, you verbally assaulted me. No, no, no, no. I said it with love that to me when I see you, you look like someone freeze dried Prince Harry. That's all I said. My staff looks forward to any time that Marty. Pardon me? I have a staff. Wow. Jeez. What kind of podcast is this? It's very loop. It gets smaller every year. But no, fans of my show. And yes, there are fans of the work that I've done in the past. Let's not have any mock surprise about that. But they they have put together a mashup of of Marty coming on the show and ripping me apart. And it is wildly popular. Oh, really? Oh, yes, it is. It is wildly popular and it delights my writers to the point where the last time we were wrapping up the late night show, an epic 28 year run. Thank you. I'm driving to one of the last episodes that Marty's going to do and he did a extremely funny bit on it. And I'm driving to the theater. I looked down and I realized I'm doing something I rarely do, which is wear shorts. And immediately I thought I'm driving towards the Largo Theater and I thought, fuck, Marty, who's on today? Marty's on today. And I knew that he would destroy me. And sure enough, you come in and hello, hello, everybody. And then I see those two eyes dart over and they see my freckled legs there. And it began and it began and it was well, it was quite a sight. It was absolutely a terrifying sight. And you couldn't because normally you can't see where the stilts are attached, but you could. You could that day. The shorts revealed way too much. Oh, and they were short shorts. Yeah. Oh, 1970s. Yeah, Joey Heatherton. Like you were entertaining the troops. But the writers were so, so happy. And then, of course, you're the line that just you said it on late night and it it's lived forever, which is well, you'll do it better than I. But it was Conan. Whatever you're doing to your face, I say 20 percent more and then stop, which is mean in nine different love letter. It's a combo of energy. I love it's also done with care. Yes. You're worried about me. Yeah. A little more, about 20 percent more. Now I feel like I have to put you down and I've got nothing. No, you don't. You don't because you're Steve. Oh, help. Lime. Well, I don't want to embarrass either of you, so I won't mention that you are just two of my absolute comedy heroes. I'm sure you hear that kind of thing all the time and it bores you. But one of the pleasures of my life, and I'm not kidding, was when you asked me to do a cameo in your show, your live show, Seizures Palace in Las Vegas. I was outside my body getting to be on a stage with you guys. It made me so happy, so legitimately, sincerely happy. You killed. I remember he did kill. I mean, we learned a lesson. You showed up with writers. One writer. I can't afford to. I showed up with my. Well, you're a writer. Yeah, oh, that's true. Yeah, that's true. Well, I suppose I am. No, I and Matt, he's Matt O'Brien, no relation, but I only hire O'Brien's and he idolizes you both as well. And he was just in heaven. And then there was but I thought, yeah, come along with me and help me tweak a few things. I really wanted it to be better than what I could. It was. It was inspiring. And we've had people show up with with nothing. No writers. And they did way better, by the way. And then I heard you guys later bumped into Letterman and he was like, Conan brought a writer. No, no, because Dave did it as well. Yeah. Yeah. In Texas, the line you're sitting off stage with Dave and he looked what was it? You were sitting off stage waiting for him to come on. They look kind of morose. This sounds like Dave so far. I can't remember. Yeah, that was I remember he was well, he was he had they edit, by the way. He had no, no, no, no, no. He had. Oh, not at all. No. An editor costs money as well. Everything is in. No, but it was fantastic. It was. But I remember you were saying that Dave was sort of he had been off the air for just a little bit. And then, of course, he always does the thing where he's horrified that he if I go on stage, it'll just be awful. Yeah. And I'm like, you're David Letterman. What do you you know? But he's done it. And of course, the place goes nuts. Yes. And then and then afterwards, he still has a negative feeling about it. Even though he killed. Yeah. But he had only been off a few. I think this was like in June and he'd left six weeks before. Right. Exactly. Exactly. But he is his personality is always you know, he came by and which meant a lot to me, did a cameo on late night, which was his old studio. And he came by. And of course, his attitude was, well, they're just going to hate me. Well, there's how will they know who I am? That's right. Will you say my name before I come out? There's a self-defense mechanism and being overly paranoid. And then when you get a little cheer, when you come out and you go, oh, I was wrong. Yes. Yes. I'm familiar with that. Except with Marty. Yeah, I think with me. Yes, I think and I think it's kept me out of the big money. Not having that attitude of just kind of going, oh, you don't like me? Well, you know what? I don't like you either. But good night. Yeah. It is a little. He does have that attitude. I'm this insecure, shaking one. And he says, I don't give a fuck. Right. They're going to love me. Well, if they don't, guess what? If I had dinner with them, I'd be bored. That's how I. Oh, yeah. Well, often that was your opening line, though. It was. And I didn't know why it didn't play. Who are you people? No one's bathed, obviously. Good night. Where's my big money? Why didn't I get the big money? Why don't they like me? They didn't never hire me again. I got to see your show, and I was so impressed with how you guys worked it out. And even though you both knew the show so well, you had a rehearsal, and you were still working so hard to make sure that it went perfectly at rehearsal. And I thought, this is there are no accidents. Like, people that are good, in my opinion, they're yes, there is talented. There is talent, but then there's just this just mad desire to get it perfectly right. And it never goes away. Well, I always think that that. By the way, I'm here, too. Go ahead. Oh, did you just sneak into this chair? I did. But I'm always amazed that. I feel like I should I start raising my hand? Okay, well, go ahead. You say something. No, I don't have to. I had something. I say I think we prepare. I prepare out of fear. Yep. And also love, because when we get a new joke, I'm energized the whole show. I cannot wait to get to this joke. And often they don't work. In fact, here's an example, because I thought I would just say when they don't work, I am like either on stage or in the wings. I go hysterical because he's been so excited all day about this. Go ahead. I had a joke the other night. I thought when I introduced Marty, I thought this is really going to work. Right. And then we're going to analyze why it didn't work afterwards. Yes. But I said, and this man, he's he's done live television. He's been in film and he's done Broadway. And truly he is a master of the toxic workplace environment. And it was just so like, uh huh. Uh huh. And I realized later it's had too many words in it. Yeah. You know, it needed to be more of like a casual throwaway in the middle of our campus. It's also inside toxic. You had to have just read the story about that talk show lady. Oh, you mean be alive? No, no, no. I don't think everyone is following, you know, variety. Everybody knows about a toxic workplace environment. Obviously not. Because you got nothing on the joke. Remember that part? I mean, Conan shorts represent a toxic workplace environment. Absolutely for the crew. Oh, we settled out of court. No, it's just, uh, well, I've I've gone mad trying to just figure out why did one thing work and why did another thing not work? Sometimes something works and you don't know why it's because I don't know in a, on the face of it, whether that's, is that really a funny joke? One time I was doing Letterman and they started to laugh and I didn't know why. You mean the show, right? And they started to laugh and I said to Dave, what are they laughing at? And he said, nothing we're doing. But I think that we all over prepare so that if it doesn't go well, we don't blame ourselves. That's you. That's you. Yeah. I think that's you. But I over prepare out of fear because I shouldn't have any fear at this point. I relate to that. I'm afraid. I'm afraid of the feeling of it not going well is so terrible. I don't want to have that feeling. And yet today you don't seem particularly prepared. Oh, not at all. No, no, no. It was you guys. I thought what are you going to do? You know, this is going to be a mess. No, I've said this many times. One time Steve phoned me up 10 years ago and said, Do you have a moment? I want to run some jokes past you. And I said, what's this for? You said, I have Letterman in a month. And that's why he's martyred. I was just thinking about jokes you stick with and they kind of work, but you like them and then you let them have their life and then you take them out. I was just thinking of one which I discovered because I was looking back through old material. And the joke was in the opening of the show, we used it. I used it in my banjo show, which was, you know, we tried to do a good show for everyone, no matter whether you're seated down here in the VIP Golden Circle or up there, you know, refer to the balcony in the corroded zinc fire pits. It's a little too early for a joke that lengthy, but I just like corroded zinc fire pits. Maybe zinc doesn't corrode and the audience figured that out. You know what happened is the night that the chemist was in town and they were like, you know, actually, No, they just went, what's he talking about? Yeah, I was speaking about preparing. I didn't get a chance to tell you this, Steve, because I guess you have caller ID. But Marty took the call. Yeah, I did. And when you guys co-hosted SNL, I watched that monologue. You mean recently? Yeah. Oh, that's the only time we've co-hosted. Yeah, of all the times. Of all the times. Or was it 40 years ago? It was last season and you guys did this monologue and it was over. And I've worked there. I've seen thousands of SNL monologues over the years. I cut my teeth on that show as a young kid watching TV. And I said, that is the best Saturday Night Live monologue I've ever seen. It was perfect. So you didn't like my other monologues I did? No, those were terrible. Well, whenever you would come out to do a monologue on SNL, you know, everyone knew that was the time to go get a drink. Well, here's what. Use the bathroom. No, yours? But it was perfect. It was absolute perfection. Okay. May I raise my hand? Yes. So that monologue, you know, we worked on it with the writers. We got some things. But we decided we're going to do a bit from our show. So that we'll know we can trust it. Yeah. So afterwards it went well and the ratings were sky high. It was the highest rated show of the year, as far as I know. And I said to Marty, Marty, you know, the monologue went great and the ratings were high. So there's a chance we'll be asked back to host at some other time. And I said, and before you say yes, just remember we worked on that monologue for three years. You guys had this, I know it's part of your show, but God, it's a good idea. The I care about Steve and I care about Marty and it's so much so that I've prepared the eulogy already, you know, that I'm going to give for you. And you each have them on you and you damn it. It's funny. It's one of the funniest things. It's such a great and the minute I hear that, the minute I heard the idea, I was saying, oh, oh, this is a kill zone. Well, the funniest line to me is Steve's opening line when it goes down the stage. No, no, no. That's time for me to talk. Remember, narcissism is just within your system. No, but I wanted to explain. I have a pre story to that and then you can say that. Well, first of all, I was going to do your line. So you might as well keep talking. No, no, you do the line. I'm saying that I had this idea that we would do this eulogy, but I couldn't get, I said, I just don't know how it starts. I don't know. There'll be some jokes or something. And then actually a writer sent in and this line. So it'd be me. So you be me speaking. So the lights come down and it says, remembering Marty and Steve's opening line is, gee, not much of a turnout. But it enabled the whole piece because we could get into it with the first laugh. Right. Right. Right. I love it. Occasionally you get someone who thinks, why are they being mean to each other? And that always drives me crazy. The funniest thing to me is when we're doing our thing and he'll say something, I'll say something and you'll hear somebody in the audience go, whoa. I remember one time being on Conan show and I insulted him a great deal. And then I went to the next I was on. I went to YouTube to see what jokes I'd done. And I read the comments below and people would say, you know, he shouldn't talk Conan that way. If Conan wanted to, he could take him apart. We did a piece. That's a fun person to have dinner with. I know. Why are you making jokes? We had a when I was first doing the late night show, we did a piece where, you know, the most beloved one of the most beloved people at the time was Mary Lou Ratten, the gymnast. And she's, you know, small and cute. And she won all these gold medals and everyone loves her. And we did a pre tape bit where I think Andy says, I'm saying, I think I'm getting the hang of this late night, the hosting thing and goes, Andy goes, you know, you could. Yeah. But the other night I thought you, you were a little off. And I said, I don't know what you're talking about. He cut to a pre tape of me just losing it on Mary Lou Ratten. And I'm screaming at her fully committed. And we showed that audience laughs. I think the next day or the day after that, I go on Stern, Howard Stern. He takes calls and someone calls in. I saw the other night and you your behavior towards Mary Lou Ratten was atrocious. I don't think you're funny. That was awful. The way you spoke to us. I can't believe you didn't recognize my voice. Reminds me of a reminds me of a story. I don't know if these are like older elderly joke stories, but Mike Nichols, you know, was married to is was married to Diane Sawyer. And he was, you know, he's a hilariously funny guy. And he would, he would say things like that, invite him to a party and said, well, I'll have to run by the ball and chain. So he would call Diana's ball and chain as a joke. So then I think it was a Vogue. They said, evidently, Mike Nichols refers to his wife as the ball and chain. You know, it's a negative thing. So he wrote them a letter, which I think they published, but said, I realize that humor to your editors is like a cross to a vampire. Mike once said, Mike once said to me when we were at this party, he said, where are you staying? I said, New York. I said, the Essex House. He said, no, but really. I feel like I was lucky in the people that I got to meet. But then I look at you two and I think you got to meet so many more people. You know, you're younger. Yeah, you're going to meet everybody. I mean, I, I remember sitting when I was 21 years old and I was hired to write for the Smothers Brothers and I was very naive. And now we're all at dinner and Tom and Dick are having telling stories about people. And I'm sitting there going, I have no stories. I can't believe I don't have a story. Right. And I was 21. So you've got to be this age, 180 to have a story. You met General Grant. Oh, my God. What a fun guy he was. But I do think there was that whole. You said Mary Lincoln could be pushy. I mean, I'm not going to tell you. But now even, you know, just just in the there's that clip that I've seen a million times. I think it's you on the Tonight Show with Johnny Carson, Marty. And I think it's Betty Davis sitting next to you. Yes, she was. She had already killed with her three episodes, three segments. Yeah, three. She done the plate bit. Yeah, everything. Yeah, she did. You're making that up. Oh, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no. But you mean it. She did kill. She was she was great. Yeah, she was great. Yeah. But I just think, oh, Johnny Carson is the host of the Tonight Show and sitting next to you is Betty Davis. That's an era of of show business. And I'd never met Johnny Carson. So it was particularly because I loved Johnny Carson. Yeah. As we all did. Yeah. So much so that I didn't even do his show for 10 years or eight years or something when I could have because I thought, oh, I'm too hip. I just do Letterman. But the reality I was scared to. Yeah. Well, and people don't even understand the era then because it's all changed so much. But both of you have this experience where you go on you'd go on Johnny Carson's Tonight Show and you do your your set. And the next day, everybody had seen it. Yeah, right. And, you know, you could walk through a hotel lobby and Steve would just drive from town from hotel to hotel just to walk through the lobby. Wearing a shirt that said, did you see me on Carson? And but people people I have so many stories that I've heard from comedians where they were not famous. They did well on Carson. And the next day, everybody in the United States is saying great job. Whereas today it's just a completely different lens. My observation of that is a little different, but it's too long and boring. But I'll tell you one. No, I'd love to hear that. OK, well, I've that's what I believed. You went on Carson and you then the next day you were famous. Right. But I found with myself you went on Carson next day. Nothing. Then you go on Carson again. And the next day somebody looks at you like, did I meet you at a party a long time? And then finally it slowly starts to break through. And finally, on my fifth appearance, I finally got it together. I did a good, good shot. And I went into a store on La Cienega Boulevard and that woman said, were you that boy that was on the Tonight Show last night? And I said, yes, I am. And she said, oh, well, there's always that. There's always that. Yeah. And I remember seeing a clip, Marty, I could tell you're just slightly different. You killed. But you were just I could tell that you're you're not the Marty that's going on my show and you're just going to kick the shit out of me. It's going to be so much fun. You are. You did a very funny thing about spit take. But it was I could tell, like his voice is a little different and you're being you're you're being well behaved. You know what I mean? With Carson. With Carson. Yeah. Yeah. I never got you. I don't know. No, I mean, there was a there is a difference between being excited to be on Johnny Carson and then to be slumming it. You know, well, there's certain people I've never overcome my awe. And Johnny Carson was one of them that I always felt a little, you know, I hope I'm pleasing him. Yeah. You know, but they knew they had card games. Yeah. We played cards together. We had dinners. That's a famous card game. People talk about that card game. It was really fun. Yeah. The lesson of that card game is everything changes. I mean, you're having you mean well, you're having poker games with Neil Simon and Carl Reiner and Dan Milnick and, you know, Chevy. And then people die. You know, everything changes. I'm trying to bring up the party here. No, no, but it's and we're all going to die, too. Yeah. Yeah. Never. All right. Well, anyway, great. So shall we we're going to roll. We're going to roll long credits. Let's. Hey, what if we just prayed right now? We just do a group prayer. Yeah, I think that'd be very nice. And hold hands. Yeah. Well, I often think about that. It's it's it's almost my the fact that I get to know you guys and talk to you guys at all is is feels like I'm linking to this very important. I don't know. What I would say is I think everybody has kind of a disdain for their own era of show business and and and reviers. Well, what we observe and I probably applies to you that younger comedians like, you know, SNL guys that we kind of know or you know them better than I because you're a warm person. But we see that camaraderie among them. Yeah. That we assume the you know, like Don Rickles had, you know, with Frank and. Yeah. But I see that we have camaraderie with people of our generation and I see that we see the younger people helping each other. You know, it's a oh, absolutely. No, I mean, people like Fred Armisen and John Mulaney and Bill Hader are all close, close friends. And you know them. I was they they also have caller ID. I was talking to Fred Armisen once. I mean, it's probably 10 years ago. And he's just hanging around SNL. And he said the latest thing that we this is probably old now. But the latest thing is when you text someone and then the misspellings come up and the different words, you just don't change them. And you just send it off like that. But you do that to other comedians. Fred is an interesting guy because I remember we had we were at dinner once and might have been at my house and Fred was there and didn't say he's hilariously funny guy. But that night he didn't say anything. He didn't say a word. And I remember him looking up and down the table and everybody's laughing and joking and he was just observing it all. And he has that almost like, you know, I always heard Peter Sellers at a party was not a was very quiet and kind of just observing and not I think we were all there. We were. Yes, you were there. It was a funny guy's dinner. It was a funny guy's dinner. Steve, I was. Yep. Sure. You said funny guys. You were a last minute addition. I was the control group. Polly Shore fell out. I've been so happy for both of you because you've got this crazy smash hit only murders in the building. And I was initially very, very happy for both of you. And I love the show. And then I saw so much signage everywhere I drove in L.A. And then I would even leave L.A. and I would go anywhere and I would see both of your faces. And I would think, you know, that's it. I've no more. No more. I can't keep seeing their. This is too much. This is too much success. I once did an intro for Tom Hanks. He was getting a FI award. And the bit was something like this. I'd say, you know, when I first saw Tom in Splash or on the TV show, it was a bosom. Yeah, I said, hey, this guy's good. You know, I wish him luck. You know, and then I and then I saw him in Splash. I go, wow, he's got some real comedy chops. Good for him. That's great. And then I saw him in Philadelphia and I said, Jesus, really emotional actor. He's really, really good. And then I saw him in what's the word movie? Saving Private Ryan. Saving Private Ryan. And I thought, motherfucker. Can you say that in an FI? I guess you can. I did. Nice. Very nice. It's just yeah, I was thrilled. Thrilled for both of you. And it's we can see it on your face. Yeah, yeah. If you ignore the tears. That actually have blood in them. And you both get to be so funny. We are so lucky to have a hit at this stage of Marty's life. No, we are. It's fantastic. And the show's fun to do. The show's fun to do. We love Selena. We love everybody work with. You know, you finally get to the point where a lot of people learn earlier. I'm not working with assholes anymore. It's over. It's over. So everybody there is kind and having fun and upbeat and working for the same goal. And then you guys announced the cast for the third season and I became enraged. I know. Because I was like, you have a royal flush, but you're adding some more aces to it. Meryl Streep. Yeah. I'll tell you a story about Meryl Streep. Yeah, really terror a new one. Yeah. We were sitting around and we're going to start rehearsing a scene. And our, you know, our head writer is there, John Hoffman. And Meryl says, you know, I just want to say how happy I am that we're all here together and working so hard together. And John said, yeah, I agree. And you said, John, that's her first line. And it happened more than once. There was a scene on stage where she's supposed to be an actress. She's going on stage and she'd trip. And then the second take she tripped again. And you realized we thought she actually tripped. And we said, shouldn't someone move that wire? And she said, guys, I'm. And she also, she was supposed to do a song with an orchestra and she should start to sing. And she goes, I'm sorry, I can't hear the rhythm. And they said, well, can we? No, that was her. That was her line. And it's just every time we go, when are they going to fix that rhythm thing? I can't hear it. I did a thing. It was for Norm McDonald here in New York. And they had some gathering and I was, I guess, the emcee, for lack of a better word, but I gave the first talk. But I went up on stage and went head over heels fall. People thought it was a praffal, but it was real. And I was, you know, made a joke of it and everybody thought, well, and then moved on and then did my thing. And then I think the second person, yeah, the second person who went up with the third person, they tripped. And I went to, you know, and I said to a stagehand, what's going on? Everyone keeps tripping. Oh, yeah, those stairs have been messed up for a long time. They're not. And he was like, they're not even. Yeah. So everybody trips anyway. No, they still haven't fixed those fucking stairs. Where is that? It was. I don't remember where it was. Oh, thanks. Thanks. That's no help at all. So we can be tripping anywhere. Now we're going to go trip somewhere. And we also have Paul Rudd on our show. I was going to say. He was fantastic. Yeah, and I love that you have this show that everybody agrees is fantastic. Andrea Martin. And you add Paul Rudd. You know, you don't need Paul Rudd at this point. It's making it, it's too much. Yes, and Andrea Martin and Tina Fey. Yes. And Jesse Williams. You know who wasn't asked? Who? Oh, I know who wasn't asked. I know who wasn't asked because Conan has beady little eyes. Wait a second. In the first season. Conan did. Oh, that's Jimmy Fallon. I mean, your name, your name came up. Oh, it came up. Yeah. Oh, good. You said you can't light the eyes. No, I just can't light the eyes. He's got those Charles Grodin eyes. You can't light them. They're like a doll's eyes. Yeah. Listen, you're going to figure out a way to work me into this. Sure. I think. Hey, with the premises, we're doing a podcast. I don't know what you'll be playing. I know the title of the episode. Oh, yes. Here we go. The circus has come to town. My favorite thing is getting excited about the nice thing. I'm sure you're about to say. Oh, good. What is it, Marty? It's the guy who has no memory of how Martin Short has treated him over 25 years. The absent minded podcast. I love that. Yeah. Oh, Marty's got something to say about me. Yeah. God, gee, let's have it, Marty. Or also you can recognize it later that it was an insult. Marty said the nicest thing about me. He says I was a total idiot. Oh. That's right. You're about a podcast. I have the podcast. Please, that's not me talking. That's podcast magazine. Guest edited by Conan O'Brien. Yeah, right. But yeah, I'm sure there's a way to fix me in, to get me into the mix. Absolutely. Yes. You'd be honored. Incredible. You reminded me of a joke. I don't know why. We're doing a show next weekend, so these jokes are going through my mind. It was Marty would talk about me playing the banjo, which he always insults, of course. And the joke was, and maybe you use it, he said, and Bluegrass Magazine has recently named Steve the official ambassador of the five string banjo. It was between him and no one. Well, you have that great joke. It has deliverance. What is that? Oh, yeah. I hope I didn't just ruin it. It's such a great joke. What is it? Touring around with Steve is a lot like the movie Deliverance. It's all fun and games until the banjos come out. Yeah, you kindly had me to your apartment once. I remember the first time I ever met you. You do? No. Actually, I do. No, I do. All the life went after you. You said, no, that was really fun. I saw you rise up and then fall down. No, you came to our apartment and met you? No, no. We had worked together on SNL. I was very shy. And I remembered I don't want to get in Steve's. So I was writing things, but not approaching you. I was in the background. But then I was chosen for, you know, Lauren said, I think this fellow could host the late night show. It'll be rough for a few years, but he'll eventually get it. I think he could do it. So I'm named Letterman's replacement. And the first thing I do when I come out to LA is Lauren says, maybe this is a thing he does. But he said, let's take a walk through the flats Beverly Hills. And people told me later on that Lauren likes to take a walk. And he's taking this walk and he's giving me advice. He's saying, always tip. You're known now. Always tip at least 15 percent or you'll show up in the post. I thought he was going to tell me like, here's the secret. But he was telling me things like that, which was fine. And then he said, let's see if Steve's in. And I didn't know, you know, Steve, he always assumed Steve Croft. And so I was Rossi. Yeah, exactly. So we he knocks on a door and you answer and you have us into your place. And I was like, this is too much. I've I've just been put into this situation and I need to navigate this. And now we're dropping in on Steve Martin. And I'll never forget you had just had all the paintings taken down. And I think I just said, like, oh, there are no paintings. And you reacted immediately as if you had been robbed. What? Oh, my God. I thought, oh, shit, that's funny. That's a perfect reaction to where your paintings. Yeah. Whenever whenever in studio, I remember once every day when then you'd be in the studio at six day rehearsing and the lights would go out because of some situation in the building, Rockefeller Center, some situation, the lights would just go out. And Andy would always instantly scream, my pearls. Well, Andy, who? Andy Richter. Hilarious. Yeah, it was just my pearls. And oh, I got to remember that. But I have to give him credit. Yeah, no, you don't. No, you don't. No, just take it. And he was fine. I know. I'll blow it. My pearl. My pearls. My. Previews. Previews. I mean, pearls. My pes. My pes. How did you guys decide we're going to start working together as a as two hander, a two hander act? When? Where did that come about? And I know it's I'll tell you what, it's a boring story, so I'm going to give it to you. No, no, no. It was 2011. We were asked to interview each other for it was the closing of the Just For Last Comedy Festival in Chicago. It was May and it was 2011. And we just in what we have for breakfast. You had scrambled eggs. I had fresh toast. Come on, man. I had zero. And we interviewed each other and that was it. And it went well and we thought we'd do it again. And we just then. Well, the funny part is we were interviewing each other about comedy for a comedy festival. So we could talk about comedy, kind of like we're doing here. But, you know, to comedy people, it's kind of interesting. So we thought, hey, let's do that again. So we got a corporate gig or something. And so we're sitting and we're talking about comedy and we're thinking this doesn't work. And then we started and Marty had a show he did solo and I had a show that I did with a band. And so we kind of combined them. But he had material and I had a bunch of songs with funny intros. And when we first when we first started working together, he had everything and I kind of had nothing because I didn't bring the band. I said, well, I got to bring the band. So that's when it started to gel into a show. And I can go on. Did you ever? First of all, that was great. Yeah. Anyway, well, I was saying I was saying that, no, I think you said it. You know, this is what I didn't think I got to the part. Oh, you didn't need to. This reminds me of I made the mistake once of it's and you know it. It's like wearing the shorts. But I knew I I I made this terrible mistake of someone had mentioned food and what they eat. And I said, well, you know what I do now is I eat two meals a day. I have like a shake at eleven and I put a lot of spinach in it and then I try to eat dinner early like at five. And then I as I'm finishing saying it, I see Marty just staring at me the way the way a shark looks like. It looks at a canned ham that fell into the ocean. And he looks at me and he said, you know, when other people discuss the details of their diet, it's boring. You know, I'm not you. And of course, there were some writers standing around who were like, yes, they love when the bosses attack. That was also just me realizing, I why did I get into this? Why did I lather myself up with bacon grease and then climb into this piranha piranha pool? Why did I why did I do that? She's very wise about about talking about what you eat. She said you're allowed to talk about what you do eat, but you're not allowed to talk about what you eat. It's very good. I like that. Yeah, I like that. I mean, if this podcast, if we go away with one thing, that's it. It's like with me beats. I don't. Why? One thing I was curious about is when you come up with a great new insult for the other, do you ever try it out in the moment on stage or do you ever? We have. Do you try to surprise each other? Not really. But sometimes we've come up with things. And then we'll go right to the prompter afterwards and say, oh, right. You know, we'll remember what what prompter that if we had a prompter, we had to say if we had a prompter. So you're saying if we had a prompter and we came up with a joke, we would go over and talk. I mean, now we just go to our own minds and lock it in. We were talking earlier about people you've met. And I know, Steve, that you got to meet or kind of meet Elvis. I did. And I told the story a million times. So I don't know if it's worthwhile. Well, I just love it. I was it was 1971 and I was opening for Anne Margaret at the Hilton in Las Vegas, which is no longer there for good reason. It's like they tore it down the following day. The worst comedy room. Yeah. There's a ceiling that's like 80 feet high. Yeah. So laughs. The laughter rose above the audience's head about two feet and stopped and stopped. But anyway, and Elvis was opening the next weekend and he knew Anne Margaret. So now it's after the show. I know Elvis is going to come back and say hello to Anne Margaret. And so I leave my dressing room door open and I did my act in 1971. So the act is not fully formed. You know, it's got a weirdness to it. And so Elvis walked by and he saw me and he stopped and he said, son, you have an oblique sense of humor. And then he came in and now we're talking. I'm talking with him and I know you don't know what to say. And my manager was there who know all about Sun Records. We can talk about that. And then there was a pause in the conversation. Oh, first of all, but this is the part I loved. Elvis has a guy who comes up to him to get him out of conversation. Elvis, I'm sorry, we have to go. And in this case, he comes up as sorry, we have to go. Elvis said, it's OK. I've been blessed. So then we're talking. Then we run out of conversation. Then he said, I want to see my guns. Jesus. And we said, sure. And he was a he was a he was a gun. He liked artful guns like an engraved. Sure. And he was very cautious. They were loaded. And so he took out a six shooter and he opened up and dumped all the bullets in his hand. And before he handed me the gun to look at it and I was looking at I'm marveling at it. Then he took out another gun, did the same thing, dumped out the bullets, handed it to me. And then they pulled out from his sock. Yeah. A derringer. And then open that up, dumped out the bullets, handed it to me. And then I'm I'm holding three guns and he's holding 16 bullets. And I'm thinking, where is Elvis's guy? Yeah. To get me out of this. Do you remember what he was wearing? Yes. All white. It was Elvis Slim. And he had the all white and he wore that big buckle that the Hilton had given him to him for biggest show ever in the history of the world. Right. But he was very sweet and very nice. Yeah. And that comes across when you look at the documents. That's a famous face though. Elvis Presley. Yeah. Jesus. Well, also the reason I wanted to because I know that you met Frank Sinatra. Yes. And who's your absolute idol. But it was one of those situations where you because I remember you told me this once you were at a bar and it. No, I was at George Slaughter's house. Oh, George Slaughter's house. OK. It was after a Sinatra Shirley MacLaine concert at the Greek theater. And we all went back to his house and Diana Shore was there. She was a big fan of SCTV. Oh, great. She's going on about it. And I'm thrilled to meet Diana Shore. She said, Hey, do you want me, Frank? I said, Sure, sure. And I went up to him. Now, this next part Paul Schaefer maintains I've made up because he said he didn't he didn't speak like out of guys and dolls. And I said, Well, he did, though. He said, I said, Mr. Sinatra, Martin Schoen, he said, I know well of you and your models. I know well of you. I can't believe that. Yeah, I know. Well, that's not guys. Yeah. Anyway, then then he said, Would you like a drink? And I said, Sure. He said, What are you drinking? I said, Anything you're drinking, Frank. And so he turned to the bar and said, Jack Daniels. And I don't don't don't drink scotch. So the bartender said straight up or on the rocks. And I was nervous. I thought he said straight up or relaxed. And I said, I'll have it relaxed. And he Frank said, He said straight up or on the rocks. I'd known Frank 15 seconds and I pissed him off. It starts to. Yeah. Julie beat the crap out of this guy. Are you a moron? So I. Good Frank. Now, it was when you meet those people, it is surreal. But, you know, I used to have that with Mike Nichols and I knew him for 20 years that I was still in awe. Like you talk about Carson, you're in awe of being in their presence. I had I mean, this is someone he both have met a billion times. But Lauren once asked me to go to a he said, Would you like to go to a Yankee game with me? And I said, Yeah, I'd love to do that. And there was a playoff game on the Red Sox. And so we're I get in the car and he says, We're picking up. I think he said we're picking up a friend. I didn't hear who he said we were picking up. But he puts, you know, so I sat up front. So there was room in the back for Lauren and his friend. I set up with the driver and we start driving up and then we start to slow down and there's someone leaning against the lamppost in like a very cinematic way. And we slow down and it's Jack Nicholson. Wow. And Jack gets in the back seat and he goes in. Lauren goes in. He's like, How you doing, Lauren? He says, This is our corner. And he says, It's very nice. Just said, Nice to see you. And I said, Oh, so nice to see you, sir. You know, and then we drive, we see the game. And my experience was if you want to be anonymous, walk with Jack Nicholson, because I am my life is I'm six, four. I have this pastry on my head. I am immediately like me or dislike me. Everybody knows it's me. And I walked down the street and everybody knows it's me. And suddenly nobody saw me because I'm walking three feet behind Jack Nicholson. But then the real treat of the night. So we chatted a little bit about a few things and didn't talk much. He mostly spoke with Lauren and then he drops me off at the end of the night. And I think, well, this has been great. And I get out of the car first because I'm just going to walk. We dropped Jack Nicholson off and he gets out of the car. And I just said, It was a real honor to meet you, you know, Jack. And he said, My boy is crazy about you. And I said, He said, I'll never forget. He said, My boy, we're standing there and Lauren still in the car and he goes, My boy is crazy about you. Every morning it's Conan this and Conan that. It's driving me fucking crazy. I had no idea that even I had, but I just knew that I was an irritant in his life. And that made me very happy, very happy indeed. I'm just going back of it because I keep remembering this great joke. I think it was a Shackie Green's joke about Frank. And it might have been Don Rickles, but I think it was Shackie Green. He said, he said, and Frank's in the audience. He said, Frank saved my life one night. You know this joke? He says, Frank saved my life one night. I was in an alley and I was getting beat up by some guys. And Frank said, That's enough. And then there's the famous Rickles joke, which I'm, it's story, which I'm sure is true, which is Rickles asking Frank. He's like, I'm meeting, I'm dating this young girl. Could you, this young woman, it would really mean so much if you just came through the lobby and, and walked through the restaurant and said hello to me in front of her. That would really help me seal the deal. And so Frank Sinatra comes through and walks up to Rickles and his date and says, Hey Don, I just want to, Frank, please, I'm eating. And Frank leaves the restaurant and then about 30 seconds later, two guys come in and pick up Rickles, carry him out of the restaurant and dump him in the fountain. Is that last part true? It was a fountain. It was a fountain of acid. That's the part that's less funny. Frank had it constructed. So they killed Don Rickles. Yeah, they did. Yeah. He never lived past 1961. Guys, I'm going to let you go because you have, it's been made clear. Wouldn't you like to get some part of this interview that's usable? You're a young lad. You haven't, you've listened to some of my, I'm going to say this is my favorite episode maybe ever. This is one of my favorite. This is a spectacular episode. I'm just going back over why we're doing it. It's because of your admiration for me and my work. This is a very, very famous podcast. I understand that. I know that. And so we should be honored to be part of it. You couldn't say it with a straight face. Hey, I see after this, that's you and me go and cash our checks. Let's do it. We need a big bank. I mean, not every bank. I have ideas. Maybe we'll get some cash and some just to cash your check. Yeah. And I have a servant with me. He could carry the bullion. You know, you guys have always kept in touch. That's what I like about you. You never got in the bubble. You're out there. Oh, I'm of the people. Always. Kept in touch with whom? What do you mean? You're just in touch with the people. You know what I mean? You're going to the bank. You'll probably have to stop and get a wheelbarrow. But you do it in a humble way. Would you say that with success, you changed? I'm pausing. You can't help but change. But I'd say I have changed for the better with success. That's what I think. You probably disagree. I can't wait to phone others. When did you meet? Did you know Steve? I met him on Three Amigos, 85 July. And then we became great friends. And then you make that decision of whether you're going to just have that two month experience of making a movie and never see someone again or not. And I think we both chose to keep hanging. It's interesting you bring up Three Amigos because you make that movie. It came out and it did what it did. But then it goes on. And I don't know when it happened. But within maybe 10 years of it coming out, there's this whole generation that seizes that movie and says this is one of our favorite movies. And it has grown since then in a way that I think is well deserved. But it's kind of fascinating to me. Were you aware of that happening? That's what happens with a lot of my movies except for the 10 year part where they like it. Well, I've always found that you never know if a movie is a hit or success till 10 years goes by. Because some movies are big hits when they come out and then you never hear of them again. And then some movies tend to grow. I was surprised. In fact, we got a call from a magazine in London. And they said we want to. It was a film magazine. They said we want to put you, Marty and Chevy on the cover. And we said, why? They said, well, it's the 25th anniversary of Three Amigos. I said, you care? And that's when I started noting that there was some kind of thing happening. Yeah, it's got this whole other life. And I can't tell you how many times I've seen they'll ask various rock musicians, artists, athletes, just anyone, politicians list favorite movies. And then Three Amigos keeps popping up in there, which is really great. Well, Steve wrote it. Well, with Lorne Michaels and Randy Newman. That's right. But you said you wrote the funniest parts. I will. Actually, Randy Newman wrote my favorite joke in the whole thing. And it's when El Guapo, it's his birthday, and all his men are celebrating. And he opens a package and he goes, it's a sweater. I love the canteen joke so much that you're both, you know, the three of you are running out of water. Oh, canteen. The canteen. And just there's barely enough. And then just luxuriating. Chevy. I like spomb. Yeah, lip balm is so fantastic. My favorite joke is that we go into a saloon that's filled with bad guys. And we're all in our spangly outfits. And I go up to the bartender and say, excuse me, we're not Mexicans. We're from out of town. Was it fun to make? Yeah, it was. Yeah, it was. We were actually, you know, in Arizona and on locations and building these beautiful sets. It's just one of those, because sometimes I've known when you're having a blast making something, I sometimes get worried. If you're having a really good time making something, that this means it won't be good. One of my favorite lines, I just, somebody reminded me of it too at the end. The very end, I go up to Patrice Martinez, who's a beautiful actress who played Carmen. She passed away, unfortunately. And there's supposed to be like something between us. And I go up and we're about to ride off. And I say to her, I'll be back one day. And she says, why? Well, guys, what's the plan for the rest of the day? I'm sure you've blocked out a whole chunk of time with me. Well, it's, I've got to do my 5BX workout. Incredible. I was going to say you look amazing. Thank you. And today it's AB day. So I'm going to work on the abs. And that's most of the day. It's hard for me for you, when you say that, for me not to think of your role on Arrested Development, where you're the bullet. Shoot me. Shoot me. And my son adores that show. So the times that you've been around, as much as you've done, you never know what's going to get people. And he's seen and really liked your other work. But you as the bullet. Whatever. Isn't that your... I was a guy, I was so old, I was their uncle that my legs didn't work. And I had to be carried around by a big strong man. And we kept adding jokes. And at one point I said, to the nuts. And they put me down to Jason Bateman's testicles. And I went, bridge mix, bridge mix. They put me on a table to eat nuts. But it's just so nice that you do these different things. You never know what's going to catch with who. And then my son, who now is 17, but at the time he was seeing it, he was like 12. And he was like, well, this is the funniest thing I've ever seen. And I'm like, well, he's coming over tonight. And it's just, it's lovely. It's very nice. Gentlemen. Thank you, Conan. I want to let you go. Thank you very much. Think about the cameo. Of course. I will play a small part. I have a tendency to shoot the lens. I look into the lens. Wow, good. What would it be? It's funny because a Shrek-like monster crushes townspeople and then is arrested for murder. Something like that. Why? Why do I goad you? Why do I ask for more? I like Conan's approach because most actors try not to look into the lens. Yes. I would have a small role where I'm literally carrying crab cakes in the background at the nice west side apartment. And I stop and I turn and look right into the lens and freeze. And that's what we're going to do. Oh, Steve's taking a call. No, no. Oh, no, I'm looking at my plans for the rest of the day because you asked and then I realized I have none. Well, perfect. Okay. Thanks a lot. Thank you very much. Guys, you both mean the world to me. And this is like, I don't know, we will never top this episode. And I know that you are being self-effacing and saying we've killed time is an absolute joy. Thank you. I bow to both of you. I love you. I bow to you. And obviously we've both been influences, but which one a little bit more? Oh, me. Oh, is it? You can't see everybody. He's looking at me. Thanks, Conan. No. Anyway, Steve, your car's here. Guys, go in peace. Okay. Thanks a lot. Oh, by the way. Yes. You forced this on us. Yeah. Hi, my name is Steve Martin. I feel blank about being, let's hear you do it spontaneously, but replace Conan. You know what? You could do another version and they could put it. That was fantastic. I thought I did do a good job. Oh, no, I'm challenging him. You go, suddenly we have to learn lines. It's not learning a line. It could be, you know, the right. You don't write. You could, you could have a sincere emotion and say it in a moment. Oh, you know what? I've never thought of that. Yeah. I would say my name is Conan O'Brien and I feel overwhelmed, overwhelmed with gratitude that Steve Martin and Martin Short even know my name. And that's, you know, there I go. Okay. It doesn't have to be, you know, I didn't have a writer work on that. So you wanted us to compliment you. Yes. We didn't think of that. Okay. Thanks a lot. Conan O'Brien needs a friend. Conan O'Brien, Sonam O'Sessian and Matt Gourley. Produced by me, Matt Gourley. Executive produced by Adam Sachs, Nick Leal and Jeff Ross at Team Coco and Colin Anderson and Cody Fisher at Earwolf. Theme song by The White Stripes. Incidental music by Jimmy Vivino. Take it away, Jimmy. Our supervising producer is Aaron Blair and our associate talent producer is Jennifer Samples. Engineering by Eduardo Perez. Additional production support by Mars Melnick. Talent booking by Paula Davis, Gina Battista and Brit Kahn. You can rate and review this show on Apple Podcasts and you might find your review read on a future episode. Got a question for Conan? Call the Team Coco hotline at 323-451-2821 and leave a message. It too could be featured on a future episode. And if you haven't already, please subscribe to Conan O'Brien Needs a Friend on Apple Podcasts, Stitcher or wherever fine podcasts are downloaded. Thanks for watching!"}}, "transcribed_data": {"podcast_title": "Conan O’Brien Needs A Friend", "episode_title": "Steve Martin and Martin Short", "episode_image": "https://image.simplecastcdn.com/images/d139afc2-e8b0-4ec2-bc74-fdc3c88f649a/d59c963f-c9dc-41d8-9005-369e80634b3b/3000x3000/screen-shot-2023-05-01-at-12-14-01-pm.jpg?aid=rss_feed", "episode_transcript": " Hi, my name is Martin Short and I feel duped about being Conan O'Brien's friend. Hi, my name is Steve Martin and I feel sad about being Conan O'Brien's only friend. Hey there, welcome to Conan O'Brien Needs a Friend. And no, Sona was not just punching me before she fled back to her chair. You swatted her elbow first. Yeah, you did. You scooted over in your chair. No, I was trying to help her. She seemed unsteady and I would never swat at anyone. She seemed unsteady and I was helping her adjust herself in her seat. Oh, okay. I didn't realize. I think you were just angry. I was talking about how many cups you had. I didn't realize. There was a narc over here. Yeah, that's right. Get ready. This guy's working for jobs. Listen, there were some shenanigans just before the podcast started. Maybe I took a swing at Sona's shoulder, slightly missed it, and then she needed to retaliate. And then of course, teacher, teacher, I saw what happened from Mr. Matt Gourley over here. I did, and I tell the truth. I appreciate it, Matt. You're a truth teller. Even though no one asked you. You're my big geek baby. What the fuck was that? Sometimes I start speaking before I know where I'm headed. Wait a minute, sometimes. That is 97% of the time. Here are the three things that went through my head Robocop style. Like I had a readout of options. It was my big baby, my big daddy, and my big gay boy. I'm none of those things. You're none of those things. I'm not saying this is like good or right or healthy. I have a problem. I like that this seconds ago, I was taking a swing at Sona and she was returning fire by swatting at me. And then you end up the villain. Am I the villain or am I just the misunderstood genius? I appreciate it. I'm looking it up right now and no, villain and fool. Okay, big giggy. Man, you're just the worst. Well, it's faulty. The wiring's off, but someday it'll get there. I used to love when people would get really angry and try to yell at someone and swear but not be able to pull it off. And I knew people that would do that. I know someone in particular, I won't name them, but they'd be like... Shit, sir. Fuckler. And they just couldn't put it together. That's me. I'll damn you, shit man. What? Yeah. It's just so easy to curse though. Let's see it. Go ahead, genius. You fucking piece of shit, dick fuck. You're just a big sandpaper baby who's got little feet and don't even know who cheek people are. That's a good one. And the fact that you don't know who cheek people are is your worst quality. Yeah. Go buy some lips, you reach around. What? Okay. You know what? Now you're on fire. Okay. You started out, I mean, good Lord. You didn't have it earlier. Yeah, now it works. Yeah, now it's fantastic. Yeah. But Sona, you are very good. I've seen Sona get mad many times. That's amazing. And often, I have to say, not at me, just at random people. And you are terrific at swearing. I am great. I am really good at it. You are concise. Yes. They explode out of your face, these curses. Is this the way you grew up? No. My mom would be horrified that I'd be cursing. They're nice people. And I think that's why I got good at it. What do you mean? Because my mom didn't want me to curse. And so I was like, well, I'm going to show you, I'm going to curse the best out of anybody. Curse of blue streak. Yeah. Well, good for you. Thank you so much. You overcame your obstacles. My dad, no joke, cursed a lot. And I'm wondering why that's why I'm bad at cursing because I never got to exercise that muscle. My father, I have a specific memory, which is my father, you know, there wasn't much swearing in our house. Occasionally, you know. What? There wasn't. There wasn't much swearing in our house. Occasionally. You're Irish. Okay. That's nice. Wait, I'm being serious. That's terrific. You guys are good at cursing. What are you talking about? You keep youth Irish. No, the Irish curse means we have small penises. Not the Irish curse. That makes more sense. Yeah, please. That's the Irish curse. Okay. All right. I mean, I've been looking for mine for years. Oh, man. I mean, give me a map. Hell! What were you going to say? No, we're going to stick on this theme now. I've used ways to find it. Hell! Okay. No, we could go somewhere else. It's fine. Solid C+. Anyway... You dropped your penis. It's at the bottom of that tequila bottle. So anyway, no, I grew up in a very proper house. My mother really didn't want, you know, swearing, and there wasn't a lot of swearing. Really none at all. And then I'll never forget, I had my room was up in the attic. I lived up there with my brother Neil and my sister Kate. And we were, there were so many of us, they said, okay, some of you were going up to the attic and it was pretty clear who was headed up there. So I'm at the end of the attic. Now what I remember is... You're saying you didn't draw straws. Oh, no, no, we didn't draw straws. It was you three, you three up into the attic now. And we'll send a plate of food and you can figure out who gets it. There was plenty of space. A lot of empty bedrooms. Tons of rooms. Tons of rooms. Boarding house, basically. We had a car on a revolving display on the second floor. That's how much extra room we had. 1975 Buick Skylark. There was just so much extra room. But anyway, so I'm up there and I'm in my bedroom and it's dark out. And all I remember is my father was coming up and he was trying to, he was trying to find something and it was very late. And my sister Kate was not in her room at the time. I think they were doing some work in that room. And all I know is that there was a bunch of junk in there, including a big bed frame that was jutting out at a weird angle. And so I'm in my bed and I'm just about to fall asleep and my closet connected to my sister's closet. Like you could walk from one right through to the other. What? So there was, yeah, it was just a way for my sister to escape or for me to escape. It's the kind of house we lived in. Anyway, but I'm not lying. They did connect. It was just an opening and you could walk right into the other room. And so it's dark out and I'm just kind of falling asleep and my father comes up the stairs and he's looking for something in Kate's room. But it's dark. And all of a sudden I hear this unmistakable sound of his shin hitting the iron bed frame that's jutting out in the darkness. And I heard, Every single, every single swear you could ever imagine. Oh, you're censoring yourself, but he didn't. Well, I like it's funnier to me that it's just it's I remember it. It was so jarring and so traumatic. I remember it as That's how it's coming out. And I heard every swear that's ever been invented from this like, you know, very brilliant scientist. You learned it all in one fell swoop. Oh, in one. I mean, I had a recorder running and I've had them all. It's like, yep, he got every single one. And I remember just pulling the blanket over my head. Oh, my God. Did you did he have like colloquial swears? Because my dad, for some reason, had his own like jazz swear lingo where he would go, God damn it anyway. And God damn it all. Make sure you damn it every single way you can and all of it. And he would like, what does God damn it anyway mean? He would put it anyway after God damn it just completely takes the power away to God damn it anyway. It takes the power away. He put up the Christmas tree and it wouldn't work. And I love this man and I love him for this, but he'd be like, God damn it anyway. God damn it all. And these were just like, I don't know if they were like passed down through the family or what. But I now will stub a toe or something. And like I have to stop myself from going, God damn it anyway. I think that's why I go to like you're a cheek people or a tooth lover. I don't know. I just want to get away from I want to stop the cycle. We had a lot of ethnic curse words in our like a lot of Turkish ones and Armenian ones. Yeah. Well, one of my this is bad for people who actually know what I'm saying. They're bad. But like one was like, Baba Jananasiçim or, you know, Pezivekisholisheg. Things like that. Those are the things my dad said when he hit his shin. He was Turkish. My dad's Turkish. Oh my God. He said, Bada Habeshabeshi. One was I'll shit on your dad's soul. And my dad would say that to people. And sometimes like, you know, he'd do it as a throwaway. I'll shit on your dad's soul. That is fantastic. Oh, Turkey. You devils. What was the other one? One's like Pezivek is like a like a pimp or siktir is like fuck it or, you know, isholisheg is like a son of a donkey. You know, it's fine. I mean, whatever. But I'll shit on your dad's soul. Yeah, that should they should win the Olympics. Yeah, because that's graphic and poetic. Yeah. It's like figurative. It is also very gross. And I think of the show the soul as being ethereal like shit would drop through it. But no, this is proof that the soul has some viscosity. But what if the only way you could materialize a soul is to shit on it and you find like, you know, when you pour paint on the invisible man. Right. If you shit on the soul, you can trap a soul. Right. Yeah. Check your toilet bowl next time. Make sure there's nobody's soul in there. Oh, no, I just flushed Grandma. Oh, man. Well, she's going to a better place. Don't shit on Grandma's soul. She's going to a better place. The water solidization plant. Yeah. In our house, it was all Jesus, Mary and Joseph. I mean, it was all Catholic stuff. And so it didn't really it was just more of a prayer. More of a litany. Your grandma didn't swear? Oh, my God. No. My grandma, Mottie, who lived with us. I didn't I don't know why I didn't think Irish people are just they swear. No, you're thinking of pirates. No, no, my Irish grandmother was the most she was a very well educated school teacher and she lived with us and she would say, Oh, Moses. Oh, Moses. That was the and she would say it all the time. Like, what's wrong, Mottie? Nothing. Oh, Moses. Oh, God. That's like a haunted house like Flores para los Muertos. You just hear that in the night. Well, she loved bad news, too. She loved it. Oh, Mottie, something terrible happened. Oh, tell me, tell me. And she would love because the Irish love bad news. So once it was her birthday. And so I said, Hey, Mottie, happy birthday. And I jumped off the top steps of our stairway and pretended to get hurt because I thought that would make her happy. Happy birthday. And I jumped. And then I was like, Did you like that? You thought it was hurt for a second. Oh, Moses. Thank you. Thank you. Anyway, this was very educational, I think. So I will never shit on your soul. Oh, that's really nice. Wait, thinking. No, I won't. Oh, OK. OK, everybody, settle down. Settle down. Please. I want you to settle down. Sorry. I've got some exciting news. And when do I have exciting news? It's never happened. Conan O'Brien Needs a Friend is coming to you live at the Brooklyn Academy of Music for two shows, November 7th, November 8th, as part of the New York Comedy Festival. Presale tickets will be available starting this Wednesday, August 23rd at 11 a.m. That's Eastern Time with the code NYCF before the general on sale, which is Friday, August 25th at 11 a.m. ET. I'm very excited about this. I'm very excited about this. To get your tickets and all information that you need, head to nycomedyfestival.com and we will see you very soon in Brooklyn. Yes. All right. Can't waste any more time. Let's do this. Because this is very rare. My guests today, they are legends, without doubt comedic legends at the top. And they're also my personal heroes. And I'm so thrilled they're on the show today. They star in the hit Hulu series, Only Murders in the Building. I am beyond thrilled. There aren't words. Just so happy they're here. Steve Martin and Martin Short, welcome. Gentlemen, it's a rare honor to have you both here. Oh, thank you, Conan. In the same room. I'll tell you one thing. It's rare to be here. It is. I left out the word honor, but. It's just an oversight. Just before we started recording, Marty, you verbally assaulted me. No, no, no, no. I said it with love that to me when I see you, you look like someone freeze dried Prince Harry. That's all I said. My staff looks forward to any time that Marty. Pardon me? I have a staff. Wow. Jeez. What kind of podcast is this? It's very loop. It gets smaller every year. But no, fans of my show. And yes, there are fans of the work that I've done in the past. Let's not have any mock surprise about that. But they they have put together a mashup of of Marty coming on the show and ripping me apart. And it is wildly popular. Oh, really? Oh, yes, it is. It is wildly popular and it delights my writers to the point where the last time we were wrapping up the late night show, an epic 28 year run. Thank you. I'm driving to one of the last episodes that Marty's going to do and he did a extremely funny bit on it. And I'm driving to the theater. I looked down and I realized I'm doing something I rarely do, which is wear shorts. And immediately I thought I'm driving towards the Largo Theater and I thought, fuck, Marty, who's on today? Marty's on today. And I knew that he would destroy me. And sure enough, you come in and hello, hello, everybody. And then I see those two eyes dart over and they see my freckled legs there. And it began and it began and it was well, it was quite a sight. It was absolutely a terrifying sight. And you couldn't because normally you can't see where the stilts are attached, but you could. You could that day. The shorts revealed way too much. Oh, and they were short shorts. Yeah. Oh, 1970s. Yeah, Joey Heatherton. Like you were entertaining the troops. But the writers were so, so happy. And then, of course, you're the line that just you said it on late night and it it's lived forever, which is well, you'll do it better than I. But it was Conan. Whatever you're doing to your face, I say 20 percent more and then stop, which is mean in nine different love letter. It's a combo of energy. I love it's also done with care. Yes. You're worried about me. Yeah. A little more, about 20 percent more. Now I feel like I have to put you down and I've got nothing. No, you don't. You don't because you're Steve. Oh, help. Lime. Well, I don't want to embarrass either of you, so I won't mention that you are just two of my absolute comedy heroes. I'm sure you hear that kind of thing all the time and it bores you. But one of the pleasures of my life, and I'm not kidding, was when you asked me to do a cameo in your show, your live show, Seizures Palace in Las Vegas. I was outside my body getting to be on a stage with you guys. It made me so happy, so legitimately, sincerely happy. You killed. I remember he did kill. I mean, we learned a lesson. You showed up with writers. One writer. I can't afford to. I showed up with my. Well, you're a writer. Yeah, oh, that's true. Yeah, that's true. Well, I suppose I am. No, I and Matt, he's Matt O'Brien, no relation, but I only hire O'Brien's and he idolizes you both as well. And he was just in heaven. And then there was but I thought, yeah, come along with me and help me tweak a few things. I really wanted it to be better than what I could. It was. It was inspiring. And we've had people show up with with nothing. No writers. And they did way better, by the way. And then I heard you guys later bumped into Letterman and he was like, Conan brought a writer. No, no, because Dave did it as well. Yeah. Yeah. In Texas, the line you're sitting off stage with Dave and he looked what was it? You were sitting off stage waiting for him to come on. They look kind of morose. This sounds like Dave so far. I can't remember. Yeah, that was I remember he was well, he was he had they edit, by the way. He had no, no, no, no, no. He had. Oh, not at all. No. An editor costs money as well. Everything is in. No, but it was fantastic. It was. But I remember you were saying that Dave was sort of he had been off the air for just a little bit. And then, of course, he always does the thing where he's horrified that he if I go on stage, it'll just be awful. Yeah. And I'm like, you're David Letterman. What do you you know? But he's done it. And of course, the place goes nuts. Yes. And then and then afterwards, he still has a negative feeling about it. Even though he killed. Yeah. But he had only been off a few. I think this was like in June and he'd left six weeks before. Right. Exactly. Exactly. But he is his personality is always you know, he came by and which meant a lot to me, did a cameo on late night, which was his old studio. And he came by. And of course, his attitude was, well, they're just going to hate me. Well, there's how will they know who I am? That's right. Will you say my name before I come out? There's a self-defense mechanism and being overly paranoid. And then when you get a little cheer, when you come out and you go, oh, I was wrong. Yes. Yes. I'm familiar with that. Except with Marty. Yeah, I think with me. Yes, I think and I think it's kept me out of the big money. Not having that attitude of just kind of going, oh, you don't like me? Well, you know what? I don't like you either. But good night. Yeah. It is a little. He does have that attitude. I'm this insecure, shaking one. And he says, I don't give a fuck. Right. They're going to love me. Well, if they don't, guess what? If I had dinner with them, I'd be bored. That's how I. Oh, yeah. Well, often that was your opening line, though. It was. And I didn't know why it didn't play. Who are you people? No one's bathed, obviously. Good night. Where's my big money? Why didn't I get the big money? Why don't they like me? They didn't never hire me again. I got to see your show, and I was so impressed with how you guys worked it out. And even though you both knew the show so well, you had a rehearsal, and you were still working so hard to make sure that it went perfectly at rehearsal. And I thought, this is there are no accidents. Like, people that are good, in my opinion, they're yes, there is talented. There is talent, but then there's just this just mad desire to get it perfectly right. And it never goes away. Well, I always think that that. By the way, I'm here, too. Go ahead. Oh, did you just sneak into this chair? I did. But I'm always amazed that. I feel like I should I start raising my hand? Okay, well, go ahead. You say something. No, I don't have to. I had something. I say I think we prepare. I prepare out of fear. Yep. And also love, because when we get a new joke, I'm energized the whole show. I cannot wait to get to this joke. And often they don't work. In fact, here's an example, because I thought I would just say when they don't work, I am like either on stage or in the wings. I go hysterical because he's been so excited all day about this. Go ahead. I had a joke the other night. I thought when I introduced Marty, I thought this is really going to work. Right. And then we're going to analyze why it didn't work afterwards. Yes. But I said, and this man, he's he's done live television. He's been in film and he's done Broadway. And truly he is a master of the toxic workplace environment. And it was just so like, uh huh. Uh huh. And I realized later it's had too many words in it. Yeah. You know, it needed to be more of like a casual throwaway in the middle of our campus. It's also inside toxic. You had to have just read the story about that talk show lady. Oh, you mean be alive? No, no, no. I don't think everyone is following, you know, variety. Everybody knows about a toxic workplace environment. Obviously not. Because you got nothing on the joke. Remember that part? I mean, Conan shorts represent a toxic workplace environment. Absolutely for the crew. Oh, we settled out of court. No, it's just, uh, well, I've I've gone mad trying to just figure out why did one thing work and why did another thing not work? Sometimes something works and you don't know why it's because I don't know in a, on the face of it, whether that's, is that really a funny joke? One time I was doing Letterman and they started to laugh and I didn't know why. You mean the show, right? And they started to laugh and I said to Dave, what are they laughing at? And he said, nothing we're doing. But I think that we all over prepare so that if it doesn't go well, we don't blame ourselves. That's you. That's you. Yeah. I think that's you. But I over prepare out of fear because I shouldn't have any fear at this point. I relate to that. I'm afraid. I'm afraid of the feeling of it not going well is so terrible. I don't want to have that feeling. And yet today you don't seem particularly prepared. Oh, not at all. No, no, no. It was you guys. I thought what are you going to do? You know, this is going to be a mess. No, I've said this many times. One time Steve phoned me up 10 years ago and said, Do you have a moment? I want to run some jokes past you. And I said, what's this for? You said, I have Letterman in a month. And that's why he's martyred. I was just thinking about jokes you stick with and they kind of work, but you like them and then you let them have their life and then you take them out. I was just thinking of one which I discovered because I was looking back through old material. And the joke was in the opening of the show, we used it. I used it in my banjo show, which was, you know, we tried to do a good show for everyone, no matter whether you're seated down here in the VIP Golden Circle or up there, you know, refer to the balcony in the corroded zinc fire pits. It's a little too early for a joke that lengthy, but I just like corroded zinc fire pits. Maybe zinc doesn't corrode and the audience figured that out. You know what happened is the night that the chemist was in town and they were like, you know, actually, No, they just went, what's he talking about? Yeah, I was speaking about preparing. I didn't get a chance to tell you this, Steve, because I guess you have caller ID. But Marty took the call. Yeah, I did. And when you guys co-hosted SNL, I watched that monologue. You mean recently? Yeah. Oh, that's the only time we've co-hosted. Yeah, of all the times. Of all the times. Or was it 40 years ago? It was last season and you guys did this monologue and it was over. And I've worked there. I've seen thousands of SNL monologues over the years. I cut my teeth on that show as a young kid watching TV. And I said, that is the best Saturday Night Live monologue I've ever seen. It was perfect. So you didn't like my other monologues I did? No, those were terrible. Well, whenever you would come out to do a monologue on SNL, you know, everyone knew that was the time to go get a drink. Well, here's what. Use the bathroom. No, yours? But it was perfect. It was absolute perfection. Okay. May I raise my hand? Yes. So that monologue, you know, we worked on it with the writers. We got some things. But we decided we're going to do a bit from our show. So that we'll know we can trust it. Yeah. So afterwards it went well and the ratings were sky high. It was the highest rated show of the year, as far as I know. And I said to Marty, Marty, you know, the monologue went great and the ratings were high. So there's a chance we'll be asked back to host at some other time. And I said, and before you say yes, just remember we worked on that monologue for three years. You guys had this, I know it's part of your show, but God, it's a good idea. The I care about Steve and I care about Marty and it's so much so that I've prepared the eulogy already, you know, that I'm going to give for you. And you each have them on you and you damn it. It's funny. It's one of the funniest things. It's such a great and the minute I hear that, the minute I heard the idea, I was saying, oh, oh, this is a kill zone. Well, the funniest line to me is Steve's opening line when it goes down the stage. No, no, no. That's time for me to talk. Remember, narcissism is just within your system. No, but I wanted to explain. I have a pre story to that and then you can say that. Well, first of all, I was going to do your line. So you might as well keep talking. No, no, you do the line. I'm saying that I had this idea that we would do this eulogy, but I couldn't get, I said, I just don't know how it starts. I don't know. There'll be some jokes or something. And then actually a writer sent in and this line. So it'd be me. So you be me speaking. So the lights come down and it says, remembering Marty and Steve's opening line is, gee, not much of a turnout. But it enabled the whole piece because we could get into it with the first laugh. Right. Right. Right. I love it. Occasionally you get someone who thinks, why are they being mean to each other? And that always drives me crazy. The funniest thing to me is when we're doing our thing and he'll say something, I'll say something and you'll hear somebody in the audience go, whoa. I remember one time being on Conan show and I insulted him a great deal. And then I went to the next I was on. I went to YouTube to see what jokes I'd done. And I read the comments below and people would say, you know, he shouldn't talk Conan that way. If Conan wanted to, he could take him apart. We did a piece. That's a fun person to have dinner with. I know. Why are you making jokes? We had a when I was first doing the late night show, we did a piece where, you know, the most beloved one of the most beloved people at the time was Mary Lou Ratten, the gymnast. And she's, you know, small and cute. And she won all these gold medals and everyone loves her. And we did a pre tape bit where I think Andy says, I'm saying, I think I'm getting the hang of this late night, the hosting thing and goes, Andy goes, you know, you could. Yeah. But the other night I thought you, you were a little off. And I said, I don't know what you're talking about. He cut to a pre tape of me just losing it on Mary Lou Ratten. And I'm screaming at her fully committed. And we showed that audience laughs. I think the next day or the day after that, I go on Stern, Howard Stern. He takes calls and someone calls in. I saw the other night and you your behavior towards Mary Lou Ratten was atrocious. I don't think you're funny. That was awful. The way you spoke to us. I can't believe you didn't recognize my voice. Reminds me of a reminds me of a story. I don't know if these are like older elderly joke stories, but Mike Nichols, you know, was married to is was married to Diane Sawyer. And he was, you know, he's a hilariously funny guy. And he would, he would say things like that, invite him to a party and said, well, I'll have to run by the ball and chain. So he would call Diana's ball and chain as a joke. So then I think it was a Vogue. They said, evidently, Mike Nichols refers to his wife as the ball and chain. You know, it's a negative thing. So he wrote them a letter, which I think they published, but said, I realize that humor to your editors is like a cross to a vampire. Mike once said, Mike once said to me when we were at this party, he said, where are you staying? I said, New York. I said, the Essex House. He said, no, but really. I feel like I was lucky in the people that I got to meet. But then I look at you two and I think you got to meet so many more people. You know, you're younger. Yeah, you're going to meet everybody. I mean, I, I remember sitting when I was 21 years old and I was hired to write for the Smothers Brothers and I was very naive. And now we're all at dinner and Tom and Dick are having telling stories about people. And I'm sitting there going, I have no stories. I can't believe I don't have a story. Right. And I was 21. So you've got to be this age, 180 to have a story. You met General Grant. Oh, my God. What a fun guy he was. But I do think there was that whole. You said Mary Lincoln could be pushy. I mean, I'm not going to tell you. But now even, you know, just just in the there's that clip that I've seen a million times. I think it's you on the Tonight Show with Johnny Carson, Marty. And I think it's Betty Davis sitting next to you. Yes, she was. She had already killed with her three episodes, three segments. Yeah, three. She done the plate bit. Yeah, everything. Yeah, she did. You're making that up. Oh, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no. But you mean it. She did kill. She was she was great. Yeah, she was great. Yeah. But I just think, oh, Johnny Carson is the host of the Tonight Show and sitting next to you is Betty Davis. That's an era of of show business. And I'd never met Johnny Carson. So it was particularly because I loved Johnny Carson. Yeah. As we all did. Yeah. So much so that I didn't even do his show for 10 years or eight years or something when I could have because I thought, oh, I'm too hip. I just do Letterman. But the reality I was scared to. Yeah. Well, and people don't even understand the era then because it's all changed so much. But both of you have this experience where you go on you'd go on Johnny Carson's Tonight Show and you do your your set. And the next day, everybody had seen it. Yeah, right. And, you know, you could walk through a hotel lobby and Steve would just drive from town from hotel to hotel just to walk through the lobby. Wearing a shirt that said, did you see me on Carson? And but people people I have so many stories that I've heard from comedians where they were not famous. They did well on Carson. And the next day, everybody in the United States is saying great job. Whereas today it's just a completely different lens. My observation of that is a little different, but it's too long and boring. But I'll tell you one. No, I'd love to hear that. OK, well, I've that's what I believed. You went on Carson and you then the next day you were famous. Right. But I found with myself you went on Carson next day. Nothing. Then you go on Carson again. And the next day somebody looks at you like, did I meet you at a party a long time? And then finally it slowly starts to break through. And finally, on my fifth appearance, I finally got it together. I did a good, good shot. And I went into a store on La Cienega Boulevard and that woman said, were you that boy that was on the Tonight Show last night? And I said, yes, I am. And she said, oh, well, there's always that. There's always that. Yeah. And I remember seeing a clip, Marty, I could tell you're just slightly different. You killed. But you were just I could tell that you're you're not the Marty that's going on my show and you're just going to kick the shit out of me. It's going to be so much fun. You are. You did a very funny thing about spit take. But it was I could tell, like his voice is a little different and you're being you're you're being well behaved. You know what I mean? With Carson. With Carson. Yeah. Yeah. I never got you. I don't know. No, I mean, there was a there is a difference between being excited to be on Johnny Carson and then to be slumming it. You know, well, there's certain people I've never overcome my awe. And Johnny Carson was one of them that I always felt a little, you know, I hope I'm pleasing him. Yeah. You know, but they knew they had card games. Yeah. We played cards together. We had dinners. That's a famous card game. People talk about that card game. It was really fun. Yeah. The lesson of that card game is everything changes. I mean, you're having you mean well, you're having poker games with Neil Simon and Carl Reiner and Dan Milnick and, you know, Chevy. And then people die. You know, everything changes. I'm trying to bring up the party here. No, no, but it's and we're all going to die, too. Yeah. Yeah. Never. All right. Well, anyway, great. So shall we we're going to roll. We're going to roll long credits. Let's. Hey, what if we just prayed right now? We just do a group prayer. Yeah, I think that'd be very nice. And hold hands. Yeah. Well, I often think about that. It's it's it's almost my the fact that I get to know you guys and talk to you guys at all is is feels like I'm linking to this very important. I don't know. What I would say is I think everybody has kind of a disdain for their own era of show business and and and reviers. Well, what we observe and I probably applies to you that younger comedians like, you know, SNL guys that we kind of know or you know them better than I because you're a warm person. But we see that camaraderie among them. Yeah. That we assume the you know, like Don Rickles had, you know, with Frank and. Yeah. But I see that we have camaraderie with people of our generation and I see that we see the younger people helping each other. You know, it's a oh, absolutely. No, I mean, people like Fred Armisen and John Mulaney and Bill Hader are all close, close friends. And you know them. I was they they also have caller ID. I was talking to Fred Armisen once. I mean, it's probably 10 years ago. And he's just hanging around SNL. And he said the latest thing that we this is probably old now. But the latest thing is when you text someone and then the misspellings come up and the different words, you just don't change them. And you just send it off like that. But you do that to other comedians. Fred is an interesting guy because I remember we had we were at dinner once and might have been at my house and Fred was there and didn't say he's hilariously funny guy. But that night he didn't say anything. He didn't say a word. And I remember him looking up and down the table and everybody's laughing and joking and he was just observing it all. And he has that almost like, you know, I always heard Peter Sellers at a party was not a was very quiet and kind of just observing and not I think we were all there. We were. Yes, you were there. It was a funny guy's dinner. It was a funny guy's dinner. Steve, I was. Yep. Sure. You said funny guys. You were a last minute addition. I was the control group. Polly Shore fell out. I've been so happy for both of you because you've got this crazy smash hit only murders in the building. And I was initially very, very happy for both of you. And I love the show. And then I saw so much signage everywhere I drove in L.A. And then I would even leave L.A. and I would go anywhere and I would see both of your faces. And I would think, you know, that's it. I've no more. No more. I can't keep seeing their. This is too much. This is too much success. I once did an intro for Tom Hanks. He was getting a FI award. And the bit was something like this. I'd say, you know, when I first saw Tom in Splash or on the TV show, it was a bosom. Yeah, I said, hey, this guy's good. You know, I wish him luck. You know, and then I and then I saw him in Splash. I go, wow, he's got some real comedy chops. Good for him. That's great. And then I saw him in Philadelphia and I said, Jesus, really emotional actor. He's really, really good. And then I saw him in what's the word movie? Saving Private Ryan. Saving Private Ryan. And I thought, motherfucker. Can you say that in an FI? I guess you can. I did. Nice. Very nice. It's just yeah, I was thrilled. Thrilled for both of you. And it's we can see it on your face. Yeah, yeah. If you ignore the tears. That actually have blood in them. And you both get to be so funny. We are so lucky to have a hit at this stage of Marty's life. No, we are. It's fantastic. And the show's fun to do. The show's fun to do. We love Selena. We love everybody work with. You know, you finally get to the point where a lot of people learn earlier. I'm not working with assholes anymore. It's over. It's over. So everybody there is kind and having fun and upbeat and working for the same goal. And then you guys announced the cast for the third season and I became enraged. I know. Because I was like, you have a royal flush, but you're adding some more aces to it. Meryl Streep. Yeah. I'll tell you a story about Meryl Streep. Yeah, really terror a new one. Yeah. We were sitting around and we're going to start rehearsing a scene. And our, you know, our head writer is there, John Hoffman. And Meryl says, you know, I just want to say how happy I am that we're all here together and working so hard together. And John said, yeah, I agree. And you said, John, that's her first line. And it happened more than once. There was a scene on stage where she's supposed to be an actress. She's going on stage and she'd trip. And then the second take she tripped again. And you realized we thought she actually tripped. And we said, shouldn't someone move that wire? And she said, guys, I'm. And she also, she was supposed to do a song with an orchestra and she should start to sing. And she goes, I'm sorry, I can't hear the rhythm. And they said, well, can we? No, that was her. That was her line. And it's just every time we go, when are they going to fix that rhythm thing? I can't hear it. I did a thing. It was for Norm McDonald here in New York. And they had some gathering and I was, I guess, the emcee, for lack of a better word, but I gave the first talk. But I went up on stage and went head over heels fall. People thought it was a praffal, but it was real. And I was, you know, made a joke of it and everybody thought, well, and then moved on and then did my thing. And then I think the second person, yeah, the second person who went up with the third person, they tripped. And I went to, you know, and I said to a stagehand, what's going on? Everyone keeps tripping. Oh, yeah, those stairs have been messed up for a long time. They're not. And he was like, they're not even. Yeah. So everybody trips anyway. No, they still haven't fixed those fucking stairs. Where is that? It was. I don't remember where it was. Oh, thanks. Thanks. That's no help at all. So we can be tripping anywhere. Now we're going to go trip somewhere. And we also have Paul Rudd on our show. I was going to say. He was fantastic. Yeah, and I love that you have this show that everybody agrees is fantastic. Andrea Martin. And you add Paul Rudd. You know, you don't need Paul Rudd at this point. It's making it, it's too much. Yes, and Andrea Martin and Tina Fey. Yes. And Jesse Williams. You know who wasn't asked? Who? Oh, I know who wasn't asked. I know who wasn't asked because Conan has beady little eyes. Wait a second. In the first season. Conan did. Oh, that's Jimmy Fallon. I mean, your name, your name came up. Oh, it came up. Yeah. Oh, good. You said you can't light the eyes. No, I just can't light the eyes. He's got those Charles Grodin eyes. You can't light them. They're like a doll's eyes. Yeah. Listen, you're going to figure out a way to work me into this. Sure. I think. Hey, with the premises, we're doing a podcast. I don't know what you'll be playing. I know the title of the episode. Oh, yes. Here we go. The circus has come to town. My favorite thing is getting excited about the nice thing. I'm sure you're about to say. Oh, good. What is it, Marty? It's the guy who has no memory of how Martin Short has treated him over 25 years. The absent minded podcast. I love that. Yeah. Oh, Marty's got something to say about me. Yeah. God, gee, let's have it, Marty. Or also you can recognize it later that it was an insult. Marty said the nicest thing about me. He says I was a total idiot. Oh. That's right. You're about a podcast. I have the podcast. Please, that's not me talking. That's podcast magazine. Guest edited by Conan O'Brien. Yeah, right. But yeah, I'm sure there's a way to fix me in, to get me into the mix. Absolutely. Yes. You'd be honored. Incredible. You reminded me of a joke. I don't know why. We're doing a show next weekend, so these jokes are going through my mind. It was Marty would talk about me playing the banjo, which he always insults, of course. And the joke was, and maybe you use it, he said, and Bluegrass Magazine has recently named Steve the official ambassador of the five string banjo. It was between him and no one. Well, you have that great joke. It has deliverance. What is that? Oh, yeah. I hope I didn't just ruin it. It's such a great joke. What is it? Touring around with Steve is a lot like the movie Deliverance. It's all fun and games until the banjos come out. Yeah, you kindly had me to your apartment once. I remember the first time I ever met you. You do? No. Actually, I do. No, I do. All the life went after you. You said, no, that was really fun. I saw you rise up and then fall down. No, you came to our apartment and met you? No, no. We had worked together on SNL. I was very shy. And I remembered I don't want to get in Steve's. So I was writing things, but not approaching you. I was in the background. But then I was chosen for, you know, Lauren said, I think this fellow could host the late night show. It'll be rough for a few years, but he'll eventually get it. I think he could do it. So I'm named Letterman's replacement. And the first thing I do when I come out to LA is Lauren says, maybe this is a thing he does. But he said, let's take a walk through the flats Beverly Hills. And people told me later on that Lauren likes to take a walk. And he's taking this walk and he's giving me advice. He's saying, always tip. You're known now. Always tip at least 15 percent or you'll show up in the post. I thought he was going to tell me like, here's the secret. But he was telling me things like that, which was fine. And then he said, let's see if Steve's in. And I didn't know, you know, Steve, he always assumed Steve Croft. And so I was Rossi. Yeah, exactly. So we he knocks on a door and you answer and you have us into your place. And I was like, this is too much. I've I've just been put into this situation and I need to navigate this. And now we're dropping in on Steve Martin. And I'll never forget you had just had all the paintings taken down. And I think I just said, like, oh, there are no paintings. And you reacted immediately as if you had been robbed. What? Oh, my God. I thought, oh, shit, that's funny. That's a perfect reaction to where your paintings. Yeah. Whenever whenever in studio, I remember once every day when then you'd be in the studio at six day rehearsing and the lights would go out because of some situation in the building, Rockefeller Center, some situation, the lights would just go out. And Andy would always instantly scream, my pearls. Well, Andy, who? Andy Richter. Hilarious. Yeah, it was just my pearls. And oh, I got to remember that. But I have to give him credit. Yeah, no, you don't. No, you don't. No, just take it. And he was fine. I know. I'll blow it. My pearl. My pearls. My. Previews. Previews. I mean, pearls. My pes. My pes. How did you guys decide we're going to start working together as a as two hander, a two hander act? When? Where did that come about? And I know it's I'll tell you what, it's a boring story, so I'm going to give it to you. No, no, no. It was 2011. We were asked to interview each other for it was the closing of the Just For Last Comedy Festival in Chicago. It was May and it was 2011. And we just in what we have for breakfast. You had scrambled eggs. I had fresh toast. Come on, man. I had zero. And we interviewed each other and that was it. And it went well and we thought we'd do it again. And we just then. Well, the funny part is we were interviewing each other about comedy for a comedy festival. So we could talk about comedy, kind of like we're doing here. But, you know, to comedy people, it's kind of interesting. So we thought, hey, let's do that again. So we got a corporate gig or something. And so we're sitting and we're talking about comedy and we're thinking this doesn't work. And then we started and Marty had a show he did solo and I had a show that I did with a band. And so we kind of combined them. But he had material and I had a bunch of songs with funny intros. And when we first when we first started working together, he had everything and I kind of had nothing because I didn't bring the band. I said, well, I got to bring the band. So that's when it started to gel into a show. And I can go on. Did you ever? First of all, that was great. Yeah. Anyway, well, I was saying I was saying that, no, I think you said it. You know, this is what I didn't think I got to the part. Oh, you didn't need to. This reminds me of I made the mistake once of it's and you know it. It's like wearing the shorts. But I knew I I I made this terrible mistake of someone had mentioned food and what they eat. And I said, well, you know what I do now is I eat two meals a day. I have like a shake at eleven and I put a lot of spinach in it and then I try to eat dinner early like at five. And then I as I'm finishing saying it, I see Marty just staring at me the way the way a shark looks like. It looks at a canned ham that fell into the ocean. And he looks at me and he said, you know, when other people discuss the details of their diet, it's boring. You know, I'm not you. And of course, there were some writers standing around who were like, yes, they love when the bosses attack. That was also just me realizing, I why did I get into this? Why did I lather myself up with bacon grease and then climb into this piranha piranha pool? Why did I why did I do that? She's very wise about about talking about what you eat. She said you're allowed to talk about what you do eat, but you're not allowed to talk about what you eat. It's very good. I like that. Yeah, I like that. I mean, if this podcast, if we go away with one thing, that's it. It's like with me beats. I don't. Why? One thing I was curious about is when you come up with a great new insult for the other, do you ever try it out in the moment on stage or do you ever? We have. Do you try to surprise each other? Not really. But sometimes we've come up with things. And then we'll go right to the prompter afterwards and say, oh, right. You know, we'll remember what what prompter that if we had a prompter, we had to say if we had a prompter. So you're saying if we had a prompter and we came up with a joke, we would go over and talk. I mean, now we just go to our own minds and lock it in. We were talking earlier about people you've met. And I know, Steve, that you got to meet or kind of meet Elvis. I did. And I told the story a million times. So I don't know if it's worthwhile. Well, I just love it. I was it was 1971 and I was opening for Anne Margaret at the Hilton in Las Vegas, which is no longer there for good reason. It's like they tore it down the following day. The worst comedy room. Yeah. There's a ceiling that's like 80 feet high. Yeah. So laughs. The laughter rose above the audience's head about two feet and stopped and stopped. But anyway, and Elvis was opening the next weekend and he knew Anne Margaret. So now it's after the show. I know Elvis is going to come back and say hello to Anne Margaret. And so I leave my dressing room door open and I did my act in 1971. So the act is not fully formed. You know, it's got a weirdness to it. And so Elvis walked by and he saw me and he stopped and he said, son, you have an oblique sense of humor. And then he came in and now we're talking. I'm talking with him and I know you don't know what to say. And my manager was there who know all about Sun Records. We can talk about that. And then there was a pause in the conversation. Oh, first of all, but this is the part I loved. Elvis has a guy who comes up to him to get him out of conversation. Elvis, I'm sorry, we have to go. And in this case, he comes up as sorry, we have to go. Elvis said, it's OK. I've been blessed. So then we're talking. Then we run out of conversation. Then he said, I want to see my guns. Jesus. And we said, sure. And he was a he was a he was a gun. He liked artful guns like an engraved. Sure. And he was very cautious. They were loaded. And so he took out a six shooter and he opened up and dumped all the bullets in his hand. And before he handed me the gun to look at it and I was looking at I'm marveling at it. Then he took out another gun, did the same thing, dumped out the bullets, handed it to me. And then they pulled out from his sock. Yeah. A derringer. And then open that up, dumped out the bullets, handed it to me. And then I'm I'm holding three guns and he's holding 16 bullets. And I'm thinking, where is Elvis's guy? Yeah. To get me out of this. Do you remember what he was wearing? Yes. All white. It was Elvis Slim. And he had the all white and he wore that big buckle that the Hilton had given him to him for biggest show ever in the history of the world. Right. But he was very sweet and very nice. Yeah. And that comes across when you look at the documents. That's a famous face though. Elvis Presley. Yeah. Jesus. Well, also the reason I wanted to because I know that you met Frank Sinatra. Yes. And who's your absolute idol. But it was one of those situations where you because I remember you told me this once you were at a bar and it. No, I was at George Slaughter's house. Oh, George Slaughter's house. OK. It was after a Sinatra Shirley MacLaine concert at the Greek theater. And we all went back to his house and Diana Shore was there. She was a big fan of SCTV. Oh, great. She's going on about it. And I'm thrilled to meet Diana Shore. She said, Hey, do you want me, Frank? I said, Sure, sure. And I went up to him. Now, this next part Paul Schaefer maintains I've made up because he said he didn't he didn't speak like out of guys and dolls. And I said, Well, he did, though. He said, I said, Mr. Sinatra, Martin Schoen, he said, I know well of you and your models. I know well of you. I can't believe that. Yeah, I know. Well, that's not guys. Yeah. Anyway, then then he said, Would you like a drink? And I said, Sure. He said, What are you drinking? I said, Anything you're drinking, Frank. And so he turned to the bar and said, Jack Daniels. And I don't don't don't drink scotch. So the bartender said straight up or on the rocks. And I was nervous. I thought he said straight up or relaxed. And I said, I'll have it relaxed. And he Frank said, He said straight up or on the rocks. I'd known Frank 15 seconds and I pissed him off. It starts to. Yeah. Julie beat the crap out of this guy. Are you a moron? So I. Good Frank. Now, it was when you meet those people, it is surreal. But, you know, I used to have that with Mike Nichols and I knew him for 20 years that I was still in awe. Like you talk about Carson, you're in awe of being in their presence. I had I mean, this is someone he both have met a billion times. But Lauren once asked me to go to a he said, Would you like to go to a Yankee game with me? And I said, Yeah, I'd love to do that. And there was a playoff game on the Red Sox. And so we're I get in the car and he says, We're picking up. I think he said we're picking up a friend. I didn't hear who he said we were picking up. But he puts, you know, so I sat up front. So there was room in the back for Lauren and his friend. I set up with the driver and we start driving up and then we start to slow down and there's someone leaning against the lamppost in like a very cinematic way. And we slow down and it's Jack Nicholson. Wow. And Jack gets in the back seat and he goes in. Lauren goes in. He's like, How you doing, Lauren? He says, This is our corner. And he says, It's very nice. Just said, Nice to see you. And I said, Oh, so nice to see you, sir. You know, and then we drive, we see the game. And my experience was if you want to be anonymous, walk with Jack Nicholson, because I am my life is I'm six, four. I have this pastry on my head. I am immediately like me or dislike me. Everybody knows it's me. And I walked down the street and everybody knows it's me. And suddenly nobody saw me because I'm walking three feet behind Jack Nicholson. But then the real treat of the night. So we chatted a little bit about a few things and didn't talk much. He mostly spoke with Lauren and then he drops me off at the end of the night. And I think, well, this has been great. And I get out of the car first because I'm just going to walk. We dropped Jack Nicholson off and he gets out of the car. And I just said, It was a real honor to meet you, you know, Jack. And he said, My boy is crazy about you. And I said, He said, I'll never forget. He said, My boy, we're standing there and Lauren still in the car and he goes, My boy is crazy about you. Every morning it's Conan this and Conan that. It's driving me fucking crazy. I had no idea that even I had, but I just knew that I was an irritant in his life. And that made me very happy, very happy indeed. I'm just going back of it because I keep remembering this great joke. I think it was a Shackie Green's joke about Frank. And it might have been Don Rickles, but I think it was Shackie Green. He said, he said, and Frank's in the audience. He said, Frank saved my life one night. You know this joke? He says, Frank saved my life one night. I was in an alley and I was getting beat up by some guys. And Frank said, That's enough. And then there's the famous Rickles joke, which I'm, it's story, which I'm sure is true, which is Rickles asking Frank. He's like, I'm meeting, I'm dating this young girl. Could you, this young woman, it would really mean so much if you just came through the lobby and, and walked through the restaurant and said hello to me in front of her. That would really help me seal the deal. And so Frank Sinatra comes through and walks up to Rickles and his date and says, Hey Don, I just want to, Frank, please, I'm eating. And Frank leaves the restaurant and then about 30 seconds later, two guys come in and pick up Rickles, carry him out of the restaurant and dump him in the fountain. Is that last part true? It was a fountain. It was a fountain of acid. That's the part that's less funny. Frank had it constructed. So they killed Don Rickles. Yeah, they did. Yeah. He never lived past 1961. Guys, I'm going to let you go because you have, it's been made clear. Wouldn't you like to get some part of this interview that's usable? You're a young lad. You haven't, you've listened to some of my, I'm going to say this is my favorite episode maybe ever. This is one of my favorite. This is a spectacular episode. I'm just going back over why we're doing it. It's because of your admiration for me and my work. This is a very, very famous podcast. I understand that. I know that. And so we should be honored to be part of it. You couldn't say it with a straight face. Hey, I see after this, that's you and me go and cash our checks. Let's do it. We need a big bank. I mean, not every bank. I have ideas. Maybe we'll get some cash and some just to cash your check. Yeah. And I have a servant with me. He could carry the bullion. You know, you guys have always kept in touch. That's what I like about you. You never got in the bubble. You're out there. Oh, I'm of the people. Always. Kept in touch with whom? What do you mean? You're just in touch with the people. You know what I mean? You're going to the bank. You'll probably have to stop and get a wheelbarrow. But you do it in a humble way. Would you say that with success, you changed? I'm pausing. You can't help but change. But I'd say I have changed for the better with success. That's what I think. You probably disagree. I can't wait to phone others. When did you meet? Did you know Steve? I met him on Three Amigos, 85 July. And then we became great friends. And then you make that decision of whether you're going to just have that two month experience of making a movie and never see someone again or not. And I think we both chose to keep hanging. It's interesting you bring up Three Amigos because you make that movie. It came out and it did what it did. But then it goes on. And I don't know when it happened. But within maybe 10 years of it coming out, there's this whole generation that seizes that movie and says this is one of our favorite movies. And it has grown since then in a way that I think is well deserved. But it's kind of fascinating to me. Were you aware of that happening? That's what happens with a lot of my movies except for the 10 year part where they like it. Well, I've always found that you never know if a movie is a hit or success till 10 years goes by. Because some movies are big hits when they come out and then you never hear of them again. And then some movies tend to grow. I was surprised. In fact, we got a call from a magazine in London. And they said we want to. It was a film magazine. They said we want to put you, Marty and Chevy on the cover. And we said, why? They said, well, it's the 25th anniversary of Three Amigos. I said, you care? And that's when I started noting that there was some kind of thing happening. Yeah, it's got this whole other life. And I can't tell you how many times I've seen they'll ask various rock musicians, artists, athletes, just anyone, politicians list favorite movies. And then Three Amigos keeps popping up in there, which is really great. Well, Steve wrote it. Well, with Lorne Michaels and Randy Newman. That's right. But you said you wrote the funniest parts. I will. Actually, Randy Newman wrote my favorite joke in the whole thing. And it's when El Guapo, it's his birthday, and all his men are celebrating. And he opens a package and he goes, it's a sweater. I love the canteen joke so much that you're both, you know, the three of you are running out of water. Oh, canteen. The canteen. And just there's barely enough. And then just luxuriating. Chevy. I like spomb. Yeah, lip balm is so fantastic. My favorite joke is that we go into a saloon that's filled with bad guys. And we're all in our spangly outfits. And I go up to the bartender and say, excuse me, we're not Mexicans. We're from out of town. Was it fun to make? Yeah, it was. Yeah, it was. We were actually, you know, in Arizona and on locations and building these beautiful sets. It's just one of those, because sometimes I've known when you're having a blast making something, I sometimes get worried. If you're having a really good time making something, that this means it won't be good. One of my favorite lines, I just, somebody reminded me of it too at the end. The very end, I go up to Patrice Martinez, who's a beautiful actress who played Carmen. She passed away, unfortunately. And there's supposed to be like something between us. And I go up and we're about to ride off. And I say to her, I'll be back one day. And she says, why? Well, guys, what's the plan for the rest of the day? I'm sure you've blocked out a whole chunk of time with me. Well, it's, I've got to do my 5BX workout. Incredible. I was going to say you look amazing. Thank you. And today it's AB day. So I'm going to work on the abs. And that's most of the day. It's hard for me for you, when you say that, for me not to think of your role on Arrested Development, where you're the bullet. Shoot me. Shoot me. And my son adores that show. So the times that you've been around, as much as you've done, you never know what's going to get people. And he's seen and really liked your other work. But you as the bullet. Whatever. Isn't that your... I was a guy, I was so old, I was their uncle that my legs didn't work. And I had to be carried around by a big strong man. And we kept adding jokes. And at one point I said, to the nuts. And they put me down to Jason Bateman's testicles. And I went, bridge mix, bridge mix. They put me on a table to eat nuts. But it's just so nice that you do these different things. You never know what's going to catch with who. And then my son, who now is 17, but at the time he was seeing it, he was like 12. And he was like, well, this is the funniest thing I've ever seen. And I'm like, well, he's coming over tonight. And it's just, it's lovely. It's very nice. Gentlemen. Thank you, Conan. I want to let you go. Thank you very much. Think about the cameo. Of course. I will play a small part. I have a tendency to shoot the lens. I look into the lens. Wow, good. What would it be? It's funny because a Shrek-like monster crushes townspeople and then is arrested for murder. Something like that. Why? Why do I goad you? Why do I ask for more? I like Conan's approach because most actors try not to look into the lens. Yes. I would have a small role where I'm literally carrying crab cakes in the background at the nice west side apartment. And I stop and I turn and look right into the lens and freeze. And that's what we're going to do. Oh, Steve's taking a call. No, no. Oh, no, I'm looking at my plans for the rest of the day because you asked and then I realized I have none. Well, perfect. Okay. Thanks a lot. Thank you very much. Guys, you both mean the world to me. And this is like, I don't know, we will never top this episode. And I know that you are being self-effacing and saying we've killed time is an absolute joy. Thank you. I bow to both of you. I love you. I bow to you. And obviously we've both been influences, but which one a little bit more? Oh, me. Oh, is it? You can't see everybody. He's looking at me. Thanks, Conan. No. Anyway, Steve, your car's here. Guys, go in peace. Okay. Thanks a lot. Oh, by the way. Yes. You forced this on us. Yeah. Hi, my name is Steve Martin. I feel blank about being, let's hear you do it spontaneously, but replace Conan. You know what? You could do another version and they could put it. That was fantastic. I thought I did do a good job. Oh, no, I'm challenging him. You go, suddenly we have to learn lines. It's not learning a line. It could be, you know, the right. You don't write. You could, you could have a sincere emotion and say it in a moment. Oh, you know what? I've never thought of that. Yeah. I would say my name is Conan O'Brien and I feel overwhelmed, overwhelmed with gratitude that Steve Martin and Martin Short even know my name. And that's, you know, there I go. Okay. It doesn't have to be, you know, I didn't have a writer work on that. So you wanted us to compliment you. Yes. We didn't think of that. Okay. Thanks a lot. Conan O'Brien needs a friend. Conan O'Brien, Sonam O'Sessian and Matt Gourley. Produced by me, Matt Gourley. Executive produced by Adam Sachs, Nick Leal and Jeff Ross at Team Coco and Colin Anderson and Cody Fisher at Earwolf. Theme song by The White Stripes. Incidental music by Jimmy Vivino. Take it away, Jimmy. Our supervising producer is Aaron Blair and our associate talent producer is Jennifer Samples. Engineering by Eduardo Perez. Additional production support by Mars Melnick. Talent booking by Paula Davis, Gina Battista and Brit Kahn. You can rate and review this show on Apple Podcasts and you might find your review read on a future episode. Got a question for Conan? Call the Team Coco hotline at 323-451-2821 and leave a message. It too could be featured on a future episode. And if you haven't already, please subscribe to Conan O'Brien Needs a Friend on Apple Podcasts, Stitcher or wherever fine podcasts are downloaded. Thanks for watching!"}, "podcast_summary": "- TL;DR: Comedy legends Steve Martin and Martin Short discuss their careers, their friendship, and their hit show \"Only Murders in the Building.\"\n- They reflect on their experiences meeting famous individuals like Elvis Presley, Frank Sinatra, and Johnny Carson.\n- The duo talk about their approach to comedy and the importance of preparation and camaraderie in their work.\n- Surprising Fact: Steve Martin met Elvis Presley and Martin Short met Frank Sinatra.\n- Inspiring Takeaway: Maintaining friendships and working with kind and talented people can lead to successful collaborations.", "podcast_guest": "Martin Short", "podcast_highlights": "Chapter 1: Conan's Friends Spat\nChapter 2: Swatting and Truth Telling\nChapter 3: The Art of Cursing\nChapter 4: Growing Up in Proper Households\nChapter 5: The Irish and Turkish Curses\nChapter 6: Swatting and Truth Telling: Redux\nChapter 7: Curse of Blue Streaks and Misunderstood Geniuses\nChapter 8: Conversations about Swearing and Comedy\nChapter 9: Martin Short's Early TV Appearance\nChapter 10: Life Lessons from Marty's Dad and Grandmother\nChapter 11: The Art of Cursing Continued\nChapter 12: Martin Short and the Irish Curse\nChapter 13: Irish Curses and Shit-talking\nChapter 14: Growing Up Proper and Cursing Lessons\nChapter 15: Funny Bonds and Funny People"}
=======
{"detailed_guest_info": "Martin Hayter Short is a Canadian-American actor, comedian, and writer known for his work on television programs such as SCTV and Saturday Night Live. He has also had a successful career on stage, starring in Broadway productions and earning a Tony Award. Short has appeared in numerous comedy films and provided voice-work for animated movies. He began touring with Steve Martin in 2015 and co-stars in the Hulu comedy series Only Murders in the Building. He has been recognized with various awards and nominations throughout his career.", "podcast_details": {"podcast_details": {"links": [{"href": "https://feeds.simplecast.com/dHoohVNH", "rel": "self", "title": "MP3 Audio", "type": "application/atom+xml"}, {"href": "https://simplecast.superfeedr.com/", "rel": "hub", "type": "text/html"}, {"rel": "alternate", "type": "text/html", "href": "https://teamcoco.com/"}], "generator_detail": {"name": "https://simplecast.com"}, "generator": "https://simplecast.com", "title": "Conan O’Brien Needs A Friend", "title_detail": {"type": "text/plain", "language": null, "base": "https://feeds.simplecast.com/dHoohVNH", "value": "Conan O’Brien Needs A Friend"}, "subtitle": "After 25 years at the Late Night desk, Conan realized that the only people at his holiday party are the men and women who work for him. Over the years and despite thousands of interviews, Conan has never made a real and lasting friendship with any of his celebrity guests. So, he started a podcast to do just that. Deeper, unboundedly playful, and free from FCC regulations, Conan O’Brien Needs a Friend is a weekly opportunity for Conan to hang out with the people he enjoys most and perhaps find some real friendship along the way.", "subtitle_detail": {"type": "text/html", "language": null, "base": "https://feeds.simplecast.com/dHoohVNH", "value": "After 25 years at the Late Night desk, Conan realized that the only people at his holiday party are the men and women who work for him. Over the years and despite thousands of interviews, Conan has never made a real and lasting friendship with any of his celebrity guests. So, he started a podcast to do just that. Deeper, unboundedly playful, and free from FCC regulations, Conan O’Brien Needs a Friend is a weekly opportunity for Conan to hang out with the people he enjoys most and perhaps find some real friendship along the way."}, "rights": "2021 Team Coco & Earwolf", "rights_detail": {"type": "text/plain", "language": null, "base": "https://feeds.simplecast.com/dHoohVNH", "value": "2021 Team Coco & Earwolf"}, "language": "en-us", "published": "Mon, 21 Aug 2023 04:05:00 +0000", "published_parsed": [2023, 8, 21, 4, 5, 0, 0, 233, 0], "updated": "Mon, 21 Aug 2023 04:05:20 +0000", "updated_parsed": [2023, 8, 21, 4, 5, 20, 0, 233, 0], "image": {"href": "https://image.simplecastcdn.com/images/d139afc2-e8b0-4ec2-bc74-fdc3c88f649a/d59c963f-c9dc-41d8-9005-369e80634b3b/3000x3000/screen-shot-2023-05-01-at-12-14-01-pm.jpg?aid=rss_feed"}, "link": "https://teamcoco.com/", "itunes_type": "episodic", "summary": "After 25 years at the Late Night desk, Conan realized that the only people at his holiday party are the men and women who work for him. Over the years and despite thousands of interviews, Conan has never made a real and lasting friendship with any of his celebrity guests. So, he started a podcast to do just that. Deeper, unboundedly playful, and free from FCC regulations, Conan O’Brien Needs a Friend is a weekly opportunity for Conan to hang out with the people he enjoys most and perhaps find some real friendship along the way.", "summary_detail": {"type": "text/plain", "language": null, "base": "https://feeds.simplecast.com/dHoohVNH", "value": "After 25 years at the Late Night desk, Conan realized that the only people at his holiday party are the men and women who work for him. Over the years and despite thousands of interviews, Conan has never made a real and lasting friendship with any of his celebrity guests. So, he started a podcast to do just that. Deeper, unboundedly playful, and free from FCC regulations, Conan O’Brien Needs a Friend is a weekly opportunity for Conan to hang out with the people he enjoys most and perhaps find some real friendship along the way."}, "authors": [{"name": "Team Coco & Earwolf", "email": "conaf@teamcoco.com"}], "author": "Team Coco & Earwolf", "author_detail": {"name": "Team Coco & Earwolf", "email": "conaf@teamcoco.com"}, "itunes_explicit": true, "itunes_new-feed-url": "https://feeds.simplecast.com/dHoohVNH", "publisher_detail": {"name": "Team Coco & Earwolf", "email": "conaf@teamcoco.com"}, "tags": [{"term": "Comedy", "scheme": "http://www.itunes.com/", "label": null}]}, "first_episode": {"id": "f8e873cc-2903-4771-a20a-f507d7e3772a", "guidislink": false, "title": "Steve Martin and Martin Short", "title_detail": {"type": "text/plain", "language": null, "base": "https://feeds.simplecast.com/dHoohVNH", "value": "Steve Martin and Martin Short"}, "summary": "Martin Short feels duped about being Conan O’Brien’s friend. Steve Martin feels sad about being Conan O’Brien’s only friend.\n\n\n\nMartin and Steve sit down to talk with Conan about his cameo appearance in their live show, season 3 of Only Murders in the Building, the origin of their working partnership, and run-ins with Elvis and Frank Sinatra.\n\n\n\nFor Conan videos, tour dates and more visit TeamCoco.com.\n\n\n\nThis episode was recorded on 5/17/2023.", "summary_detail": {"type": "text/plain", "language": null, "base": "https://feeds.simplecast.com/dHoohVNH", "value": "Martin Short feels duped about being Conan O’Brien’s friend. Steve Martin feels sad about being Conan O’Brien’s only friend.\n\n\n\nMartin and Steve sit down to talk with Conan about his cameo appearance in their live show, season 3 of Only Murders in the Building, the origin of their working partnership, and run-ins with Elvis and Frank Sinatra.\n\n\n\nFor Conan videos, tour dates and more visit TeamCoco.com.\n\n\n\nThis episode was recorded on 5/17/2023."}, "published": "Mon, 21 Aug 2023 04:05:00 +0000", "published_parsed": [2023, 8, 21, 4, 5, 0, 0, 233, 0], "authors": [{"name": "Team Coco & Earwolf", "email": "conaf@teamcoco.com"}, {"name": "Team Coco & Earwolf"}], "author": "Team Coco & Earwolf", "author_detail": {"name": "Team Coco & Earwolf", "email": "conaf@teamcoco.com"}, "links": [{"rel": "alternate", "type": "text/html", "href": "https://teamcoco.com/"}, {"length": "66360747", "type": "audio/mpeg", "href": "https://chtbl.com/track/9E9755/arttrk.com/p/ST44R/stitcher.simplecastaudio.com/c945bd13-c7f3-4f22-95b5-4bf98e12b21f/episodes/f3b78879-55a2-42c1-ad4a-07bb107c4860/audio/128/default.mp3?aid=rss_feed&awCollectionId=c945bd13-c7f3-4f22-95b5-4bf98e12b21f&awEpisodeId=f3b78879-55a2-42c1-ad4a-07bb107c4860&feed=dHoohVNH", "rel": "enclosure"}], "link": "https://teamcoco.com/", "content": [{"type": "text/html", "language": null, "base": "https://feeds.simplecast.com/dHoohVNH", "value": "<p>Martin Short feels duped about being Conan O’Brien’s friend. Steve Martin feels sad about being Conan O’Brien’s <i>only</i> friend.</p><p> </p><p>Martin and Steve sit down to talk with Conan about his cameo appearance in their live show, season 3 of Only Murders in the Building, the origin of their working partnership, and run-ins with Elvis and Frank Sinatra.</p><p> </p><p>For Conan videos, tour dates and more visit <a href=\"https://teamcoco.com/\" target=\"_blank\">TeamCoco.com</a>.</p><p> </p><p>This episode was recorded on 5/17/2023.</p>"}], "itunes_title": "Steve Martin and Martin Short", "itunes_duration": "01:09:07", "subtitle": "Martin Short feels duped about being Conan O’Brien’s friend. Steve Martin feels sad about being Conan O’Brien’s only friend.\n\n\n\nMartin and Steve sit down to talk with Conan about his cameo appearance in their live show, season 3 of Only Murders in the Building, the origin of their working partnership, and run-ins with Elvis and Frank Sinatra.\n\n\n\nFor Conan videos, tour dates and more visit TeamCoco.com.\n\n\n\nThis episode was recorded on 5/17/2023.", "subtitle_detail": {"type": "text/plain", "language": null, "base": "https://feeds.simplecast.com/dHoohVNH", "value": "Martin Short feels duped about being Conan O’Brien’s friend. Steve Martin feels sad about being Conan O’Brien’s only friend.\n\n\n\nMartin and Steve sit down to talk with Conan about his cameo appearance in their live show, season 3 of Only Murders in the Building, the origin of their working partnership, and run-ins with Elvis and Frank Sinatra.\n\n\n\nFor Conan videos, tour dates and more visit TeamCoco.com.\n\n\n\nThis episode was recorded on 5/17/2023."}, "itunes_explicit": true, "itunes_episodetype": "full"}, "transcribed_data": {"podcast_title": "Conan O’Brien Needs A Friend", "episode_title": "Steve Martin and Martin Short", "episode_image": "https://image.simplecastcdn.com/images/d139afc2-e8b0-4ec2-bc74-fdc3c88f649a/d59c963f-c9dc-41d8-9005-369e80634b3b/3000x3000/screen-shot-2023-05-01-at-12-14-01-pm.jpg?aid=rss_feed", "episode_transcript": " Hi, my name is Martin Short and I feel duped about being Conan O'Brien's friend. Hi, my name is Steve Martin and I feel sad about being Conan O'Brien's only friend. Hey there, welcome to Conan O'Brien Needs a Friend. And no, Sona was not just punching me before she fled back to her chair. You swatted her elbow first. Yeah, you did. You scooted over in your chair. No, I was trying to help her. She seemed unsteady and I would never swat at anyone. She seemed unsteady and I was helping her adjust herself in her seat. Oh, okay. I didn't realize. I think you were just angry. I was talking about how many cups you had. I didn't realize. There was a narc over here. Yeah, that's right. Get ready. This guy's working for jobs. Listen, there were some shenanigans just before the podcast started. Maybe I took a swing at Sona's shoulder, slightly missed it, and then she needed to retaliate. And then of course, teacher, teacher, I saw what happened from Mr. Matt Gourley over here. I did, and I tell the truth. I appreciate it, Matt. You're a truth teller. Even though no one asked you. You're my big geek baby. What the fuck was that? Sometimes I start speaking before I know where I'm headed. Wait a minute, sometimes. That is 97% of the time. Here are the three things that went through my head Robocop style. Like I had a readout of options. It was my big baby, my big daddy, and my big gay boy. I'm none of those things. You're none of those things. I'm not saying this is like good or right or healthy. I have a problem. I like that this seconds ago, I was taking a swing at Sona and she was returning fire by swatting at me. And then you end up the villain. Am I the villain or am I just the misunderstood genius? I appreciate it. I'm looking it up right now and no, villain and fool. Okay, big giggy. Man, you're just the worst. Well, it's faulty. The wiring's off, but someday it'll get there. I used to love when people would get really angry and try to yell at someone and swear but not be able to pull it off. And I knew people that would do that. I know someone in particular, I won't name them, but they'd be like... Shit, sir. Fuckler. And they just couldn't put it together. That's me. I'll damn you, shit man. What? Yeah. It's just so easy to curse though. Let's see it. Go ahead, genius. You fucking piece of shit, dick fuck. You're just a big sandpaper baby who's got little feet and don't even know who cheek people are. That's a good one. And the fact that you don't know who cheek people are is your worst quality. Yeah. Go buy some lips, you reach around. What? Okay. You know what? Now you're on fire. Okay. You started out, I mean, good Lord. You didn't have it earlier. Yeah, now it works. Yeah, now it's fantastic. Yeah. But Sona, you are very good. I've seen Sona get mad many times. That's amazing. And often, I have to say, not at me, just at random people. And you are terrific at swearing. I am great. I am really good at it. You are concise. Yes. They explode out of your face, these curses. Is this the way you grew up? No. My mom would be horrified that I'd be cursing. They're nice people. And I think that's why I got good at it. What do you mean? Because my mom didn't want me to curse. And so I was like, well, I'm going to show you, I'm going to curse the best out of anybody. Curse of blue streak. Yeah. Well, good for you. Thank you so much. You overcame your obstacles. My dad, no joke, cursed a lot. And I'm wondering why that's why I'm bad at cursing because I never got to exercise that muscle. My father, I have a specific memory, which is my father, you know, there wasn't much swearing in our house. Occasionally, you know. What? There wasn't. There wasn't much swearing in our house. Occasionally. You're Irish. Okay. That's nice. Wait, I'm being serious. That's terrific. You guys are good at cursing. What are you talking about? You keep youth Irish. No, the Irish curse means we have small penises. Not the Irish curse. That makes more sense. Yeah, please. That's the Irish curse. Okay. All right. I mean, I've been looking for mine for years. Oh, man. I mean, give me a map. Hell! What were you going to say? No, we're going to stick on this theme now. I've used ways to find it. Hell! Okay. No, we could go somewhere else. It's fine. Solid C+. Anyway... You dropped your penis. It's at the bottom of that tequila bottle. So anyway, no, I grew up in a very proper house. My mother really didn't want, you know, swearing, and there wasn't a lot of swearing. Really none at all. And then I'll never forget, I had my room was up in the attic. I lived up there with my brother Neil and my sister Kate. And we were, there were so many of us, they said, okay, some of you were going up to the attic and it was pretty clear who was headed up there. So I'm at the end of the attic. Now what I remember is... You're saying you didn't draw straws. Oh, no, no, we didn't draw straws. It was you three, you three up into the attic now. And we'll send a plate of food and you can figure out who gets it. There was plenty of space. A lot of empty bedrooms. Tons of rooms. Tons of rooms. Boarding house, basically. We had a car on a revolving display on the second floor. That's how much extra room we had. 1975 Buick Skylark. There was just so much extra room. But anyway, so I'm up there and I'm in my bedroom and it's dark out. And all I remember is my father was coming up and he was trying to, he was trying to find something and it was very late. And my sister Kate was not in her room at the time. I think they were doing some work in that room. And all I know is that there was a bunch of junk in there, including a big bed frame that was jutting out at a weird angle. And so I'm in my bed and I'm just about to fall asleep and my closet connected to my sister's closet. Like you could walk from one right through to the other. What? So there was, yeah, it was just a way for my sister to escape or for me to escape. It's the kind of house we lived in. Anyway, but I'm not lying. They did connect. It was just an opening and you could walk right into the other room. And so it's dark out and I'm just kind of falling asleep and my father comes up the stairs and he's looking for something in Kate's room. But it's dark. And all of a sudden I hear this unmistakable sound of his shin hitting the iron bed frame that's jutting out in the darkness. And I heard, Every single, every single swear you could ever imagine. Oh, you're censoring yourself, but he didn't. Well, I like it's funnier to me that it's just it's I remember it. It was so jarring and so traumatic. I remember it as That's how it's coming out. And I heard every swear that's ever been invented from this like, you know, very brilliant scientist. You learned it all in one fell swoop. Oh, in one. I mean, I had a recorder running and I've had them all. It's like, yep, he got every single one. And I remember just pulling the blanket over my head. Oh, my God. Did you did he have like colloquial swears? Because my dad, for some reason, had his own like jazz swear lingo where he would go, God damn it anyway. And God damn it all. Make sure you damn it every single way you can and all of it. And he would like, what does God damn it anyway mean? He would put it anyway after God damn it just completely takes the power away to God damn it anyway. It takes the power away. He put up the Christmas tree and it wouldn't work. And I love this man and I love him for this, but he'd be like, God damn it anyway. God damn it all. And these were just like, I don't know if they were like passed down through the family or what. But I now will stub a toe or something. And like I have to stop myself from going, God damn it anyway. I think that's why I go to like you're a cheek people or a tooth lover. I don't know. I just want to get away from I want to stop the cycle. We had a lot of ethnic curse words in our like a lot of Turkish ones and Armenian ones. Yeah. Well, one of my this is bad for people who actually know what I'm saying. They're bad. But like one was like, Baba Jananasiçim or, you know, Pezivekisholisheg. Things like that. Those are the things my dad said when he hit his shin. He was Turkish. My dad's Turkish. Oh my God. He said, Bada Habeshabeshi. One was I'll shit on your dad's soul. And my dad would say that to people. And sometimes like, you know, he'd do it as a throwaway. I'll shit on your dad's soul. That is fantastic. Oh, Turkey. You devils. What was the other one? One's like Pezivek is like a like a pimp or siktir is like fuck it or, you know, isholisheg is like a son of a donkey. You know, it's fine. I mean, whatever. But I'll shit on your dad's soul. Yeah, that should they should win the Olympics. Yeah, because that's graphic and poetic. Yeah. It's like figurative. It is also very gross. And I think of the show the soul as being ethereal like shit would drop through it. But no, this is proof that the soul has some viscosity. But what if the only way you could materialize a soul is to shit on it and you find like, you know, when you pour paint on the invisible man. Right. If you shit on the soul, you can trap a soul. Right. Yeah. Check your toilet bowl next time. Make sure there's nobody's soul in there. Oh, no, I just flushed Grandma. Oh, man. Well, she's going to a better place. Don't shit on Grandma's soul. She's going to a better place. The water solidization plant. Yeah. In our house, it was all Jesus, Mary and Joseph. I mean, it was all Catholic stuff. And so it didn't really it was just more of a prayer. More of a litany. Your grandma didn't swear? Oh, my God. No. My grandma, Mottie, who lived with us. I didn't I don't know why I didn't think Irish people are just they swear. No, you're thinking of pirates. No, no, my Irish grandmother was the most she was a very well educated school teacher and she lived with us and she would say, Oh, Moses. Oh, Moses. That was the and she would say it all the time. Like, what's wrong, Mottie? Nothing. Oh, Moses. Oh, God. That's like a haunted house like Flores para los Muertos. You just hear that in the night. Well, she loved bad news, too. She loved it. Oh, Mottie, something terrible happened. Oh, tell me, tell me. And she would love because the Irish love bad news. So once it was her birthday. And so I said, Hey, Mottie, happy birthday. And I jumped off the top steps of our stairway and pretended to get hurt because I thought that would make her happy. Happy birthday. And I jumped. And then I was like, Did you like that? You thought it was hurt for a second. Oh, Moses. Thank you. Thank you. Anyway, this was very educational, I think. So I will never shit on your soul. Oh, that's really nice. Wait, thinking. No, I won't. Oh, OK. OK, everybody, settle down. Settle down. Please. I want you to settle down. Sorry. I've got some exciting news. And when do I have exciting news? It's never happened. Conan O'Brien Needs a Friend is coming to you live at the Brooklyn Academy of Music for two shows, November 7th, November 8th, as part of the New York Comedy Festival. Presale tickets will be available starting this Wednesday, August 23rd at 11 a.m. That's Eastern Time with the code NYCF before the general on sale, which is Friday, August 25th at 11 a.m. ET. I'm very excited about this. I'm very excited about this. To get your tickets and all information that you need, head to nycomedyfestival.com and we will see you very soon in Brooklyn. Yes. All right. Can't waste any more time. Let's do this. Because this is very rare. My guests today, they are legends, without doubt comedic legends at the top. And they're also my personal heroes. And I'm so thrilled they're on the show today. They star in the hit Hulu series, Only Murders in the Building. I am beyond thrilled. There aren't words. Just so happy they're here. Steve Martin and Martin Short, welcome. Gentlemen, it's a rare honor to have you both here. Oh, thank you, Conan. In the same room. I'll tell you one thing. It's rare to be here. It is. I left out the word honor, but. It's just an oversight. Just before we started recording, Marty, you verbally assaulted me. No, no, no, no. I said it with love that to me when I see you, you look like someone freeze dried Prince Harry. That's all I said. My staff looks forward to any time that Marty. Pardon me? I have a staff. Wow. Jeez. What kind of podcast is this? It's very loop. It gets smaller every year. But no, fans of my show. And yes, there are fans of the work that I've done in the past. Let's not have any mock surprise about that. But they they have put together a mashup of of Marty coming on the show and ripping me apart. And it is wildly popular. Oh, really? Oh, yes, it is. It is wildly popular and it delights my writers to the point where the last time we were wrapping up the late night show, an epic 28 year run. Thank you. I'm driving to one of the last episodes that Marty's going to do and he did a extremely funny bit on it. And I'm driving to the theater. I looked down and I realized I'm doing something I rarely do, which is wear shorts. And immediately I thought I'm driving towards the Largo Theater and I thought, fuck, Marty, who's on today? Marty's on today. And I knew that he would destroy me. And sure enough, you come in and hello, hello, everybody. And then I see those two eyes dart over and they see my freckled legs there. And it began and it began and it was well, it was quite a sight. It was absolutely a terrifying sight. And you couldn't because normally you can't see where the stilts are attached, but you could. You could that day. The shorts revealed way too much. Oh, and they were short shorts. Yeah. Oh, 1970s. Yeah, Joey Heatherton. Like you were entertaining the troops. But the writers were so, so happy. And then, of course, you're the line that just you said it on late night and it it's lived forever, which is well, you'll do it better than I. But it was Conan. Whatever you're doing to your face, I say 20 percent more and then stop, which is mean in nine different love letter. It's a combo of energy. I love it's also done with care. Yes. You're worried about me. Yeah. A little more, about 20 percent more. Now I feel like I have to put you down and I've got nothing. No, you don't. You don't because you're Steve. Oh, help. Lime. Well, I don't want to embarrass either of you, so I won't mention that you are just two of my absolute comedy heroes. I'm sure you hear that kind of thing all the time and it bores you. But one of the pleasures of my life, and I'm not kidding, was when you asked me to do a cameo in your show, your live show, Seizures Palace in Las Vegas. I was outside my body getting to be on a stage with you guys. It made me so happy, so legitimately, sincerely happy. You killed. I remember he did kill. I mean, we learned a lesson. You showed up with writers. One writer. I can't afford to. I showed up with my. Well, you're a writer. Yeah, oh, that's true. Yeah, that's true. Well, I suppose I am. No, I and Matt, he's Matt O'Brien, no relation, but I only hire O'Brien's and he idolizes you both as well. And he was just in heaven. And then there was but I thought, yeah, come along with me and help me tweak a few things. I really wanted it to be better than what I could. It was. It was inspiring. And we've had people show up with with nothing. No writers. And they did way better, by the way. And then I heard you guys later bumped into Letterman and he was like, Conan brought a writer. No, no, because Dave did it as well. Yeah. Yeah. In Texas, the line you're sitting off stage with Dave and he looked what was it? You were sitting off stage waiting for him to come on. They look kind of morose. This sounds like Dave so far. I can't remember. Yeah, that was I remember he was well, he was he had they edit, by the way. He had no, no, no, no, no. He had. Oh, not at all. No. An editor costs money as well. Everything is in. No, but it was fantastic. It was. But I remember you were saying that Dave was sort of he had been off the air for just a little bit. And then, of course, he always does the thing where he's horrified that he if I go on stage, it'll just be awful. Yeah. And I'm like, you're David Letterman. What do you you know? But he's done it. And of course, the place goes nuts. Yes. And then and then afterwards, he still has a negative feeling about it. Even though he killed. Yeah. But he had only been off a few. I think this was like in June and he'd left six weeks before. Right. Exactly. Exactly. But he is his personality is always you know, he came by and which meant a lot to me, did a cameo on late night, which was his old studio. And he came by. And of course, his attitude was, well, they're just going to hate me. Well, there's how will they know who I am? That's right. Will you say my name before I come out? There's a self-defense mechanism and being overly paranoid. And then when you get a little cheer, when you come out and you go, oh, I was wrong. Yes. Yes. I'm familiar with that. Except with Marty. Yeah, I think with me. Yes, I think and I think it's kept me out of the big money. Not having that attitude of just kind of going, oh, you don't like me? Well, you know what? I don't like you either. But good night. Yeah. It is a little. He does have that attitude. I'm this insecure, shaking one. And he says, I don't give a fuck. Right. They're going to love me. Well, if they don't, guess what? If I had dinner with them, I'd be bored. That's how I. Oh, yeah. Well, often that was your opening line, though. It was. And I didn't know why it didn't play. Who are you people? No one's bathed, obviously. Good night. Where's my big money? Why didn't I get the big money? Why don't they like me? They didn't never hire me again. I got to see your show, and I was so impressed with how you guys worked it out. And even though you both knew the show so well, you had a rehearsal, and you were still working so hard to make sure that it went perfectly at rehearsal. And I thought, this is there are no accidents. Like, people that are good, in my opinion, they're yes, there is talented. There is talent, but then there's just this just mad desire to get it perfectly right. And it never goes away. Well, I always think that that. By the way, I'm here, too. Go ahead. Oh, did you just sneak into this chair? I did. But I'm always amazed that. I feel like I should I start raising my hand? Okay, well, go ahead. You say something. No, I don't have to. I had something. I say I think we prepare. I prepare out of fear. Yep. And also love, because when we get a new joke, I'm energized the whole show. I cannot wait to get to this joke. And often they don't work. In fact, here's an example, because I thought I would just say when they don't work, I am like either on stage or in the wings. I go hysterical because he's been so excited all day about this. Go ahead. I had a joke the other night. I thought when I introduced Marty, I thought this is really going to work. Right. And then we're going to analyze why it didn't work afterwards. Yes. But I said, and this man, he's he's done live television. He's been in film and he's done Broadway. And truly he is a master of the toxic workplace environment. And it was just so like, uh huh. Uh huh. And I realized later it's had too many words in it. Yeah. You know, it needed to be more of like a casual throwaway in the middle of our campus. It's also inside toxic. You had to have just read the story about that talk show lady. Oh, you mean be alive? No, no, no. I don't think everyone is following, you know, variety. Everybody knows about a toxic workplace environment. Obviously not. Because you got nothing on the joke. Remember that part? I mean, Conan shorts represent a toxic workplace environment. Absolutely for the crew. Oh, we settled out of court. No, it's just, uh, well, I've I've gone mad trying to just figure out why did one thing work and why did another thing not work? Sometimes something works and you don't know why it's because I don't know in a, on the face of it, whether that's, is that really a funny joke? One time I was doing Letterman and they started to laugh and I didn't know why. You mean the show, right? And they started to laugh and I said to Dave, what are they laughing at? And he said, nothing we're doing. But I think that we all over prepare so that if it doesn't go well, we don't blame ourselves. That's you. That's you. Yeah. I think that's you. But I over prepare out of fear because I shouldn't have any fear at this point. I relate to that. I'm afraid. I'm afraid of the feeling of it not going well is so terrible. I don't want to have that feeling. And yet today you don't seem particularly prepared. Oh, not at all. No, no, no. It was you guys. I thought what are you going to do? You know, this is going to be a mess. No, I've said this many times. One time Steve phoned me up 10 years ago and said, Do you have a moment? I want to run some jokes past you. And I said, what's this for? You said, I have Letterman in a month. And that's why he's martyred. I was just thinking about jokes you stick with and they kind of work, but you like them and then you let them have their life and then you take them out. I was just thinking of one which I discovered because I was looking back through old material. And the joke was in the opening of the show, we used it. I used it in my banjo show, which was, you know, we tried to do a good show for everyone, no matter whether you're seated down here in the VIP Golden Circle or up there, you know, refer to the balcony in the corroded zinc fire pits. It's a little too early for a joke that lengthy, but I just like corroded zinc fire pits. Maybe zinc doesn't corrode and the audience figured that out. You know what happened is the night that the chemist was in town and they were like, you know, actually, No, they just went, what's he talking about? Yeah, I was speaking about preparing. I didn't get a chance to tell you this, Steve, because I guess you have caller ID. But Marty took the call. Yeah, I did. And when you guys co-hosted SNL, I watched that monologue. You mean recently? Yeah. Oh, that's the only time we've co-hosted. Yeah, of all the times. Of all the times. Or was it 40 years ago? It was last season and you guys did this monologue and it was over. And I've worked there. I've seen thousands of SNL monologues over the years. I cut my teeth on that show as a young kid watching TV. And I said, that is the best Saturday Night Live monologue I've ever seen. It was perfect. So you didn't like my other monologues I did? No, those were terrible. Well, whenever you would come out to do a monologue on SNL, you know, everyone knew that was the time to go get a drink. Well, here's what. Use the bathroom. No, yours? But it was perfect. It was absolute perfection. Okay. May I raise my hand? Yes. So that monologue, you know, we worked on it with the writers. We got some things. But we decided we're going to do a bit from our show. So that we'll know we can trust it. Yeah. So afterwards it went well and the ratings were sky high. It was the highest rated show of the year, as far as I know. And I said to Marty, Marty, you know, the monologue went great and the ratings were high. So there's a chance we'll be asked back to host at some other time. And I said, and before you say yes, just remember we worked on that monologue for three years. You guys had this, I know it's part of your show, but God, it's a good idea. The I care about Steve and I care about Marty and it's so much so that I've prepared the eulogy already, you know, that I'm going to give for you. And you each have them on you and you damn it. It's funny. It's one of the funniest things. It's such a great and the minute I hear that, the minute I heard the idea, I was saying, oh, oh, this is a kill zone. Well, the funniest line to me is Steve's opening line. But it goes down. No, no, no, no, no, no, it's time for me to talk. Remember narcissism is just within. No, but I wanted to explain. I have a pre story to that. And then you can say that. First of all, I was going to do your line. So you might as well keep talking. No, no, you do the line. I'm saying that I had this idea that we would do this eulogy, but I couldn't get, I said, I just don't know how it starts. I don't know. There'll be some jokes or something. And then actually a writer sent in and this line. So it'd be me. So you be me speaking. So the lights come down and it says, remembering Marty and Steve's opening line is, gee, not much of a turnout. But it enabled the whole piece because we could get into it with the first laugh. Right. Right. Right. I love it. Occasionally you get someone who thinks, why are they being mean to each other? And that always drives me crazy. The funniest thing to me is when we know we doing our thing and he'll say something, I'll say something and you'll hear somebody in the audience go, whoa. I remember one time being on Conan show and I insulted him a great deal. And then I went to the next I was on. I went to YouTube to see what jokes I'd done. And I read the comments below and people would say, you know, he shouldn't talk Conan that way. If Conan wanted to, he could take him apart. We did a piece. That's a fun person to have dinner with. I know. Why are you making jokes? We had a when I was first doing the late night show, we did a piece where, you know, the most beloved one of the most beloved people at the time was Mary Lou Ratten, the gymnast. And she's, you know, small and cute. And she won all these gold medals and everyone loves her. And we did a pre tape bit where I think Andy says, I'm saying, I think I'm getting the hang of this late night, the hosting thing and goes, Andy goes, you know, you could. Yeah. But the other night I thought you, you were a little off. And I said, I don't know what you're talking about. He cut to a pre tape of me just losing it on Mary Lou Ratten. And I'm screaming at her fully committed. And we showed that audience laughs. I think the next day or the day after that, I go on Stern, Howard Stern. He takes calls and someone calls in. I saw the other night and you your behavior towards Mary Lou Ratten was atrocious. I don't think you're funny. That was awful. The way you spoke to us. I can't believe you didn't recognize my voice. Reminds me of a reminds me of a story. I don't know if these are like older elderly joke stories, but Mike Nichols, you know, was married to is was married to Diane Sawyer. And he was, you know, he's a hilariously funny guy. And he would, he would say things like that, invite him to a party and said, well, I'll have to run by the ball and chain. So he would call Diana's ball and chain as a joke. So then I think it was a Vogue. They said, evidently, Mike Nichols refers to his wife as the ball and chain. You know, it's a negative thing. So he wrote them a letter, which I think they published, but said, I realize that humor to your editors is like a cross to a vampire. Mike once said, Mike once said to me when we were at this party, he said, where are you staying? I said, New York. I said, the Essex House. He said, no, but really. I feel like I was lucky in the people that I got to meet. But then I look at you two and I think you got to meet so many more people. You know, you're younger. Yeah, you're going to meet everybody. I mean, I, I remember sitting when I was 21 years old and I was hired to write for the Smothers Brothers and I was very naive. And now we're all at dinner and Tom and Dick are having telling stories about people. And I'm sitting there going, I have no stories. I can't believe I don't have a story. Right. And I was 21. So you've got to be this age, 180 to have a story. You met General Grant. Oh, my God. What a fun guy he was. But I do think there was that whole. You said Mary Lincoln could be pushy. I mean, I'm not going to tell you. But now even, you know, just just in the there's that clip that I've seen a million times. I think it's you on the Tonight Show with Johnny Carson, Marty. And I think it's Betty Davis sitting next to you. Yes, she was. She had already killed with her three episodes, three segments. Yeah, three. She done the plate bit. Yeah, everything. Yeah, she did. You're making that up. Oh, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no. But you mean it. She did kill. She was. She was great. Yeah. Yeah, she was great. Yeah. But I just think, oh, Johnny Carson is the host of the Tonight Show. And sitting next to you is Betty Davis. That's an era of of show business. And I'd never met Johnny Carson. So it was particularly because I loved Johnny Carson. Yeah, yeah. As we all did. Yeah. So much so that I didn't even do his show for 10 years or eight years or something. When I could have because I thought, oh, I'm too hip. I just do Letterman. But the reality I was scared to. Yeah. Well, and people don't even understand the era then because it's all changed so much. But both of you had this experience where you go on, you'd go on Johnny Carson's Tonight Show and you do your your set. And the next day, everybody had seen it. Yeah, right. And, you know, you could walk through a hotel lobby and Steve would just drive from town from hotel to hotel just to walk through the lobby. Wearing a shirt that said, did you see me on Carson? And but people people I have so many stories that I've heard from comedians where they were not famous. They did well on Carson. And the next day, everybody in the United States is saying great job. Whereas today, it's just a completely different lens. My observation of that is a little different, but it's too long and boring. But I'll tell you one. No, I'd love to hear that. OK, well, I've that's what I believed. You went on Carson and you then the next day you were famous. Right. But I found with myself, you went on Carson next day. Nothing. Then you go on Carson again. And the next day, somebody looks at you like, did I meet you at a party a long time? And then finally, it slowly starts to break through. And finally, on my fifth appearance, I finally got it together. I did a good, good shot. And I went into a store on La Cienega Boulevard and that woman said, were you that boy that was on the Tonight Show last night? And I said, yes, I am. And she said, oh, well, there's always that. There's always that. Yeah. And I remember seeing a clip, Marty, I could tell you're just slightly different. You killed. But you were just I could tell that you're you're not the Marty that's going on my show and you're just going to kick the shit out of me. It's going to be so much fun. You are. You did a very funny thing about spit take. But it was I could tell, like his voice is a little different and you're being you're you're being well behaved. With Carson, with Carson. Yeah, yeah, yeah. I never got you. I don't know. There was a there's a difference between being excited to be on Johnny Carson and then to be slumming it. You know, well, there's certain people I've never overcome my awe. And Johnny Carson was one of them that I always felt a little, you know, I hope I'm pleasing him. Yeah. You know, but they knew they had card games. Yeah, we played cards together. We had dinners. That's a famous card game. People talk about that card game. It was really fun. Yeah. The lesson of that card game is everything changes. I mean, you're having you mean well, you're having poker games with Neil Simon and Carl Reiner and Dan Milnick and, you know, Chevy. And then people die. You know, everything changes. I'm trying to bring up the party here. Hope no, no, but it's and we're all going to die, too. Yeah. Yeah. Never. All right. Well, anyway, great. So shall we we're going to roll. We're going to roll on credits. Let's let's. Hey, what if we just prayed right now? We just do a group prayer. Yeah, I think that'd be very nice. And hold hands. Yeah. Well, I often think about that. It's it's it's almost my the fact that I get to know you guys and talk to you guys at all is oh is feels like I'm linking to this very important. I don't know. What I would say is I think everybody has kind of a disdain for their own era of show business and and and reviers. Well, what we observe and I probably applies to you that younger comedians like, you know, SNL guys that we kind of know or you know them better than I because you're a warm person. But we see that camaraderie among them. Yeah. That we assume the you know, like Don Rickles had, you know, with Frank and. Yeah. But I see that we have camaraderie with people of our generation and I see that we see the younger people helping each other. You know, it's a oh, absolutely. No, I mean, people like Fred Armisen and John Mulaney and Bill Hader are all close, close friends. And you know them. I was they they also have caller ID. I was talking to Fred Armisen once. I mean, it's probably 10 years ago. And he's just hanging around SNL. And he said the latest thing that we this is probably old now. But the latest thing is when you text someone and then the misspellings come up and the different words, you just don't change them. You just send it off like that. But you do that to other comedians. Fred is an interesting guy because I remember we had we were at dinner once and might have been at my house and Fred was there and didn't say he's hilariously funny guy. But that night he didn't say anything. He didn't say a word. And I remember him looking up and down the table and everybody's laughing and joking and he was just observing it all. And he has that almost like, you know, I always heard Peter Sellers at a party was not a fan of him. I think we were all there. Yes, you were there. It was a funny guy's dinner. It was a funny guy's dinner. Steve, I was. Yep. Yeah. Sure. I thought you said funny guys. You were a last minute addition. I was the control group. Polly Shore fell out. I've been so happy for both of you because you've got this crazy smash hit. Only murder's in the building. And I was initially very, very happy for both of you. And I love the show. And then I saw so much signage everywhere I drove in L.A. And then I would even leave L.A. And I would go anywhere and I would see both of your faces. And I would think, you know, that's it. I've no more. No more. I can't keep seeing their. This is too much. This is too much success. I once did an intro for Tom Hanks. He was getting AFI award. And the bit was something like this. I'd say, you know, when I first saw Tom in Splash or on the TV show, it was a bosom. Yeah. Yeah. I said, hey, this guy's good. You know, I wish him luck. And then I and then I saw him in Splash. I go, wow, he's got some real comedy chops. Good for him. That's great. And then I saw him in Philadelphia. I said, Jesus, really emotional actor. He's really, really good. And then I saw him in what's the word movie? Saving Private Ryan. Saving Private Ryan. And I thought, motherfucker. Do you say that in an AFI? I guess you can. I did. Nice. Very nice. I just yeah, I was thrilled, thrilled for both of you. And it's we can see it on your face. Yeah. Yeah. If you ignore the two of you, you're going to be like, oh, I'm going to be like, You can see it on your face. Yeah. Yeah. If you ignore the tears. That actually have blood in them. And you both get to be so funny. We are so lucky to have a hit at this stage of Marty's life. No, we are. It's fantastic. You know, and the show's fun to do. The show's fun to do. We love Selena. We love Selena. We love everybody we work with. You know, you finally get to the point where a lot of people learn earlier. I'm not working with assholes anymore. It's over. Right. It's over. So everybody there is kind and having fun and upbeat and working for the same goal. And then I then you guys announced the cast for the third season and I became enraged. I know. Because I was like, you have a royal flush, but you're adding some more aces to it. You got Merrill Street. Yeah. I'll tell you a story about Merrill Street. Yeah. Really tear a new one. Yeah. Yeah. We were sitting around and we're going to start rehearsing a scene. And our, you know, our head writer is there, John Hoffman. And Merrill says, you know, I just want to say how happy I am that we're all here together and working so hard together. And John said, yeah, I agree. And you said, John, that's her first line. And it happened more than once. There's a scene on stage where she's supposed to be an actress. She's going on stage and she trip. And then the second take, she tripped again. And it was a one. You realize we thought she actually tripped. And we said, shouldn't someone move that wire? And she said, guys, I'm. And she also, she was supposed to do a song with an orchestra and she should start to sing. And she goes, I'm sorry, I can't hear the rhythm. And they said, well, can we? No, that was her. That was her line. And it's just every time we go, when are they going to fix that rhythm thing? I can't hear it. I did a thing. It was for Norm McDonald here in New York. And they had some gathering and I was, I guess, the emcee, for lack of a better word, but I gave the first talk. But I went up on stage and went head over heels fall. People thought it was a praffal, but it was real. And I was, you know, made a joke of it and everybody thought, well, and then moved on and then did my thing. And then I think the second person, yeah, the second person who went up with the third person, they tripped. And I went to, you know, and I said to a stagehand, what's going on? Everyone keeps tripping. Oh, yeah, those stairs have been messed up for a long time. They're not. And he was like, they're not even. Yeah. So everybody trips anyway. No, they still haven't fixed those fucking stairs. Where is that? It was. I don't remember where it was. Oh, thanks. Thanks. That's no help at all. So we can be tripping anywhere. Now we're going to go trip somewhere. And we also have Paul Rudd on our show. I was going to say. He was fantastic. Yeah, and I love that you have this show that everybody agrees is fantastic. Andrea Martin. And you add Paul Rudd. You know, you don't need Paul Rudd at this point. It's making it, it's too much. Yes, and Andrea Martin and Tina Fey. Yes. And Jesse Williams. You know who wasn't asked? Who? Oh, I know who wasn't asked. Conan. Who wasn't asked? Because Conan has beady little eyes. They have no light in them. Wait a second. In the first season, Conan did. Oh, that's Jimmy Fallon. No, no. No. I mean, your name, your name came up. Oh, it came up. Yeah. Oh, good. And you said, you can't light the eyes. No. Just can't light the eyes. He's got those Charles Grodin eyes. You can't light them. They're like a doll's eyes. Yeah. Listen, you're going to figure out a way to work me into this thing. Sure. I think. Hey, with the premises, we're doing a podcast. I don't know what you'll be playing, but I know the title of the episode. Oh, yes. Here we go. The circus has come to town. My favorite thing is getting excited about the nice thing I'm sure you're about to say. Oh, good. What is it, Marty? It's the guy who has no memory of how Martin Short has treated him over 25 years. The absent-minded podcast. I love that. Yeah. Oh, Marty's got something to say about me. Yeah. God, gee, let's have it, Marty. Or also, you can recognize it later that it was an insult. Marty said the nicest thing about me. He says I was a total idiot. Oh. Oh. That's right. You're about a podcast. I have the podcast. Please, that's not me talking. That's podcast magazine. Guest edited by Conan O'Brien. I'm going to be the host. I'm going to be the host. I'm going to be the host. I'm going to be the host. I'm going to be the host. I'm going to be the host. Podcast edited by Conan O'Brien. Yeah, right. But, yeah. I'm sure there's a way to fix me in, to get me into the mix. Absolutely. Yes. We'd be honored. Incredible. You reminded me of a joke. I don't know why. Jokes. We're doing a show next weekend, so these jokes are going through my mind. It was, Marty would talk about me playing the banjo, which always insults, of course. And the joke was, and maybe you use it, he said, and Bluegrass Magazine has recently named Steve the official ambassador of the five-string banjo. It was between him and no one. Well, you have that great joke. It has deliverance. What is that? Oh, yeah. I hope I didn't just ruin it. It's such a great joke. What is it? Touring around with Steve is a lot like the movie Deliverance. It's all fun and games until the banjo's come out. Yeah. You kindly had me to your apartment once. I remember the first time I ever met you. You do? No. Actually, I do. No, I do. All the life went after you and you said, no, that was really fun. I saw you rise up and then fall down. No, you came to our apartment and met you? Or was it? No, no. We had worked together on SNL. I was very shy and I remembered I don't want to get in Steve's. So I was writing things but not approaching you. I was in the background. But then I was chosen for, you know, Lauren said, I think this fellow could host the late night show. It'll be rough for a few years, but he'll eventually get it. I think he could do it. So I'm named Letterman's replacement. And the first thing I do when I come out to LA is Lauren says, and maybe this is a thing he does, but he said, let's take a walk through the flats of Beverly Hills. And people told me later on that Lauren likes to take a walk. And he's taking this walk and he's giving me advice. He's saying, always tip. You're known now. Always tip at least 15 percent or you'll show up in the post. I thought he was going to tell me like, here's the secret. But he was telling me things like that, which was fine. And then he said, let's see if Steve's in. And I didn't know, you know, Steve, he always assumed Steve Croft. And so I... Steve Rossi. Yeah, exactly. So we, he knocks on a door and you answer and you have us into your place. And I was like, this is too much. I've just been put into this situation and I need to navigate this. And now we're dropping in on Steve Martin. And I'll never forget you had just had all the paintings taken down. And I think I just said like, oh, there are no paintings. And you reacted immediately as if you had been robbed. What? Oh my God. And I thought, oh shit, that's funny. That's a perfect reaction to where are your paintings? Yeah. Whenever, whenever in studio, I remembered once every day when then you'd be in the studio at six day rehearsing and the lights would go out because of some situation in the building, Rockefeller Center, some situation, the lights would just go out and Andy would always instantly scream my pearls. Andy who? Andy Richter. Hilarious. Yeah. And. Oh, I got to remember that. But I have to give him credit. Yeah. No, you don't. No, you don't. No, just take it. Andy was fine. I know I'll blow it. My pearls. My pearls. My previews. My pez. My pez. How did you guys decide we're going to start working together as a two-hander act? Why did that come about? And I know it's. I'll tell you what. It's a boring story, so I'm going to give it to you. No, no, no. It was 2011. We were asked to interview each other for it was the closing of the Just For Last Comedy Festival in Chicago. It was May and it was 2011 and we just. What do we have for breakfast? I get. You had scrambled eggs. I had fresh toast. Come on, man. I had syrup. No, and we interviewed each other and that was it. And it went well and we thought we'd do it again. And we just then. Well, the funny part is we were interviewing each other about comedy for a comedy festival. So we could talk about comedy, kind of like we're doing here, but to comedy people, it's kind of interesting. So we thought, hey, let's do that again. So we got a corporate gig or something. And so we're sitting and we're talking about comedy and we're thinking, this doesn't work. And then we started. And Marty had a show he did solo. And I had a show that I did with a band. And so we kind of combined them. But he had material and I had a bunch of songs with funny intros. And when we first when we first started working together, he had everything and I kind of had nothing because I didn't bring the band. I said, well, I got to bring the band. So that's when it started to gel into a show and I can go on. Did you? Yeah, I can go on. Did you ever? It's it's it's first of all, that was great. Yeah, anyway. I was saying I was saying that, no, I think you said it. Really? Yeah. You know, this is what I didn't think I got to the part. Oh, you didn't need to. It reminds me of I made the mistake once of it's and you know it, it's like wearing the shorts. But I knew I I made this terrible mistake of someone had mentioned food and what they eat. And I said, well, you know what I do now is I eat two meals a day. I have like a shake at 11 and I put a lot of spinach in it and then I try to eat dinner early, like at five. And then I as I'm finishing saying it, I see Marty just staring at me the way the way a shark looks like it looks at a canned ham that fell into the ocean. And he looks at me and he said, you know, when other people discuss the details of their diet, it's boring, but not you. And of course, there were some writers standing around who were like, yes, they love when the boss is attacked. That was also just me realizing, I, why did I get into this? Why did I lather myself up with bacon grease and then climb into this piranha piranha pool? Why did I, why did I do that? My wife is a very wise about about talking about what you eat. She said, you're allowed to talk about what you do eat, but you're not allowed to talk about what you eat. Very good. I like that. Yeah, I like that. I mean, if this podcast, if we go away with one thing, that's it. It's like with me beats. I don't beat beats. One thing I was curious about is when you come up with a great new insult for the other, do you ever try it out in the moment on stage or do you ever try to surprise each other? Not really, but sometimes we've come up with things. And then we'll go right to the prompter afterwards and say, oh, right. That, you know, we'll remember what, what prompter that if we had a prompter, let's say if we had a prompter. Yeah. So you're saying if we had a prompter and we came up with a joke, we would go over and talk. I mean, now we just go to our own minds and lock it in. Well, we were talking earlier about people you've met and I know Steve that you got to meet or kind of meet Elvis. I did. And I've told the story a million times, so I don't know if it's worthwhile. Well, I just love it. So well, I was, it was 1971 and I was opening for Anne Margaret at the Hilton in Las Vegas, which is no longer there for good reason. It's like they tore it down the following day. The worst comedy room. Yeah. There's a ceiling that's like 80 feet high. So laughs, the laughter rose above the audience's head about two feet and stopped. But anyway, and Elvis was opening the next weekend and he knew Anne Margaret. So now it's after the show. I know Elvis is going to come back and say hello to Anne Margaret. And so I leave my dressing room door open and I did my act. It's 1971. So the act is not fully formed. You know, it's got a weirdness to it. And so Elvis walked by and he saw me and he stopped and he said, son, you have an oblique sense of humor. And then he came in and now we're talking. I'm talking with him and I know you don't know what to say. My manager was there who knew all about son records. So we can talk about that. And then there was a pause in the conversation. Oh, first of all, but this is the part I loved. Elvis has a guy who comes up to him to get him out of conversation. So Elvis, I'm sorry, we have to go. And in this case, he comes up as sorry, we have to go. And Elvis said, it's okay. I've been blessed. So then we're talking. Then we run out of conversation. Then he said, want to see my guns? Jesus. And we said, sure. And he was a, he was a gun. He liked artful guns. He was like an engraved thing. And he was very cautious. They were loaded. And so he took out a six shooter and he opened it up and dumped all the bullets in his hand. And before he handed me the gun to look at it and I was looking at it, I'm marveling at it. Then he took out another gun, did the same thing, dumped out the bullets, handed it to me. And then they pulled out from his sock, a derringer and then opened that up, dumped out the bullets, handed it to me. And then I'm, I'm holding three guns and he's holding 16 bullets. And I'm thinking, where is Elvis's guy? Yeah. To get me out of this. Do you remember what he was wearing? Yes. All white. It was Elvis Slim and he had the all white and he wore that big buckle that the Hilton had given him to him for biggest show ever in the history of the world. Right. But he was very sweet and very nice. Yeah. And that comes across when you look at the documents. Well, that's a famous face though, Elvis Presley. Yeah. Jesus. Well, also the reason I wanted to, because I know that you met Frank Sinatra. Yes. And who's your absolute idol. But it was one of those situations where you, because I remember you told me this once you were at a bar and it... No, I was at George Slaughter's house. Oh, George Slaughter's house. OK. It was after a Sinatra Shirley MacLean concert at the Greek Theater. And we all went back to his house and Diana Shore was there. She was a big fan of SCTV. Oh, great. She's going on about it. And I'm thrilled to meet Diana Shore. She said, Hey, do you want to meet Frank? I said, Sure, sure. And I went up to him. Now, this next part Paul Schaefer maintains, I've made up because he said he didn't he didn't speak like out of guys and dolls. And I said, well, he did, though. He said, I said, Mr. Sinatra, Martin Shor, and he said, I know well of you and your models. I know well of you. Let's not leave that. Yeah, I know well of you. That's not guys and models. Now he didn't. Yeah. Anyway, then then he said, would you like a drink? And I said, sure. He said, what are you drinking? I said, anything you're drinking, Frank. And so he turned to the bar and said, Jack Daniels. And I had done don't drink scotch. So the bartender said straight up or on the rocks. And I was nervous. I thought he said straight up or relaxed. And I said, I'll have it relaxed. And he Frank said, he said straight up or on the rocks. I'd known Frank 15 seconds and I pissed him off. And I started to. Yeah, Julie beat the crap out of this guy. Are you a moron? So I could Frank. Now, it was when you meet those people, it is surreal. But, you know, I used to have that with Mike Nichols and I knew him for 20 years that I was still in awe. Like you talk about Carson. You're in awe of being in their presence. I had I mean, this is someone he both have met a billion times. But Lauren once asked me to go to a he said, would you like to go to a Yankee game with me? And I said, yeah, I'd love to do that. And there was a playoff game on the Red Sox. And so we're I get in the car and he says, we're picking up. I think he said we're picking up a friend. I didn't hear who he said we were picking up. But he puts, you know, so I sat up front. So there was room in the back for Lauren and his friend. I set up with the driver and we start driving up and then we start to slow down. And there's someone leaning against the lamppost in like a very cinematic way. And we slow down. And it's Jack Nicholson. Wow. And Jack gets in the back seat. And he goes in, Lauren goes in, he's like, how you doing, Lauren? He says, this is our corner. And he says, it's very nice. Just said, nice to see you. And I said, oh, so nice to see you, sir. You know, and then we drive, we see the game. And my experience was if you want to be anonymous, walk with Jack Nicholson, because I am my life is I'm six, four, I have this pastry on my head. I am immediately like me or dislike me. Everybody knows it's me. And I walked down the street and everybody knows it's me. And suddenly nobody saw me because I'm walking three feet behind Jack Nicholson. But then the real treat of the night. So we chatted a little bit about a few things and didn't talk much. He mostly spoke with Lauren. And then he drops me off at the end of the night. And I think, well, this has been great. And I get out of the car first, cause I'm just gonna walk. We dropped Jack Nicholson off and he gets out of the car. And I just said, it was a real honor to meet you, you know, Jack. And he said, my boy is crazy about you. And I said, he said, I'll never forget. He said, my boy, we're just standing there and Lauren's still in the car. And he goes, my boy is crazy about you. Every morning it's Conan this and Conan that. It's driving me fucking crazy. I had no idea that even, but I just knew that I was an irritant in his life. And that made me very happy, very happy indeed. I'm just going back of it cause I kept remembering this great joke. And I think it was a Shecky Green's joke about Frank. And it might've been Don Rickles, but I think it was Shecky Green. He said, and Frank's in the audience. He said, Frank saved my life one night. You know this joke? No. He saved my life one night. I was in an alley and I was getting beat up by some guys. And Frank said, that's enough. And then there's the famous Rickles joke, which I'm, it's story, which I'm sure is true, which is Rickles asking Frank. He's like, I'm meeting, I'm dating this young girl. Could you, this young woman, it would really mean so much if you just came through the lobby and walked through the restaurant and said hello to me in front of her. That would really help me seal the deal. And so Frank Sinatra comes through and walks up to Rickles and his date and says, hey Don, I just want you to, Frank, please, I'm eating. And Frank leaves the restaurant. And then about 30 seconds later, two guys come in and pick up Rickles, carry him out of the restaurant and dump him in the fountain. Is that last part true? It was a fountain. It was a fountain of acid. That's the part that's less funny. Frank had it constructed. They killed Don Rickles. Yeah, they did. Yeah, he never lived past 1961. Guys, I'm gonna let you go because you have, it's been made clear. Wouldn't you like to get some part of this interview that's usable? What, you're a young lad. You've listened to some of my, I'm gonna say this is my favorite episode maybe ever. This is one of my favorite. Certainly mine. This is a spectacular episode. I'm just going back over why we're doing it. It's because of your admiration for me and my work. Well, that's true. This is a very, very famous podcast. I understand that. Yeah. I know that. And so we should be honored to be part of it. I am. You couldn't say it with a straight face. Hey, after this, let's you and me go and cash our checks. Let's do it. But we need a big bank. I mean, not every bank. I have ideas. Maybe we'll get some cash and some just a cashier's check. Yeah. And I have a servant with me. He could carry the bullion. You know, you guys have always kept in touch. That's what I like about you. You never got in the bubble. You're out there. Oh, I'm of the people. Always. Kept in touch with whom? What do you mean? You're just in touch with the people. Oh, right. You're going to the bank. You'll probably have to stop and get a wheelbarrow. But you do it in a humble way. Would you say that with success, you changed? I'm pausing. You can't help but change. But I'd say I have changed for the better with success. That's what I think. You probably disagree. Can't wait to phone others. Did you know Steve? I met him on Three Amigos, 85 July. Yeah. Jesus. And then we became great friends. And then you make that decision of whether you're going to just have that two month experience of making a movie and never see someone again or not. And I think we both chose to keep hanging. Were you guys, it's just interesting you bring up Three Amigos, because you make that movie, it came out and it did what it did, but then it goes on. And I don't know when it happened, but within maybe 10 years of it coming out, there's this whole generation that seizes that movie and says, this is one of our favorite movies. And it has grown since then in a way that I think is well-deserved, but it's kind of fascinating to me. Were you aware of that happening? That's what happens with a lot of my movies, except for the 10 year part where they like it. Well, I've always found that you never know if a movie is a hit or success till 10 years goes by. Because some movies are big hits when they come out and then you never hear of them again. And then some movies tend to grow. I was surprised. In fact, we got a call from a magazine in London and they said, it was a film magazine. They said, we want to put you, Marty and Chevy on the cover. We said, why? They said, well, it's the 25th anniversary of Three Amigos. I said, you care? And that's when I started noting that there was some kind of thing happening with it. Yeah, it's got this whole other life. And I can't tell you how many times I've seen, they'll ask various rock musicians, artists, athletes, just anyone, politicians list favorite movies. And then Three Amigos keeps popping up in there, which is really great. Well, Steve wrote it. Well, with Lorne Michaels and Randy Newman. That's right. But you said you wrote the funniest parts. I will, yeah. Actually, Randy Newman wrote my favorite joke and the whole thing. And it's when El Guapo, it's his birthday and all his men are celebrating and he opens a package and he goes, it's a sweater. I love the canteen joke so much that you're both, you know, the three of you are running out of water. Oh, canteen. The canteen and just there's barely enough. And then just luxuriating. I like Spong. A little bit of a lip-spitting out. Yeah, lip balm is so fantastic. My favorite joke is that we go into a saloon that's filled with bad guys. And we're all in our spangly outfits. And I go up to the bartender and say, excuse me, we're not Mexicans. We're from out of town. Was it fun to make? Yeah. It was. We were actually in Arizona and on locations and building these beautiful sets. It's just one of those, because sometimes I've known when you're having a blast making something, I sometimes get worried. If you're having a really good time making something that this means it won't be good. One of my favorite lines, I just somebody reminded me of it too at the end. The very end, I go up to Patrice Martinez who's a beautiful actress who played Carmen. She passed away, unfortunately. And it's supposed to be something between us. And I go up and we're about to ride off and I say to her, I'll be back one day. And she says, why? Well guys, what's the plan for the rest of the day? I'm sure you've blocked out a whole chunk of time with me. Well, I've got to do my 5BX workout. Incredible. I was gonna say you look amazing. Thank you. And today it's AB day, so I'm gonna work on the abs. And that's most of the day. Hard for me for you, when you say that, for me not to think of your role on Arrested Development where you're the bullet. Shoot me. Shoot me. And my son adores that show. So the times that you've been around, as much as you've done, you never know what's gonna get people. And he's seen and really liked your other work, but you as the bullet. The bullet. Whatever, isn't that your- I was a guy, I was so old, I was their uncle, that my legs didn't work and I had to be carried around by a big strong man. And we kept adding jokes and at one point I said, to the nuts. And they put me down to Jason Bateman's testicles and I went, bridge mix, bridge mix. And they put me on a table to eat nuts. But it's just so nice that you do these different things, you never know what's going to catch with who. And then, my son, who now is 17, but at the time he was seeing it, he was like 12. And he was like, well, this is the funniest thing I've ever seen. And I'm like, well, he's coming over tonight. And it's just, it's lovely. It's very nice. Gentlemen. Okay. Thank you, Conan. I wanna let you go. Thank you very much. Think about the cameo. Oh yeah, of course. I will play a small part. I have a tendency to shoot the lens. I look right into the lens. Wow, good. Yeah. What would it be? It's funny, cause Shrek-like monster crushes townspeople and then is arrested for murder. Something like that. But I like- Why? Why do I goad you? Why do I ask for more? I like Conan's approach, cause most actors try not to look into the lens. Yes. I would have a small role where I'm literally carrying crab cakes in the background at the nice west side apartment and I stop and I turn and look right into the lens and freeze. And that's what we're gonna do. Oh, Steve's taking a call. No, no. Oh, no. I'm looking at my plans for the rest of the day cause you asked and then I realized I have none. Okay. Well, perfect. Okay. Thanks a lot. Thank you very much. Guys, you both mean the world to me. And this is like, I don't know. We will never top this episode. And I know that you are being self-effacing and saying we've killed time is an absolute joy. Absolutely. Thank you. I bow to both of you. I love you. I bow to you. And obviously we both been influences, but which one a little bit more? Oh me. Oh, you can't see everybody. He's looking at me. Thanks Conan. Anyway, Steve, your car's here. Guys, go in peace. Thanks a lot. Oh, by the way, you forced this on us. Hi, my name is Steve Martin. And I feel blank about being, let's hear you do it spontaneously, replace Conan O'Brien's name with mine. You could do another version and they could put it in. That was fantastic. I thought I did do a good version. You did great, John. Oh, then there you go. I'm challenging him. You go, suddenly we have to learn lines. It's not learning a line. It could be, you know. You have to write. You don't write. You could have a sincere emotion and say it in a moment. Oh, I never thought of that. Yeah, I could say, my name is Conan O'Brien and I feel overwhelmed, overwhelmed with gratitude that Steve Martin and Martin Short even know my name. And that's, you know, there I go. Okay, it doesn't have to be, you know, I didn't have a writer work on that. So you wanted us to compliment you. Yes. Oh. We didn't think of that. Okay, thanks a lot. Conan O'Brien needs a friend. With Conan O'Brien, Sonam O'Sessian and Matt Gourley. Produced by me, Matt Gourley. Executive produced by Adam Sachs, Nick Leal and Jeff Ross at Team Coco and Colin Anderson and Cody Fisher at Earwolf. Theme song by The White Stripes. Incidental music by Jimmy Vivino. Take it away, Jimmy. Our supervising producer is Aaron Blair and our associate talent producer is Jennifer Samples. Engineering by Eduardo Perez. Additional production support by Mars Melnick. Talent booking by Paula Davis, Gina Battista and Brit Kahn. You can rate and review this show on Apple podcasts and you might find your review read on a future episode. Got a question for Conan? Call the Team Coco hotline at 323-451-2821 and leave a message. It too could be featured on a future episode. And if you haven't already, please subscribe to Conan O'Brien Needs a Friend on Apple podcasts, Stitcher or wherever fine podcasts are downloaded."}}, "transcribed_data": {"podcast_title": "Conan O’Brien Needs A Friend", "episode_title": "Steve Martin and Martin Short", "episode_image": "https://image.simplecastcdn.com/images/d139afc2-e8b0-4ec2-bc74-fdc3c88f649a/d59c963f-c9dc-41d8-9005-369e80634b3b/3000x3000/screen-shot-2023-05-01-at-12-14-01-pm.jpg?aid=rss_feed", "episode_transcript": " Hi, my name is Martin Short and I feel duped about being Conan O'Brien's friend. Hi, my name is Steve Martin and I feel sad about being Conan O'Brien's only friend. Hey there, welcome to Conan O'Brien Needs a Friend. And no, Sona was not just punching me before she fled back to her chair. You swatted her elbow first. Yeah, you did. You scooted over in your chair. No, I was trying to help her. She seemed unsteady and I would never swat at anyone. She seemed unsteady and I was helping her adjust herself in her seat. Oh, okay. I didn't realize. I think you were just angry. I was talking about how many cups you had. I didn't realize. There was a narc over here. Yeah, that's right. Get ready. This guy's working for jobs. Listen, there were some shenanigans just before the podcast started. Maybe I took a swing at Sona's shoulder, slightly missed it, and then she needed to retaliate. And then of course, teacher, teacher, I saw what happened from Mr. Matt Gourley over here. I did, and I tell the truth. I appreciate it, Matt. You're a truth teller. Even though no one asked you. You're my big geek baby. What the fuck was that? Sometimes I start speaking before I know where I'm headed. Wait a minute, sometimes. That is 97% of the time. Here are the three things that went through my head Robocop style. Like I had a readout of options. It was my big baby, my big daddy, and my big gay boy. I'm none of those things. You're none of those things. I'm not saying this is like good or right or healthy. I have a problem. I like that this seconds ago, I was taking a swing at Sona and she was returning fire by swatting at me. And then you end up the villain. Am I the villain or am I just the misunderstood genius? I appreciate it. I'm looking it up right now and no, villain and fool. Okay, big giggy. Man, you're just the worst. Well, it's faulty. The wiring's off, but someday it'll get there. I used to love when people would get really angry and try to yell at someone and swear but not be able to pull it off. And I knew people that would do that. I know someone in particular, I won't name them, but they'd be like... Shit, sir. Fuckler. And they just couldn't put it together. That's me. I'll damn you, shit man. What? Yeah. It's just so easy to curse though. Let's see it. Go ahead, genius. You fucking piece of shit, dick fuck. You're just a big sandpaper baby who's got little feet and don't even know who cheek people are. That's a good one. And the fact that you don't know who cheek people are is your worst quality. Yeah. Go buy some lips, you reach around. What? Okay. You know what? Now you're on fire. Okay. You started out, I mean, good Lord. You didn't have it earlier. Yeah, now it works. Yeah, now it's fantastic. Yeah. But Sona, you are very good. I've seen Sona get mad many times. That's amazing. And often, I have to say, not at me, just at random people. And you are terrific at swearing. I am great. I am really good at it. You are concise. Yes. They explode out of your face, these curses. Is this the way you grew up? No. My mom would be horrified that I'd be cursing. They're nice people. And I think that's why I got good at it. What do you mean? Because my mom didn't want me to curse. And so I was like, well, I'm going to show you, I'm going to curse the best out of anybody. Curse of blue streak. Yeah. Well, good for you. Thank you so much. You overcame your obstacles. My dad, no joke, cursed a lot. And I'm wondering why that's why I'm bad at cursing because I never got to exercise that muscle. My father, I have a specific memory, which is my father, you know, there wasn't much swearing in our house. Occasionally, you know. What? There wasn't. There wasn't much swearing in our house. Occasionally. You're Irish. Okay. That's nice. Wait, I'm being serious. That's terrific. You guys are good at cursing. What are you talking about? You keep youth Irish. No, the Irish curse means we have small penises. Not the Irish curse. That makes more sense. Yeah, please. That's the Irish curse. Okay. All right. I mean, I've been looking for mine for years. Oh, man. I mean, give me a map. Hell! What were you going to say? No, we're going to stick on this theme now. I've used ways to find it. Hell! Okay. No, we could go somewhere else. It's fine. Solid C+. Anyway... You dropped your penis. It's at the bottom of that tequila bottle. So anyway, no, I grew up in a very proper house. My mother really didn't want, you know, swearing, and there wasn't a lot of swearing. Really none at all. And then I'll never forget, I had my room was up in the attic. I lived up there with my brother Neil and my sister Kate. And we were, there were so many of us, they said, okay, some of you were going up to the attic and it was pretty clear who was headed up there. So I'm at the end of the attic. Now what I remember is... You're saying you didn't draw straws. Oh, no, no, we didn't draw straws. It was you three, you three up into the attic now. And we'll send a plate of food and you can figure out who gets it. There was plenty of space. A lot of empty bedrooms. Tons of rooms. Tons of rooms. Boarding house, basically. We had a car on a revolving display on the second floor. That's how much extra room we had. 1975 Buick Skylark. There was just so much extra room. But anyway, so I'm up there and I'm in my bedroom and it's dark out. And all I remember is my father was coming up and he was trying to, he was trying to find something and it was very late. And my sister Kate was not in her room at the time. I think they were doing some work in that room. And all I know is that there was a bunch of junk in there, including a big bed frame that was jutting out at a weird angle. And so I'm in my bed and I'm just about to fall asleep and my closet connected to my sister's closet. Like you could walk from one right through to the other. What? So there was, yeah, it was just a way for my sister to escape or for me to escape. It's the kind of house we lived in. Anyway, but I'm not lying. They did connect. It was just an opening and you could walk right into the other room. And so it's dark out and I'm just kind of falling asleep and my father comes up the stairs and he's looking for something in Kate's room. But it's dark. And all of a sudden I hear this unmistakable sound of his shin hitting the iron bed frame that's jutting out in the darkness. And I heard, Every single, every single swear you could ever imagine. Oh, you're censoring yourself, but he didn't. Well, I like it's funnier to me that it's just it's I remember it. It was so jarring and so traumatic. I remember it as That's how it's coming out. And I heard every swear that's ever been invented from this like, you know, very brilliant scientist. You learned it all in one fell swoop. Oh, in one. I mean, I had a recorder running and I've had them all. It's like, yep, he got every single one. And I remember just pulling the blanket over my head. Oh, my God. Did you did he have like colloquial swears? Because my dad, for some reason, had his own like jazz swear lingo where he would go, God damn it anyway. And God damn it all. Make sure you damn it every single way you can and all of it. And he would like, what does God damn it anyway mean? He would put it anyway after God damn it just completely takes the power away to God damn it anyway. It takes the power away. He put up the Christmas tree and it wouldn't work. And I love this man and I love him for this, but he'd be like, God damn it anyway. God damn it all. And these were just like, I don't know if they were like passed down through the family or what. But I now will stub a toe or something. And like I have to stop myself from going, God damn it anyway. I think that's why I go to like you're a cheek people or a tooth lover. I don't know. I just want to get away from I want to stop the cycle. We had a lot of ethnic curse words in our like a lot of Turkish ones and Armenian ones. Yeah. Well, one of my this is bad for people who actually know what I'm saying. They're bad. But like one was like, Baba Jananasiçim or, you know, Pezivekisholisheg. Things like that. Those are the things my dad said when he hit his shin. He was Turkish. My dad's Turkish. Oh my God. He said, Bada Habeshabeshi. One was I'll shit on your dad's soul. And my dad would say that to people. And sometimes like, you know, he'd do it as a throwaway. I'll shit on your dad's soul. That is fantastic. Oh, Turkey. You devils. What was the other one? One's like Pezivek is like a like a pimp or siktir is like fuck it or, you know, isholisheg is like a son of a donkey. You know, it's fine. I mean, whatever. But I'll shit on your dad's soul. Yeah, that should they should win the Olympics. Yeah, because that's graphic and poetic. Yeah. It's like figurative. It is also very gross. And I think of the show the soul as being ethereal like shit would drop through it. But no, this is proof that the soul has some viscosity. But what if the only way you could materialize a soul is to shit on it and you find like, you know, when you pour paint on the invisible man. Right. If you shit on the soul, you can trap a soul. Right. Yeah. Check your toilet bowl next time. Make sure there's nobody's soul in there. Oh, no, I just flushed Grandma. Oh, man. Well, she's going to a better place. Don't shit on Grandma's soul. She's going to a better place. The water solidization plant. Yeah. In our house, it was all Jesus, Mary and Joseph. I mean, it was all Catholic stuff. And so it didn't really it was just more of a prayer. More of a litany. Your grandma didn't swear? Oh, my God. No. My grandma, Mottie, who lived with us. I didn't I don't know why I didn't think Irish people are just they swear. No, you're thinking of pirates. No, no, my Irish grandmother was the most she was a very well educated school teacher and she lived with us and she would say, Oh, Moses. Oh, Moses. That was the and she would say it all the time. Like, what's wrong, Mottie? Nothing. Oh, Moses. Oh, God. That's like a haunted house like Flores para los Muertos. You just hear that in the night. Well, she loved bad news, too. She loved it. Oh, Mottie, something terrible happened. Oh, tell me, tell me. And she would love because the Irish love bad news. So once it was her birthday. And so I said, Hey, Mottie, happy birthday. And I jumped off the top steps of our stairway and pretended to get hurt because I thought that would make her happy. Happy birthday. And I jumped. And then I was like, Did you like that? You thought it was hurt for a second. Oh, Moses. Thank you. Thank you. Anyway, this was very educational, I think. So I will never shit on your soul. Oh, that's really nice. Wait, thinking. No, I won't. Oh, OK. OK, everybody, settle down. Settle down. Please. I want you to settle down. Sorry. I've got some exciting news. And when do I have exciting news? It's never happened. Conan O'Brien Needs a Friend is coming to you live at the Brooklyn Academy of Music for two shows, November 7th, November 8th, as part of the New York Comedy Festival. Presale tickets will be available starting this Wednesday, August 23rd at 11 a.m. That's Eastern Time with the code NYCF before the general on sale, which is Friday, August 25th at 11 a.m. ET. I'm very excited about this. I'm very excited about this. To get your tickets and all information that you need, head to nycomedyfestival.com and we will see you very soon in Brooklyn. Yes. All right. Can't waste any more time. Let's do this. Because this is very rare. My guests today, they are legends, without doubt comedic legends at the top. And they're also my personal heroes. And I'm so thrilled they're on the show today. They star in the hit Hulu series, Only Murders in the Building. I am beyond thrilled. There aren't words. Just so happy they're here. Steve Martin and Martin Short, welcome. Gentlemen, it's a rare honor to have you both here. Oh, thank you, Conan. In the same room. I'll tell you one thing. It's rare to be here. It is. I left out the word honor, but. It's just an oversight. Just before we started recording, Marty, you verbally assaulted me. No, no, no, no. I said it with love that to me when I see you, you look like someone freeze dried Prince Harry. That's all I said. My staff looks forward to any time that Marty. Pardon me? I have a staff. Wow. Jeez. What kind of podcast is this? It's very loop. It gets smaller every year. But no, fans of my show. And yes, there are fans of the work that I've done in the past. Let's not have any mock surprise about that. But they they have put together a mashup of of Marty coming on the show and ripping me apart. And it is wildly popular. Oh, really? Oh, yes, it is. It is wildly popular and it delights my writers to the point where the last time we were wrapping up the late night show, an epic 28 year run. Thank you. I'm driving to one of the last episodes that Marty's going to do and he did a extremely funny bit on it. And I'm driving to the theater. I looked down and I realized I'm doing something I rarely do, which is wear shorts. And immediately I thought I'm driving towards the Largo Theater and I thought, fuck, Marty, who's on today? Marty's on today. And I knew that he would destroy me. And sure enough, you come in and hello, hello, everybody. And then I see those two eyes dart over and they see my freckled legs there. And it began and it began and it was well, it was quite a sight. It was absolutely a terrifying sight. And you couldn't because normally you can't see where the stilts are attached, but you could. You could that day. The shorts revealed way too much. Oh, and they were short shorts. Yeah. Oh, 1970s. Yeah, Joey Heatherton. Like you were entertaining the troops. But the writers were so, so happy. And then, of course, you're the line that just you said it on late night and it it's lived forever, which is well, you'll do it better than I. But it was Conan. Whatever you're doing to your face, I say 20 percent more and then stop, which is mean in nine different love letter. It's a combo of energy. I love it's also done with care. Yes. You're worried about me. Yeah. A little more, about 20 percent more. Now I feel like I have to put you down and I've got nothing. No, you don't. You don't because you're Steve. Oh, help. Lime. Well, I don't want to embarrass either of you, so I won't mention that you are just two of my absolute comedy heroes. I'm sure you hear that kind of thing all the time and it bores you. But one of the pleasures of my life, and I'm not kidding, was when you asked me to do a cameo in your show, your live show, Seizures Palace in Las Vegas. I was outside my body getting to be on a stage with you guys. It made me so happy, so legitimately, sincerely happy. You killed. I remember he did kill. I mean, we learned a lesson. You showed up with writers. One writer. I can't afford to. I showed up with my. Well, you're a writer. Yeah, oh, that's true. Yeah, that's true. Well, I suppose I am. No, I and Matt, he's Matt O'Brien, no relation, but I only hire O'Brien's and he idolizes you both as well. And he was just in heaven. And then there was but I thought, yeah, come along with me and help me tweak a few things. I really wanted it to be better than what I could. It was. It was inspiring. And we've had people show up with with nothing. No writers. And they did way better, by the way. And then I heard you guys later bumped into Letterman and he was like, Conan brought a writer. No, no, because Dave did it as well. Yeah. Yeah. In Texas, the line you're sitting off stage with Dave and he looked what was it? You were sitting off stage waiting for him to come on. They look kind of morose. This sounds like Dave so far. I can't remember. Yeah, that was I remember he was well, he was he had they edit, by the way. He had no, no, no, no, no. He had. Oh, not at all. No. An editor costs money as well. Everything is in. No, but it was fantastic. It was. But I remember you were saying that Dave was sort of he had been off the air for just a little bit. And then, of course, he always does the thing where he's horrified that he if I go on stage, it'll just be awful. Yeah. And I'm like, you're David Letterman. What do you you know? But he's done it. And of course, the place goes nuts. Yes. And then and then afterwards, he still has a negative feeling about it. Even though he killed. Yeah. But he had only been off a few. I think this was like in June and he'd left six weeks before. Right. Exactly. Exactly. But he is his personality is always you know, he came by and which meant a lot to me, did a cameo on late night, which was his old studio. And he came by. And of course, his attitude was, well, they're just going to hate me. Well, there's how will they know who I am? That's right. Will you say my name before I come out? There's a self-defense mechanism and being overly paranoid. And then when you get a little cheer, when you come out and you go, oh, I was wrong. Yes. Yes. I'm familiar with that. Except with Marty. Yeah, I think with me. Yes, I think and I think it's kept me out of the big money. Not having that attitude of just kind of going, oh, you don't like me? Well, you know what? I don't like you either. But good night. Yeah. It is a little. He does have that attitude. I'm this insecure, shaking one. And he says, I don't give a fuck. Right. They're going to love me. Well, if they don't, guess what? If I had dinner with them, I'd be bored. That's how I. Oh, yeah. Well, often that was your opening line, though. It was. And I didn't know why it didn't play. Who are you people? No one's bathed, obviously. Good night. Where's my big money? Why didn't I get the big money? Why don't they like me? They didn't never hire me again. I got to see your show, and I was so impressed with how you guys worked it out. And even though you both knew the show so well, you had a rehearsal, and you were still working so hard to make sure that it went perfectly at rehearsal. And I thought, this is there are no accidents. Like, people that are good, in my opinion, they're yes, there is talented. There is talent, but then there's just this just mad desire to get it perfectly right. And it never goes away. Well, I always think that that. By the way, I'm here, too. Go ahead. Oh, did you just sneak into this chair? I did. But I'm always amazed that. I feel like I should I start raising my hand? Okay, well, go ahead. You say something. No, I don't have to. I had something. I say I think we prepare. I prepare out of fear. Yep. And also love, because when we get a new joke, I'm energized the whole show. I cannot wait to get to this joke. And often they don't work. In fact, here's an example, because I thought I would just say when they don't work, I am like either on stage or in the wings. I go hysterical because he's been so excited all day about this. Go ahead. I had a joke the other night. I thought when I introduced Marty, I thought this is really going to work. Right. And then we're going to analyze why it didn't work afterwards. Yes. But I said, and this man, he's he's done live television. He's been in film and he's done Broadway. And truly he is a master of the toxic workplace environment. And it was just so like, uh huh. Uh huh. And I realized later it's had too many words in it. Yeah. You know, it needed to be more of like a casual throwaway in the middle of our campus. It's also inside toxic. You had to have just read the story about that talk show lady. Oh, you mean be alive? No, no, no. I don't think everyone is following, you know, variety. Everybody knows about a toxic workplace environment. Obviously not. Because you got nothing on the joke. Remember that part? I mean, Conan shorts represent a toxic workplace environment. Absolutely for the crew. Oh, we settled out of court. No, it's just, uh, well, I've I've gone mad trying to just figure out why did one thing work and why did another thing not work? Sometimes something works and you don't know why it's because I don't know in a, on the face of it, whether that's, is that really a funny joke? One time I was doing Letterman and they started to laugh and I didn't know why. You mean the show, right? And they started to laugh and I said to Dave, what are they laughing at? And he said, nothing we're doing. But I think that we all over prepare so that if it doesn't go well, we don't blame ourselves. That's you. That's you. Yeah. I think that's you. But I over prepare out of fear because I shouldn't have any fear at this point. I relate to that. I'm afraid. I'm afraid of the feeling of it not going well is so terrible. I don't want to have that feeling. And yet today you don't seem particularly prepared. Oh, not at all. No, no, no. It was you guys. I thought what are you going to do? You know, this is going to be a mess. No, I've said this many times. One time Steve phoned me up 10 years ago and said, Do you have a moment? I want to run some jokes past you. And I said, what's this for? You said, I have Letterman in a month. And that's why he's martyred. I was just thinking about jokes you stick with and they kind of work, but you like them and then you let them have their life and then you take them out. I was just thinking of one which I discovered because I was looking back through old material. And the joke was in the opening of the show, we used it. I used it in my banjo show, which was, you know, we tried to do a good show for everyone, no matter whether you're seated down here in the VIP Golden Circle or up there, you know, refer to the balcony in the corroded zinc fire pits. It's a little too early for a joke that lengthy, but I just like corroded zinc fire pits. Maybe zinc doesn't corrode and the audience figured that out. You know what happened is the night that the chemist was in town and they were like, you know, actually, No, they just went, what's he talking about? Yeah, I was speaking about preparing. I didn't get a chance to tell you this, Steve, because I guess you have caller ID. But Marty took the call. Yeah, I did. And when you guys co-hosted SNL, I watched that monologue. You mean recently? Yeah. Oh, that's the only time we've co-hosted. Yeah, of all the times. Of all the times. Or was it 40 years ago? It was last season and you guys did this monologue and it was over. And I've worked there. I've seen thousands of SNL monologues over the years. I cut my teeth on that show as a young kid watching TV. And I said, that is the best Saturday Night Live monologue I've ever seen. It was perfect. So you didn't like my other monologues I did? No, those were terrible. Well, whenever you would come out to do a monologue on SNL, you know, everyone knew that was the time to go get a drink. Well, here's what. Use the bathroom. No, yours? But it was perfect. It was absolute perfection. Okay. May I raise my hand? Yes. So that monologue, you know, we worked on it with the writers. We got some things. But we decided we're going to do a bit from our show. So that we'll know we can trust it. Yeah. So afterwards it went well and the ratings were sky high. It was the highest rated show of the year, as far as I know. And I said to Marty, Marty, you know, the monologue went great and the ratings were high. So there's a chance we'll be asked back to host at some other time. And I said, and before you say yes, just remember we worked on that monologue for three years. You guys had this, I know it's part of your show, but God, it's a good idea. The I care about Steve and I care about Marty and it's so much so that I've prepared the eulogy already, you know, that I'm going to give for you. And you each have them on you and you damn it. It's funny. It's one of the funniest things. It's such a great and the minute I hear that, the minute I heard the idea, I was saying, oh, oh, this is a kill zone. Well, the funniest line to me is Steve's opening line. But it goes down. No, no, no, no, no, no, it's time for me to talk. Remember narcissism is just within. No, but I wanted to explain. I have a pre story to that. And then you can say that. First of all, I was going to do your line. So you might as well keep talking. No, no, you do the line. I'm saying that I had this idea that we would do this eulogy, but I couldn't get, I said, I just don't know how it starts. I don't know. There'll be some jokes or something. And then actually a writer sent in and this line. So it'd be me. So you be me speaking. So the lights come down and it says, remembering Marty and Steve's opening line is, gee, not much of a turnout. But it enabled the whole piece because we could get into it with the first laugh. Right. Right. Right. I love it. Occasionally you get someone who thinks, why are they being mean to each other? And that always drives me crazy. The funniest thing to me is when we know we doing our thing and he'll say something, I'll say something and you'll hear somebody in the audience go, whoa. I remember one time being on Conan show and I insulted him a great deal. And then I went to the next I was on. I went to YouTube to see what jokes I'd done. And I read the comments below and people would say, you know, he shouldn't talk Conan that way. If Conan wanted to, he could take him apart. We did a piece. That's a fun person to have dinner with. I know. Why are you making jokes? We had a when I was first doing the late night show, we did a piece where, you know, the most beloved one of the most beloved people at the time was Mary Lou Ratten, the gymnast. And she's, you know, small and cute. And she won all these gold medals and everyone loves her. And we did a pre tape bit where I think Andy says, I'm saying, I think I'm getting the hang of this late night, the hosting thing and goes, Andy goes, you know, you could. Yeah. But the other night I thought you, you were a little off. And I said, I don't know what you're talking about. He cut to a pre tape of me just losing it on Mary Lou Ratten. And I'm screaming at her fully committed. And we showed that audience laughs. I think the next day or the day after that, I go on Stern, Howard Stern. He takes calls and someone calls in. I saw the other night and you your behavior towards Mary Lou Ratten was atrocious. I don't think you're funny. That was awful. The way you spoke to us. I can't believe you didn't recognize my voice. Reminds me of a reminds me of a story. I don't know if these are like older elderly joke stories, but Mike Nichols, you know, was married to is was married to Diane Sawyer. And he was, you know, he's a hilariously funny guy. And he would, he would say things like that, invite him to a party and said, well, I'll have to run by the ball and chain. So he would call Diana's ball and chain as a joke. So then I think it was a Vogue. They said, evidently, Mike Nichols refers to his wife as the ball and chain. You know, it's a negative thing. So he wrote them a letter, which I think they published, but said, I realize that humor to your editors is like a cross to a vampire. Mike once said, Mike once said to me when we were at this party, he said, where are you staying? I said, New York. I said, the Essex House. He said, no, but really. I feel like I was lucky in the people that I got to meet. But then I look at you two and I think you got to meet so many more people. You know, you're younger. Yeah, you're going to meet everybody. I mean, I, I remember sitting when I was 21 years old and I was hired to write for the Smothers Brothers and I was very naive. And now we're all at dinner and Tom and Dick are having telling stories about people. And I'm sitting there going, I have no stories. I can't believe I don't have a story. Right. And I was 21. So you've got to be this age, 180 to have a story. You met General Grant. Oh, my God. What a fun guy he was. But I do think there was that whole. You said Mary Lincoln could be pushy. I mean, I'm not going to tell you. But now even, you know, just just in the there's that clip that I've seen a million times. I think it's you on the Tonight Show with Johnny Carson, Marty. And I think it's Betty Davis sitting next to you. Yes, she was. She had already killed with her three episodes, three segments. Yeah, three. She done the plate bit. Yeah, everything. Yeah, she did. You're making that up. Oh, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no. But you mean it. She did kill. She was. She was great. Yeah. Yeah, she was great. Yeah. But I just think, oh, Johnny Carson is the host of the Tonight Show. And sitting next to you is Betty Davis. That's an era of of show business. And I'd never met Johnny Carson. So it was particularly because I loved Johnny Carson. Yeah, yeah. As we all did. Yeah. So much so that I didn't even do his show for 10 years or eight years or something. When I could have because I thought, oh, I'm too hip. I just do Letterman. But the reality I was scared to. Yeah. Well, and people don't even understand the era then because it's all changed so much. But both of you had this experience where you go on, you'd go on Johnny Carson's Tonight Show and you do your your set. And the next day, everybody had seen it. Yeah, right. And, you know, you could walk through a hotel lobby and Steve would just drive from town from hotel to hotel just to walk through the lobby. Wearing a shirt that said, did you see me on Carson? And but people people I have so many stories that I've heard from comedians where they were not famous. They did well on Carson. And the next day, everybody in the United States is saying great job. Whereas today, it's just a completely different lens. My observation of that is a little different, but it's too long and boring. But I'll tell you one. No, I'd love to hear that. OK, well, I've that's what I believed. You went on Carson and you then the next day you were famous. Right. But I found with myself, you went on Carson next day. Nothing. Then you go on Carson again. And the next day, somebody looks at you like, did I meet you at a party a long time? And then finally, it slowly starts to break through. And finally, on my fifth appearance, I finally got it together. I did a good, good shot. And I went into a store on La Cienega Boulevard and that woman said, were you that boy that was on the Tonight Show last night? And I said, yes, I am. And she said, oh, well, there's always that. There's always that. Yeah. And I remember seeing a clip, Marty, I could tell you're just slightly different. You killed. But you were just I could tell that you're you're not the Marty that's going on my show and you're just going to kick the shit out of me. It's going to be so much fun. You are. You did a very funny thing about spit take. But it was I could tell, like his voice is a little different and you're being you're you're being well behaved. With Carson, with Carson. Yeah, yeah, yeah. I never got you. I don't know. There was a there's a difference between being excited to be on Johnny Carson and then to be slumming it. You know, well, there's certain people I've never overcome my awe. And Johnny Carson was one of them that I always felt a little, you know, I hope I'm pleasing him. Yeah. You know, but they knew they had card games. Yeah, we played cards together. We had dinners. That's a famous card game. People talk about that card game. It was really fun. Yeah. The lesson of that card game is everything changes. I mean, you're having you mean well, you're having poker games with Neil Simon and Carl Reiner and Dan Milnick and, you know, Chevy. And then people die. You know, everything changes. I'm trying to bring up the party here. Hope no, no, but it's and we're all going to die, too. Yeah. Yeah. Never. All right. Well, anyway, great. So shall we we're going to roll. We're going to roll on credits. Let's let's. Hey, what if we just prayed right now? We just do a group prayer. Yeah, I think that'd be very nice. And hold hands. Yeah. Well, I often think about that. It's it's it's almost my the fact that I get to know you guys and talk to you guys at all is oh is feels like I'm linking to this very important. I don't know. What I would say is I think everybody has kind of a disdain for their own era of show business and and and reviers. Well, what we observe and I probably applies to you that younger comedians like, you know, SNL guys that we kind of know or you know them better than I because you're a warm person. But we see that camaraderie among them. Yeah. That we assume the you know, like Don Rickles had, you know, with Frank and. Yeah. But I see that we have camaraderie with people of our generation and I see that we see the younger people helping each other. You know, it's a oh, absolutely. No, I mean, people like Fred Armisen and John Mulaney and Bill Hader are all close, close friends. And you know them. I was they they also have caller ID. I was talking to Fred Armisen once. I mean, it's probably 10 years ago. And he's just hanging around SNL. And he said the latest thing that we this is probably old now. But the latest thing is when you text someone and then the misspellings come up and the different words, you just don't change them. You just send it off like that. But you do that to other comedians. Fred is an interesting guy because I remember we had we were at dinner once and might have been at my house and Fred was there and didn't say he's hilariously funny guy. But that night he didn't say anything. He didn't say a word. And I remember him looking up and down the table and everybody's laughing and joking and he was just observing it all. And he has that almost like, you know, I always heard Peter Sellers at a party was not a fan of him. I think we were all there. Yes, you were there. It was a funny guy's dinner. It was a funny guy's dinner. Steve, I was. Yep. Yeah. Sure. I thought you said funny guys. You were a last minute addition. I was the control group. Polly Shore fell out. I've been so happy for both of you because you've got this crazy smash hit. Only murder's in the building. And I was initially very, very happy for both of you. And I love the show. And then I saw so much signage everywhere I drove in L.A. And then I would even leave L.A. And I would go anywhere and I would see both of your faces. And I would think, you know, that's it. I've no more. No more. I can't keep seeing their. This is too much. This is too much success. I once did an intro for Tom Hanks. He was getting AFI award. And the bit was something like this. I'd say, you know, when I first saw Tom in Splash or on the TV show, it was a bosom. Yeah. Yeah. I said, hey, this guy's good. You know, I wish him luck. And then I and then I saw him in Splash. I go, wow, he's got some real comedy chops. Good for him. That's great. And then I saw him in Philadelphia. I said, Jesus, really emotional actor. He's really, really good. And then I saw him in what's the word movie? Saving Private Ryan. Saving Private Ryan. And I thought, motherfucker. Do you say that in an AFI? I guess you can. I did. Nice. Very nice. I just yeah, I was thrilled, thrilled for both of you. And it's we can see it on your face. Yeah. Yeah. If you ignore the two of you, you're going to be like, oh, I'm going to be like, You can see it on your face. Yeah. Yeah. If you ignore the tears. That actually have blood in them. And you both get to be so funny. We are so lucky to have a hit at this stage of Marty's life. No, we are. It's fantastic. You know, and the show's fun to do. The show's fun to do. We love Selena. We love Selena. We love everybody we work with. You know, you finally get to the point where a lot of people learn earlier. I'm not working with assholes anymore. It's over. Right. It's over. So everybody there is kind and having fun and upbeat and working for the same goal. And then I then you guys announced the cast for the third season and I became enraged. I know. Because I was like, you have a royal flush, but you're adding some more aces to it. You got Merrill Street. Yeah. I'll tell you a story about Merrill Street. Yeah. Really tear a new one. Yeah. Yeah. We were sitting around and we're going to start rehearsing a scene. And our, you know, our head writer is there, John Hoffman. And Merrill says, you know, I just want to say how happy I am that we're all here together and working so hard together. And John said, yeah, I agree. And you said, John, that's her first line. And it happened more than once. There's a scene on stage where she's supposed to be an actress. She's going on stage and she trip. And then the second take, she tripped again. And it was a one. You realize we thought she actually tripped. And we said, shouldn't someone move that wire? And she said, guys, I'm. And she also, she was supposed to do a song with an orchestra and she should start to sing. And she goes, I'm sorry, I can't hear the rhythm. And they said, well, can we? No, that was her. That was her line. And it's just every time we go, when are they going to fix that rhythm thing? I can't hear it. I did a thing. It was for Norm McDonald here in New York. And they had some gathering and I was, I guess, the emcee, for lack of a better word, but I gave the first talk. But I went up on stage and went head over heels fall. People thought it was a praffal, but it was real. And I was, you know, made a joke of it and everybody thought, well, and then moved on and then did my thing. And then I think the second person, yeah, the second person who went up with the third person, they tripped. And I went to, you know, and I said to a stagehand, what's going on? Everyone keeps tripping. Oh, yeah, those stairs have been messed up for a long time. They're not. And he was like, they're not even. Yeah. So everybody trips anyway. No, they still haven't fixed those fucking stairs. Where is that? It was. I don't remember where it was. Oh, thanks. Thanks. That's no help at all. So we can be tripping anywhere. Now we're going to go trip somewhere. And we also have Paul Rudd on our show. I was going to say. He was fantastic. Yeah, and I love that you have this show that everybody agrees is fantastic. Andrea Martin. And you add Paul Rudd. You know, you don't need Paul Rudd at this point. It's making it, it's too much. Yes, and Andrea Martin and Tina Fey. Yes. And Jesse Williams. You know who wasn't asked? Who? Oh, I know who wasn't asked. Conan. Who wasn't asked? Because Conan has beady little eyes. They have no light in them. Wait a second. In the first season, Conan did. Oh, that's Jimmy Fallon. No, no. No. I mean, your name, your name came up. Oh, it came up. Yeah. Oh, good. And you said, you can't light the eyes. No. Just can't light the eyes. He's got those Charles Grodin eyes. You can't light them. They're like a doll's eyes. Yeah. Listen, you're going to figure out a way to work me into this thing. Sure. I think. Hey, with the premises, we're doing a podcast. I don't know what you'll be playing, but I know the title of the episode. Oh, yes. Here we go. The circus has come to town. My favorite thing is getting excited about the nice thing I'm sure you're about to say. Oh, good. What is it, Marty? It's the guy who has no memory of how Martin Short has treated him over 25 years. The absent-minded podcast. I love that. Yeah. Oh, Marty's got something to say about me. Yeah. God, gee, let's have it, Marty. Or also, you can recognize it later that it was an insult. Marty said the nicest thing about me. He says I was a total idiot. Oh. Oh. That's right. You're about a podcast. I have the podcast. Please, that's not me talking. That's podcast magazine. Guest edited by Conan O'Brien. I'm going to be the host. I'm going to be the host. I'm going to be the host. I'm going to be the host. I'm going to be the host. I'm going to be the host. Podcast edited by Conan O'Brien. Yeah, right. But, yeah. I'm sure there's a way to fix me in, to get me into the mix. Absolutely. Yes. We'd be honored. Incredible. You reminded me of a joke. I don't know why. Jokes. We're doing a show next weekend, so these jokes are going through my mind. It was, Marty would talk about me playing the banjo, which always insults, of course. And the joke was, and maybe you use it, he said, and Bluegrass Magazine has recently named Steve the official ambassador of the five-string banjo. It was between him and no one. Well, you have that great joke. It has deliverance. What is that? Oh, yeah. I hope I didn't just ruin it. It's such a great joke. What is it? Touring around with Steve is a lot like the movie Deliverance. It's all fun and games until the banjo's come out. Yeah. You kindly had me to your apartment once. I remember the first time I ever met you. You do? No. Actually, I do. No, I do. All the life went after you and you said, no, that was really fun. I saw you rise up and then fall down. No, you came to our apartment and met you? Or was it? No, no. We had worked together on SNL. I was very shy and I remembered I don't want to get in Steve's. So I was writing things but not approaching you. I was in the background. But then I was chosen for, you know, Lauren said, I think this fellow could host the late night show. It'll be rough for a few years, but he'll eventually get it. I think he could do it. So I'm named Letterman's replacement. And the first thing I do when I come out to LA is Lauren says, and maybe this is a thing he does, but he said, let's take a walk through the flats of Beverly Hills. And people told me later on that Lauren likes to take a walk. And he's taking this walk and he's giving me advice. He's saying, always tip. You're known now. Always tip at least 15 percent or you'll show up in the post. I thought he was going to tell me like, here's the secret. But he was telling me things like that, which was fine. And then he said, let's see if Steve's in. And I didn't know, you know, Steve, he always assumed Steve Croft. And so I... Steve Rossi. Yeah, exactly. So we, he knocks on a door and you answer and you have us into your place. And I was like, this is too much. I've just been put into this situation and I need to navigate this. And now we're dropping in on Steve Martin. And I'll never forget you had just had all the paintings taken down. And I think I just said like, oh, there are no paintings. And you reacted immediately as if you had been robbed. What? Oh my God. And I thought, oh shit, that's funny. That's a perfect reaction to where are your paintings? Yeah. Whenever, whenever in studio, I remembered once every day when then you'd be in the studio at six day rehearsing and the lights would go out because of some situation in the building, Rockefeller Center, some situation, the lights would just go out and Andy would always instantly scream my pearls. Andy who? Andy Richter. Hilarious. Yeah. And. Oh, I got to remember that. But I have to give him credit. Yeah. No, you don't. No, you don't. No, just take it. Andy was fine. I know I'll blow it. My pearls. My pearls. My previews. My pez. My pez. How did you guys decide we're going to start working together as a two-hander act? Why did that come about? And I know it's. I'll tell you what. It's a boring story, so I'm going to give it to you. No, no, no. It was 2011. We were asked to interview each other for it was the closing of the Just For Last Comedy Festival in Chicago. It was May and it was 2011 and we just. What do we have for breakfast? I get. You had scrambled eggs. I had fresh toast. Come on, man. I had syrup. No, and we interviewed each other and that was it. And it went well and we thought we'd do it again. And we just then. Well, the funny part is we were interviewing each other about comedy for a comedy festival. So we could talk about comedy, kind of like we're doing here, but to comedy people, it's kind of interesting. So we thought, hey, let's do that again. So we got a corporate gig or something. And so we're sitting and we're talking about comedy and we're thinking, this doesn't work. And then we started. And Marty had a show he did solo. And I had a show that I did with a band. And so we kind of combined them. But he had material and I had a bunch of songs with funny intros. And when we first when we first started working together, he had everything and I kind of had nothing because I didn't bring the band. I said, well, I got to bring the band. So that's when it started to gel into a show and I can go on. Did you? Yeah, I can go on. Did you ever? It's it's it's first of all, that was great. Yeah, anyway. I was saying I was saying that, no, I think you said it. Really? Yeah. You know, this is what I didn't think I got to the part. Oh, you didn't need to. It reminds me of I made the mistake once of it's and you know it, it's like wearing the shorts. But I knew I I made this terrible mistake of someone had mentioned food and what they eat. And I said, well, you know what I do now is I eat two meals a day. I have like a shake at 11 and I put a lot of spinach in it and then I try to eat dinner early, like at five. And then I as I'm finishing saying it, I see Marty just staring at me the way the way a shark looks like it looks at a canned ham that fell into the ocean. And he looks at me and he said, you know, when other people discuss the details of their diet, it's boring, but not you. And of course, there were some writers standing around who were like, yes, they love when the boss is attacked. That was also just me realizing, I, why did I get into this? Why did I lather myself up with bacon grease and then climb into this piranha piranha pool? Why did I, why did I do that? My wife is a very wise about about talking about what you eat. She said, you're allowed to talk about what you do eat, but you're not allowed to talk about what you eat. Very good. I like that. Yeah, I like that. I mean, if this podcast, if we go away with one thing, that's it. It's like with me beats. I don't beat beats. One thing I was curious about is when you come up with a great new insult for the other, do you ever try it out in the moment on stage or do you ever try to surprise each other? Not really, but sometimes we've come up with things. And then we'll go right to the prompter afterwards and say, oh, right. That, you know, we'll remember what, what prompter that if we had a prompter, let's say if we had a prompter. Yeah. So you're saying if we had a prompter and we came up with a joke, we would go over and talk. I mean, now we just go to our own minds and lock it in. Well, we were talking earlier about people you've met and I know Steve that you got to meet or kind of meet Elvis. I did. And I've told the story a million times, so I don't know if it's worthwhile. Well, I just love it. So well, I was, it was 1971 and I was opening for Anne Margaret at the Hilton in Las Vegas, which is no longer there for good reason. It's like they tore it down the following day. The worst comedy room. Yeah. There's a ceiling that's like 80 feet high. So laughs, the laughter rose above the audience's head about two feet and stopped. But anyway, and Elvis was opening the next weekend and he knew Anne Margaret. So now it's after the show. I know Elvis is going to come back and say hello to Anne Margaret. And so I leave my dressing room door open and I did my act. It's 1971. So the act is not fully formed. You know, it's got a weirdness to it. And so Elvis walked by and he saw me and he stopped and he said, son, you have an oblique sense of humor. And then he came in and now we're talking. I'm talking with him and I know you don't know what to say. My manager was there who knew all about son records. So we can talk about that. And then there was a pause in the conversation. Oh, first of all, but this is the part I loved. Elvis has a guy who comes up to him to get him out of conversation. So Elvis, I'm sorry, we have to go. And in this case, he comes up as sorry, we have to go. And Elvis said, it's okay. I've been blessed. So then we're talking. Then we run out of conversation. Then he said, want to see my guns? Jesus. And we said, sure. And he was a, he was a gun. He liked artful guns. He was like an engraved thing. And he was very cautious. They were loaded. And so he took out a six shooter and he opened it up and dumped all the bullets in his hand. And before he handed me the gun to look at it and I was looking at it, I'm marveling at it. Then he took out another gun, did the same thing, dumped out the bullets, handed it to me. And then they pulled out from his sock, a derringer and then opened that up, dumped out the bullets, handed it to me. And then I'm, I'm holding three guns and he's holding 16 bullets. And I'm thinking, where is Elvis's guy? Yeah. To get me out of this. Do you remember what he was wearing? Yes. All white. It was Elvis Slim and he had the all white and he wore that big buckle that the Hilton had given him to him for biggest show ever in the history of the world. Right. But he was very sweet and very nice. Yeah. And that comes across when you look at the documents. Well, that's a famous face though, Elvis Presley. Yeah. Jesus. Well, also the reason I wanted to, because I know that you met Frank Sinatra. Yes. And who's your absolute idol. But it was one of those situations where you, because I remember you told me this once you were at a bar and it... No, I was at George Slaughter's house. Oh, George Slaughter's house. OK. It was after a Sinatra Shirley MacLean concert at the Greek Theater. And we all went back to his house and Diana Shore was there. She was a big fan of SCTV. Oh, great. She's going on about it. And I'm thrilled to meet Diana Shore. She said, Hey, do you want to meet Frank? I said, Sure, sure. And I went up to him. Now, this next part Paul Schaefer maintains, I've made up because he said he didn't he didn't speak like out of guys and dolls. And I said, well, he did, though. He said, I said, Mr. Sinatra, Martin Shor, and he said, I know well of you and your models. I know well of you. Let's not leave that. Yeah, I know well of you. That's not guys and models. Now he didn't. Yeah. Anyway, then then he said, would you like a drink? And I said, sure. He said, what are you drinking? I said, anything you're drinking, Frank. And so he turned to the bar and said, Jack Daniels. And I had done don't drink scotch. So the bartender said straight up or on the rocks. And I was nervous. I thought he said straight up or relaxed. And I said, I'll have it relaxed. And he Frank said, he said straight up or on the rocks. I'd known Frank 15 seconds and I pissed him off. And I started to. Yeah, Julie beat the crap out of this guy. Are you a moron? So I could Frank. Now, it was when you meet those people, it is surreal. But, you know, I used to have that with Mike Nichols and I knew him for 20 years that I was still in awe. Like you talk about Carson. You're in awe of being in their presence. I had I mean, this is someone he both have met a billion times. But Lauren once asked me to go to a he said, would you like to go to a Yankee game with me? And I said, yeah, I'd love to do that. And there was a playoff game on the Red Sox. And so we're I get in the car and he says, we're picking up. I think he said we're picking up a friend. I didn't hear who he said we were picking up. But he puts, you know, so I sat up front. So there was room in the back for Lauren and his friend. I set up with the driver and we start driving up and then we start to slow down. And there's someone leaning against the lamppost in like a very cinematic way. And we slow down. And it's Jack Nicholson. Wow. And Jack gets in the back seat. And he goes in, Lauren goes in, he's like, how you doing, Lauren? He says, this is our corner. And he says, it's very nice. Just said, nice to see you. And I said, oh, so nice to see you, sir. You know, and then we drive, we see the game. And my experience was if you want to be anonymous, walk with Jack Nicholson, because I am my life is I'm six, four, I have this pastry on my head. I am immediately like me or dislike me. Everybody knows it's me. And I walked down the street and everybody knows it's me. And suddenly nobody saw me because I'm walking three feet behind Jack Nicholson. But then the real treat of the night. So we chatted a little bit about a few things and didn't talk much. He mostly spoke with Lauren. And then he drops me off at the end of the night. And I think, well, this has been great. And I get out of the car first, cause I'm just gonna walk. We dropped Jack Nicholson off and he gets out of the car. And I just said, it was a real honor to meet you, you know, Jack. And he said, my boy is crazy about you. And I said, he said, I'll never forget. He said, my boy, we're just standing there and Lauren's still in the car. And he goes, my boy is crazy about you. Every morning it's Conan this and Conan that. It's driving me fucking crazy. I had no idea that even, but I just knew that I was an irritant in his life. And that made me very happy, very happy indeed. I'm just going back of it cause I kept remembering this great joke. And I think it was a Shecky Green's joke about Frank. And it might've been Don Rickles, but I think it was Shecky Green. He said, and Frank's in the audience. He said, Frank saved my life one night. You know this joke? No. He saved my life one night. I was in an alley and I was getting beat up by some guys. And Frank said, that's enough. And then there's the famous Rickles joke, which I'm, it's story, which I'm sure is true, which is Rickles asking Frank. He's like, I'm meeting, I'm dating this young girl. Could you, this young woman, it would really mean so much if you just came through the lobby and walked through the restaurant and said hello to me in front of her. That would really help me seal the deal. And so Frank Sinatra comes through and walks up to Rickles and his date and says, hey Don, I just want you to, Frank, please, I'm eating. And Frank leaves the restaurant. And then about 30 seconds later, two guys come in and pick up Rickles, carry him out of the restaurant and dump him in the fountain. Is that last part true? It was a fountain. It was a fountain of acid. That's the part that's less funny. Frank had it constructed. They killed Don Rickles. Yeah, they did. Yeah, he never lived past 1961. Guys, I'm gonna let you go because you have, it's been made clear. Wouldn't you like to get some part of this interview that's usable? What, you're a young lad. You've listened to some of my, I'm gonna say this is my favorite episode maybe ever. This is one of my favorite. Certainly mine. This is a spectacular episode. I'm just going back over why we're doing it. It's because of your admiration for me and my work. Well, that's true. This is a very, very famous podcast. I understand that. Yeah. I know that. And so we should be honored to be part of it. I am. You couldn't say it with a straight face. Hey, after this, let's you and me go and cash our checks. Let's do it. But we need a big bank. I mean, not every bank. I have ideas. Maybe we'll get some cash and some just a cashier's check. Yeah. And I have a servant with me. He could carry the bullion. You know, you guys have always kept in touch. That's what I like about you. You never got in the bubble. You're out there. Oh, I'm of the people. Always. Kept in touch with whom? What do you mean? You're just in touch with the people. Oh, right. You're going to the bank. You'll probably have to stop and get a wheelbarrow. But you do it in a humble way. Would you say that with success, you changed? I'm pausing. You can't help but change. But I'd say I have changed for the better with success. That's what I think. You probably disagree. Can't wait to phone others. Did you know Steve? I met him on Three Amigos, 85 July. Yeah. Jesus. And then we became great friends. And then you make that decision of whether you're going to just have that two month experience of making a movie and never see someone again or not. And I think we both chose to keep hanging. Were you guys, it's just interesting you bring up Three Amigos, because you make that movie, it came out and it did what it did, but then it goes on. And I don't know when it happened, but within maybe 10 years of it coming out, there's this whole generation that seizes that movie and says, this is one of our favorite movies. And it has grown since then in a way that I think is well-deserved, but it's kind of fascinating to me. Were you aware of that happening? That's what happens with a lot of my movies, except for the 10 year part where they like it. Well, I've always found that you never know if a movie is a hit or success till 10 years goes by. Because some movies are big hits when they come out and then you never hear of them again. And then some movies tend to grow. I was surprised. In fact, we got a call from a magazine in London and they said, it was a film magazine. They said, we want to put you, Marty and Chevy on the cover. We said, why? They said, well, it's the 25th anniversary of Three Amigos. I said, you care? And that's when I started noting that there was some kind of thing happening with it. Yeah, it's got this whole other life. And I can't tell you how many times I've seen, they'll ask various rock musicians, artists, athletes, just anyone, politicians list favorite movies. And then Three Amigos keeps popping up in there, which is really great. Well, Steve wrote it. Well, with Lorne Michaels and Randy Newman. That's right. But you said you wrote the funniest parts. I will, yeah. Actually, Randy Newman wrote my favorite joke and the whole thing. And it's when El Guapo, it's his birthday and all his men are celebrating and he opens a package and he goes, it's a sweater. I love the canteen joke so much that you're both, you know, the three of you are running out of water. Oh, canteen. The canteen and just there's barely enough. And then just luxuriating. I like Spong. A little bit of a lip-spitting out. Yeah, lip balm is so fantastic. My favorite joke is that we go into a saloon that's filled with bad guys. And we're all in our spangly outfits. And I go up to the bartender and say, excuse me, we're not Mexicans. We're from out of town. Was it fun to make? Yeah. It was. We were actually in Arizona and on locations and building these beautiful sets. It's just one of those, because sometimes I've known when you're having a blast making something, I sometimes get worried. If you're having a really good time making something that this means it won't be good. One of my favorite lines, I just somebody reminded me of it too at the end. The very end, I go up to Patrice Martinez who's a beautiful actress who played Carmen. She passed away, unfortunately. And it's supposed to be something between us. And I go up and we're about to ride off and I say to her, I'll be back one day. And she says, why? Well guys, what's the plan for the rest of the day? I'm sure you've blocked out a whole chunk of time with me. Well, I've got to do my 5BX workout. Incredible. I was gonna say you look amazing. Thank you. And today it's AB day, so I'm gonna work on the abs. And that's most of the day. Hard for me for you, when you say that, for me not to think of your role on Arrested Development where you're the bullet. Shoot me. Shoot me. And my son adores that show. So the times that you've been around, as much as you've done, you never know what's gonna get people. And he's seen and really liked your other work, but you as the bullet. The bullet. Whatever, isn't that your- I was a guy, I was so old, I was their uncle, that my legs didn't work and I had to be carried around by a big strong man. And we kept adding jokes and at one point I said, to the nuts. And they put me down to Jason Bateman's testicles and I went, bridge mix, bridge mix. And they put me on a table to eat nuts. But it's just so nice that you do these different things, you never know what's going to catch with who. And then, my son, who now is 17, but at the time he was seeing it, he was like 12. And he was like, well, this is the funniest thing I've ever seen. And I'm like, well, he's coming over tonight. And it's just, it's lovely. It's very nice. Gentlemen. Okay. Thank you, Conan. I wanna let you go. Thank you very much. Think about the cameo. Oh yeah, of course. I will play a small part. I have a tendency to shoot the lens. I look right into the lens. Wow, good. Yeah. What would it be? It's funny, cause Shrek-like monster crushes townspeople and then is arrested for murder. Something like that. But I like- Why? Why do I goad you? Why do I ask for more? I like Conan's approach, cause most actors try not to look into the lens. Yes. I would have a small role where I'm literally carrying crab cakes in the background at the nice west side apartment and I stop and I turn and look right into the lens and freeze. And that's what we're gonna do. Oh, Steve's taking a call. No, no. Oh, no. I'm looking at my plans for the rest of the day cause you asked and then I realized I have none. Okay. Well, perfect. Okay. Thanks a lot. Thank you very much. Guys, you both mean the world to me. And this is like, I don't know. We will never top this episode. And I know that you are being self-effacing and saying we've killed time is an absolute joy. Absolutely. Thank you. I bow to both of you. I love you. I bow to you. And obviously we both been influences, but which one a little bit more? Oh me. Oh, you can't see everybody. He's looking at me. Thanks Conan. Anyway, Steve, your car's here. Guys, go in peace. Thanks a lot. Oh, by the way, you forced this on us. Hi, my name is Steve Martin. And I feel blank about being, let's hear you do it spontaneously, replace Conan O'Brien's name with mine. You could do another version and they could put it in. That was fantastic. I thought I did do a good version. You did great, John. Oh, then there you go. I'm challenging him. You go, suddenly we have to learn lines. It's not learning a line. It could be, you know. You have to write. You don't write. You could have a sincere emotion and say it in a moment. Oh, I never thought of that. Yeah, I could say, my name is Conan O'Brien and I feel overwhelmed, overwhelmed with gratitude that Steve Martin and Martin Short even know my name. And that's, you know, there I go. Okay, it doesn't have to be, you know, I didn't have a writer work on that. So you wanted us to compliment you. Yes. Oh. We didn't think of that. Okay, thanks a lot. Conan O'Brien needs a friend. With Conan O'Brien, Sonam O'Sessian and Matt Gourley. Produced by me, Matt Gourley. Executive produced by Adam Sachs, Nick Leal and Jeff Ross at Team Coco and Colin Anderson and Cody Fisher at Earwolf. Theme song by The White Stripes. Incidental music by Jimmy Vivino. Take it away, Jimmy. Our supervising producer is Aaron Blair and our associate talent producer is Jennifer Samples. Engineering by Eduardo Perez. Additional production support by Mars Melnick. Talent booking by Paula Davis, Gina Battista and Brit Kahn. You can rate and review this show on Apple podcasts and you might find your review read on a future episode. Got a question for Conan? Call the Team Coco hotline at 323-451-2821 and leave a message. It too could be featured on a future episode. And if you haven't already, please subscribe to Conan O'Brien Needs a Friend on Apple podcasts, Stitcher or wherever fine podcasts are downloaded."}, "podcast_summary": "- TL;DR: Comedic legends Steve Martin and Martin Short join Conan O'Brien for a hilarious and entertaining conversation.\n- They discuss their friendship, their experiences in the entertainment industry, and their show \"Only Murders in the Building.\"\n- Martin shares a memorable encounter with Elvis Presley and Steve reminisces about meeting Frank Sinatra.\n- They discuss the joy of making people laugh and the camaraderie they've witnessed among comedians.\n- Despite their success, they remain humble and apprec", "podcast_guest": "Martin Short", "podcast_highlights": "Chapter 1: The Friends Reunite\nChapter 2: Swapping Stories and Insults\nChapter 3: The Famous Friends\nChapter 4: The Surreal Encounters"}
>>>>>>> d28eafdb054f0667bed02276bf80f15c1693e01f
