{"detailed_guest_info": "The podcast guest is discussing the concept of Frequency-hopping spread spectrum (FHSS). FHSS is a method of transmitting radio signals by rapidly changing the carrier frequency among multiple frequencies within a large spectral band. It is used to avoid interference, prevent eavesdropping, enable code-division multiple access (CDMA) communications, and allows for sharing a frequency band with minimal mutual interference.", "podcast_details": {"podcast_details": {"links": [{"href": "https://feeds.simplecast.com/dHoohVNH", "rel": "self", "title": "MP3 Audio", "type": "application/atom+xml"}, {"href": "https://simplecast.superfeedr.com/", "rel": "hub", "type": "text/html"}, {"rel": "alternate", "type": "text/html", "href": "https://teamcoco.com/"}], "generator_detail": {"name": "https://simplecast.com"}, "generator": "https://simplecast.com", "title": "Conan O’Brien Needs A Friend", "title_detail": {"type": "text/plain", "language": null, "base": "https://feeds.simplecast.com/dHoohVNH", "value": "Conan O’Brien Needs A Friend"}, "subtitle": "After 25 years at the Late Night desk, Conan realized that the only people at his holiday party are the men and women who work for him. Over the years and despite thousands of interviews, Conan has never made a real and lasting friendship with any of his celebrity guests. So, he started a podcast to do just that. Deeper, unboundedly playful, and free from FCC regulations, Conan O’Brien Needs a Friend is a weekly opportunity for Conan to hang out with the people he enjoys most and perhaps find some real friendship along the way.", "subtitle_detail": {"type": "text/html", "language": null, "base": "https://feeds.simplecast.com/dHoohVNH", "value": "After 25 years at the Late Night desk, Conan realized that the only people at his holiday party are the men and women who work for him. Over the years and despite thousands of interviews, Conan has never made a real and lasting friendship with any of his celebrity guests. So, he started a podcast to do just that. Deeper, unboundedly playful, and free from FCC regulations, Conan O’Brien Needs a Friend is a weekly opportunity for Conan to hang out with the people he enjoys most and perhaps find some real friendship along the way."}, "rights": "2021 Team Coco & Earwolf", "rights_detail": {"type": "text/plain", "language": null, "base": "https://feeds.simplecast.com/dHoohVNH", "value": "2021 Team Coco & Earwolf"}, "language": "en-us", "published": "Thu, 17 Aug 2023 04:05:00 +0000", "published_parsed": [2023, 8, 17, 4, 5, 0, 3, 229, 0], "updated": "Thu, 17 Aug 2023 04:05:23 +0000", "updated_parsed": [2023, 8, 17, 4, 5, 23, 3, 229, 0], "image": {"href": "https://image.simplecastcdn.com/images/d139afc2-e8b0-4ec2-bc74-fdc3c88f649a/d59c963f-c9dc-41d8-9005-369e80634b3b/3000x3000/screen-shot-2023-05-01-at-12-14-01-pm.jpg?aid=rss_feed"}, "link": "https://teamcoco.com/", "itunes_type": "episodic", "summary": "After 25 years at the Late Night desk, Conan realized that the only people at his holiday party are the men and women who work for him. Over the years and despite thousands of interviews, Conan has never made a real and lasting friendship with any of his celebrity guests. So, he started a podcast to do just that. Deeper, unboundedly playful, and free from FCC regulations, Conan O’Brien Needs a Friend is a weekly opportunity for Conan to hang out with the people he enjoys most and perhaps find some real friendship along the way.", "summary_detail": {"type": "text/plain", "language": null, "base": "https://feeds.simplecast.com/dHoohVNH", "value": "After 25 years at the Late Night desk, Conan realized that the only people at his holiday party are the men and women who work for him. Over the years and despite thousands of interviews, Conan has never made a real and lasting friendship with any of his celebrity guests. So, he started a podcast to do just that. Deeper, unboundedly playful, and free from FCC regulations, Conan O’Brien Needs a Friend is a weekly opportunity for Conan to hang out with the people he enjoys most and perhaps find some real friendship along the way."}, "authors": [{"name": "Team Coco & Earwolf", "email": "conaf@teamcoco.com"}], "author": "Team Coco & Earwolf", "author_detail": {"name": "Team Coco & Earwolf", "email": "conaf@teamcoco.com"}, "itunes_explicit": true, "itunes_new-feed-url": "https://feeds.simplecast.com/dHoohVNH", "publisher_detail": {"name": "Team Coco & Earwolf", "email": "conaf@teamcoco.com"}, "tags": [{"term": "Comedy", "scheme": "http://www.itunes.com/", "label": null}]}, "first_episode": {"id": "6c858e7e-d841-4ae8-879f-4543ee3b1ff2", "guidislink": false, "title": "Summer S’mores with Conan and the Chill Chums Season 3 Episode 4", "title_detail": {"type": "text/plain", "language": null, "base": "https://feeds.simplecast.com/dHoohVNH", "value": "Summer S’mores with Conan and the Chill Chums Season 3 Episode 4"}, "summary": "Conan and the Chill Chums take a moment to appreciate a pizza art gallery featuring their likenesses.", "summary_detail": {"type": "text/plain", "language": null, "base": "https://feeds.simplecast.com/dHoohVNH", "value": "Conan and the Chill Chums take a moment to appreciate a pizza art gallery featuring their likenesses."}, "published": "Thu, 17 Aug 2023 04:05:00 +0000", "published_parsed": [2023, 8, 17, 4, 5, 0, 3, 229, 0], "authors": [{"name": "Team Coco & Earwolf", "email": "conaf@teamcoco.com"}, {"name": "Team Coco & Earwolf"}], "author": "Team Coco & Earwolf", "author_detail": {"name": "Team Coco & Earwolf", "email": "conaf@teamcoco.com"}, "links": [{"rel": "alternate", "type": "text/html", "href": "https://teamcoco.com/"}, {"length": "26696839", "type": "audio/mpeg", "href": "https://chtbl.com/track/9E9755/arttrk.com/p/ST44R/stitcher.simplecastaudio.com/c945bd13-c7f3-4f22-95b5-4bf98e12b21f/episodes/2b865686-1f7b-44c3-b283-c6d53e1e4ab2/audio/128/default.mp3?aid=rss_feed&awCollectionId=c945bd13-c7f3-4f22-95b5-4bf98e12b21f&awEpisodeId=2b865686-1f7b-44c3-b283-c6d53e1e4ab2&feed=dHoohVNH", "rel": "enclosure"}], "link": "https://teamcoco.com/", "content": [{"type": "text/html", "language": null, "base": "https://feeds.simplecast.com/dHoohVNH", "value": "<p>Conan and the Chill Chums take a moment to appreciate a pizza art gallery featuring their likenesses.</p>"}], "itunes_title": "Summer S’mores with Conan and the Chill Chums Season 3 Episode 4", "itunes_duration": "00:27:48", "subtitle": "Conan and the Chill Chums take a moment to appreciate a pizza art gallery featuring their likenesses.", "subtitle_detail": {"type": "text/plain", "language": null, "base": "https://feeds.simplecast.com/dHoohVNH", "value": "Conan and the Chill Chums take a moment to appreciate a pizza art gallery featuring their likenesses."}, "itunes_explicit": true, "itunes_episodetype": "full"}, "transcribed_data": {"podcast_title": "Conan O’Brien Needs A Friend", "episode_title": "Summer S’mores with Conan and the Chill Chums Season 3 Episode 4", "episode_image": "https://image.simplecastcdn.com/images/d139afc2-e8b0-4ec2-bc74-fdc3c88f649a/d59c963f-c9dc-41d8-9005-369e80634b3b/3000x3000/screen-shot-2023-05-01-at-12-14-01-pm.jpg?aid=rss_feed", "episode_transcript": " This special episode of Summer S'mores is presented by Solo Stove. Solo Stove is uniquely designed to burn off smoke before it ever escapes the top of the fire pit. Trust us, once you've sat around a smokeless fire, you'll never wanna go back. Go check them out at solostove.com. Use promo code Conan to get $10 off your new pit. Summer S'mores with Conan and the Chill Chums, a six-part series with Conan O'Brien, Sonam Avsesian, and Matt Gourley. Let's get started. Hey! Yeah! Yeah! Yeah! Yeah! Yeah! Yeah! Yeah! Yeah! Why? Do you wanna work someplace else? Because this is pretty stupid, you have to admit. It's so dumb. The mushroom kids, the mushroom kids. We represent the mushroom kids. Why doesn't Gourley set up the pizza art and I'll set up the glasses? Great, so we're starting with the glasses. What should I do, boss? Well, I think you're doing it. Go rob a bank, you hobo. I'm going to that side. I'll start, I'll intro us in, I'll do the YouTube and then Conan over to you for the glasses. I'll kill you. I'll be killed, okay. You got me. Welcome to Summer Chores and... Hey, you okay? Uh-huh. Oh my God, we're not even, not that much time has elapsed and I'm worried about Sona most of all. You should be. You should be. She is drinking a powerful rum drink. Matt, how are you doing? Quickly. You said Summer Chores instead of Summer S'mores. Welcome to Summer Chores with Kobe and the... Okay. We're doing this podcast, Don't You See? I don't think anyone said Don't You See since about 1944. Don't you see? We must win World's War II. The best part is, listeners, you can go to YouTube and check out all kinds of clips from this series. Yeah, if hearing about it doesn't annoy you enough and you wanna see this total meltdown of us outside on this nice veranda. Do you wanna see the three hottest people that you've ever seen in life? We're so fucking sexy. I'm wearing a bikini the size of a doily. Sona, what are you doing with the cord of your headset? I'm doing unibrow. You're doing unibrow? For the YouTube people. Okay, hey YouTube people. Hey YouTube. Dear YouTube. You look fantastic. Thank you. You look amazing. Thank you. Let me see, point it to me. Unibrow. Whoa. Well, I think the important thing is that we're here, we're together, and two of you are wasted. I'd like to point out that I'm a very thoughtful person. Pfft. Pfft. Pfft. Pfft. A very thoughtful person. You're busted, you little dandy. Yeah. No, I am not. I blame the microphone, which is a Krieger, which is not the German brand I prefer. It is Schlutendaden. Anyway, I knew that it was your birthday coming up, and I tried very hard to get you a wonderful, this is for you, Mr. Matt Gourley. Yes. I tried to get you the perfect gift. I conspired, I went online, and I found this place that would sell me mid-century vintage cocktail glasses that looked like pineapples because they have a copper top. They're really cool looking, and they have a built-in straw. And I thought, oh my God, this is so Matt Gourley, and it's also so Summers-Moors. I tried, I ordered these things and paid for them, and now I would like David Hopping to enter the scene, because David, I think you could maybe explain. David! David is my assistant who really does things as opposed to Sona, who pretends to do things. Anyway, so, David. Not an important part of the interview. I'm Martin Murray. You're a whole. Five, five, five. David does your day-to-day assistant duties, and I do big picture. Oh! That's right. What's big picture? Yes, no, you know, when I'm planning to launch satellites, my purchase of, you know what? I have to say, when I tried to outbid Elon Musk for Twitter, Sona was instrumental. The big picture. Yeah, I'm a big picture. But anyway, do us a favor and tell us, Mr. Hopping, what's the status, because first of all, take us through it, because we've talked about this before, but I ordered these glasses, and I was really excited for them to come, and then they weren't showing up, and then you told me there was a problem, and then you said an investigation has been launched. Yeah, it's kind of exciting. Ooh, a little bit. Let's hear about it. Um, so, they're not here. That's pretty exciting. That's my favorite part of the story. They're missing. I did check earlier, and now it says that a claim has been filed, and now it says that I need to contact the seller, so basically we ordered these from like, not eBay, but like and eBay. What do you mean, like and eBay? So it's like from a seller. F-bay? Like, I was like messaging the girls, what? It's called sap.com, and yeah, it's not good. She seems really nice, though. Can I ask you a question? Yeah. My money's gone through, yes? So you're out of pocket at this point. So I am out of pocket. And David, just to be perfectly honest, these weren't cheap. No. Okay, so I am out of pocket, this amount of money, and yet right now we're just hearing these vague claims that there's an investigation, right? Like we can see every step of the journey the package went on. Like it went from Connecticut to New Jersey to something called Bell, California, that sounds nice. That's hilarious. Then it went out for delivery, and then just. Vanished. So now what is that, in your opinion, David, and I know that you're a very good detective, what do you think happened to the glasses if you had to guess? Do you think someone stole them along the way or do you think it's an innocent accident? I mean, I don't wanna accuse anyone of stealing, but I think they were stolen. Let's be clear, the real tragedy is I've turned 50 years old and I am weeks without gift. Yeah. And I'll tell you, I don't know how much longer I can hold on. Yeah. Well, first of all, it's not just without gift, you're weeks without twee cocktail glasses. Exactly. From the 1950s. My reason for living. Yeah, exactly. This is, an injustice has been done, good money has been spent, you know how hard I work and how much I deserve the money that I make, and you know that this is a crime. This is a terrible crime against a great American who has brought laughter to people for 30 years. Makes it about himself. When do we expect a resolution? Yes, thank you, David. Oh, you know what, Matt, I apologize. I did momentarily make it about myself and I'm sorry. And I just want you to know that Conan O'Brien is sorry for the loss of the glasses that Conan O'Brien got you. When can we expect a resolution? The investigation was supposed to end two days ago. Two days ago. And there's no update. What investigation? There's no Inspector Clouseau out there. Who's investigating? The UPS is investigating themselves. The UPS? Oh, this is ridiculous. You know what, I'm sorry, David, I don't wanna throw you under the bus, but I would pretend that this happened if I forgot to order something. And then I would have- Oh my God, did you do that, David? You have receipts. I would pull them up, but then everyone would see how much you paid. Hey, you're in this big picture, why don't you get on this? Yeah. Oh, yes. Sona, Sona, Sona, let me ask you a question. How would you- I would call UPS. And what would you do? I would give them a piece of my mind. Let's role play that. Hi, this is UPS. Hi, UPS. This is Sona. I'm calling from, you may have heard of him, Conan O'Brien's office. Never once heard of him. Okay. Well, we had a package. Okay. And guess what? They never showed up. This is your literal job, UPS, to just deliver this shit. You're right. Where is it? What's in the package? It doesn't matter what's in the package. You're right. How can I locate it without the contents, you dill? Why do you need the contents? You dill? Well, you should be asking me for my tracking number. Do you even work for UPS? No. You dill? I'm a temp, you dill. Who did I call? Can I ask you a question? Yeah, you dill weed. Your biggest insult is comparing someone to a pickle? Yeah. Wow, what happened to UPS? I'll tell you what. We don't lose packages here at UPS. All right, okay. Oh, no. I'm dealing with fools. No, I would call and get angry. I will say something, David. I'll do it for you. David, can I, David, you do a great job. But Sona's the OG. And Sona has a temper that is off the charts. Get on this. Sona. It started nice. But Sona, I am saying a positive thing, which is I used to hear Sona get on the phone, half the time for me to try and find out what had gone wrong for me. Half the time, he's trying to show you that I did a lot of personal calls. No, and she would get stuff done. And then half the time, or maybe 80% of the time, it would be saying to someone in LA County, I know I went too fast and you gave me a speeding ticket, but you can't F with me. Sona's good at getting out of speeding tickets. Oh my God, no one gets out of speeding tickets like Sona. I have a spotless record and I've gotten a lot of tickets. So you're admitting that you did speed. I did. And so you have a- I'm sorry, when was the date the radar gun was last calibrated? Those are the questions you ask when you fight tickets. You say, hey, how far were you from my car? Where were you parked? Were you parked there for a long time? You're insane. No, this is actually- I got out of every ticket. Matt, I'm telling you, I would hear this stuff on the phone and she got out of every single ticket. And I hear her saying things like, my car's coated in aluminum. So no radar beam can, it was amazing. I don't care. And she always got out of it. It's just not worth it. I got out of a red light camera ticket. They had a video of me going through the red and I still beat that ticket. How did you get out of it? Because I fought it and then it got denied. Then I fought it again, then it got denied. Then I went to court and they lost the video. Why aren't you putting this amount of energy into my goddamn glasses? No, Sona, seriously, David, you do an amazing job. But I think if Sona was on this, those glasses would be here in 40 seconds. Yeah, I could call and yell. Because she would go total crazy apeshit on them in a way that, listen, I don't wish this on you, David. I don't want you to become a monster, but Sona is a monster and she would- Aren't you complimenting me? I don't understand what's happening. I think you're an incredible, I think when King Kong got to the top of the Empire State Building and swatted those biplanes down, it was amazing. You are an out of control, insane person. You're the Kraken. But guess what? You're an amazing Kraken. You're the Loch Ness Monster on crack and you get it done every time. What is this? I don't know if I should say thank you. Get me my glasses. Just say thank you. I don't want to say, I don't know. I don't feel complimented. You will once the drink wears off. Yeah. We gotta get to some pizza art. Why don't you- Yeah, let's get to some pizza art. We spent a lot of time on this. Thank you, David. Thank you. David, thank you. I'll take the info. Thank you for your service. Thank you and you have failed and now Sona will pick up the gauntlet. Let us move on. Summer Smore series is back. Each year we gather around a solo stove fire pit. That's kind of nice. Love you guys. I love you too. I'm okay. I know. Matt and I love each other. Sona is just okay. This year solo stove sent us the bonfire. It's decided to put out some serious heat without putting off that dirty S word. You know what I'm talking about. Smoke. Yeah. Here's what I gotta tell you. The solo stove is uniquely designed to burn off smoke before it ever escapes the top of the fire pit. Once you set around a smokeless fire, you'll never want to go back. Guys, correct me if I'm wrong. I've sat around some fires in my day. Okay. Yeah. Smoke gets in my eyes. I start crying. People think I'm having an emotional breakdown. I'm taken away and put into an institution. There's no smoke here. We've got a nice fire. We've got some heat, but no smoke. That's why we know your crying is actually just emotional and not smokey. Exactly. I'm crying because I'm with two people I love very much. Aw. Oh wait, who's here? It's us. It's me. It's me and Matt. Oh wait, sorry, my glasses weren't on. Anyway, solo stove has multiple different colors. It are portable, so you can take it into the back country. You can go to the beach. You can go up to the top of a mountain. You can go into a deep cave. It looks good. It works great. Plus it has a lifetime warranty, which means we could do easily 7,000 seasons of this show. That's a lot. I'd like to retire at some point. I don't think so. Your family has said they're fine with you working. Anyway, we can do a lot of seasons and that solo stove would keep on cooking. Go check them out at solo stove.com and use promo code Conan to get $10 off your new pit. I am very pleased to introduce my sister-in-law, Sarah Lund. She'll be coming in here in a second. She has taken great pains to create three pizzas with very specific pizza art. Oh, wow. This is something Sarah helped us out last year. She did incredible work using Marshmallow. She's very artistic. Oh yeah, that's what she does for a living. She's an artist and production designer. Yeah, she's terrific. I like her. And so she's going to do, she's going to render some pizza art is what you're saying. And she's done this professionally for Pizza Hut. She's done pizza art. Very cool. Yeah. All right, so I don't quite know what pizza art is. I don't either, but we're about to find out. I'm a little bit, I'm going to say beguiled. Are you? Yeah, I've never been beguiled before in my life. Are you bewitched? I'm bewitched, I'm bewildered. I'm beside myself. I'm behind the times. I am very excited. Sonya, how you doing? I'm all right. How do you feel? Yeah, I'm fine. Do you want a big hug? I can't drink anymore or I will vomit into the solo stove. Can I say one thing? You are crying and your tears are pure rum. Oh, I gotta drink them. I'm excited. Check this out. Oh, what's up? I just got a notification on my phone. There's a new episode of Conan O'Brien needs a friend. Oh, there is. That's incredible. Kelly Clarkson is available. Oh, wow, very good. That's a good one. I like Kelly. Oh, here we go. Oh, it's Sarah Lund, everybody. Sarah, thank you. Nice to see you again. Hi, everyone. Hi. If you want to talk, you can stand by the mic or you can just show off your wares, whatever you like. Hello. Sarah, you did an amazing job last year with the s'mores art, really incredible. Now you're working with pizza, which I think is a much more difficult medium. It is a very difficult medium. In fact, it's only gonna look nice this one time once it goes in the oven. It will become bloated and distorted like my face after 50. Yeah, yeah, pretty much. As she agreed with you. Hey, Sarah, thanks for jumping up and saying, oh no, Conan, you look amazing. Helping us out here, we also have my beautiful wife, Amanda, and my beautiful solo stove representative, DG. Yay. Yes, okay, let's take a look. We've got... All right, should we do the tour? Is it DJ or DG? DG. DG, DG, you money. I thought you said DJ, but it's DG. I did say DG. Who said DG? Yeah, thank you, Sona. You said it right. Thank you. How are you? Oh, ooh. So what are we looking at here? This is Conan. That's me. Is that me or is that Michelangelo's David? I can't tell. Oh, oh my God. These are really good. That's terrific. That's beautiful. Okay, with the hummus. You know what, DG brought out hummus with my pizza and I'm just very upsetting. It's not upsetting, admit it, you like it. Oh, look at him, look at that with his glasses. Oh my God, I wanna punch that pizza. Hey, really? I wanna quit that pizza. You wanna quit that pizza. She's laughing hard at you. Amanda, admit, you'd also like to punch the pizza of your husband. Punching a pizza is funny. I think it was the thought of violence towards your husband that abused you. Stop trying to destroy our already fragile marriage. Okay, let's take a good look at these. These are incredible. You have a, I think that's gorely. What do you mean you think that's gorely? I don't know. I think it's ham hair. You know what, I've often looked at your hair and thought that looks like ham to me and I've several times I've tried to bite it. Sona, you look beautiful in that. Oh yeah, I know, Sarah, thank you. Look at your scallion earring. Oh my God, my earring, I just saw that. It's a scallion? I'm all about that earring life. It's like a green onion. The first two years that I worked with Sona, she used green onions in her ears, but it's more of a superstitious thing. And then let's see the Conan. This is Conan just post surgery. Cheese hair. Color drained from his face. And then you've surrounded me with mushrooms. Not my favorite, but you know what? I like the aesthetic. I think I look pretty. It's all about the aesthetic. And I think you've done it. You've really captured my fear and my self-loathing, my uncertainty and all my genetic frailties in one pizza. And I think you've done, this is beautiful work. It really is. It really is. Very nice. It's really nice, Sarah. Thank you. That was where the other, your twin was. We had to get rid of it. Oh. What's that? What happened to my twin? You were just malformed. You're like separated at birth. My mother, there's family lore that I, was a malformed Conan twin. I think you're the malformed twin. No, I'm saying I'm the malformed one. The really good one went off. That's our, Ryan Reynolds, I think. I can't wait to see these things get cooked and we all get just blistered and mutilated and pizza-warded. Mine's gonna be like a religious experience where mine becomes even more beautiful and that's when you all realize that I am. Oh, maybe you should burn that one. No, oh, come on. Let's be nice here. I've always been nice to you, Sona. Yeah, he brought out hummus with my pizza. I didn't say to do that. I just suggested it be injected into the crust. Oh, okay, well. Only this crude barbarian didn't follow my orders. Fish slot, DG. Should we start with the cruel master himself and put Conan into the 900 degree oven? Yeah. Let's do it. Let's go for it. We'll just leave it there for a while. I just want it to be there for seven days. I hope you sunscreened your pizza because you're about to get blistered. This is nice. She's a very talented woman. Yes. Who's looking after your daughter if your wife's here? We haven't seen her in weeks. Okay, you're a terrible father, but you know what? It's for the podcast, so I approve. And Sona? Yes. Have you checked in on your kids? I have, I just watched them while they were sleeping. You know what's weird? Sona has a camera that looks at her twins when they're sleeping. She also has a camera that looks at me when I'm sleeping. I do too. She did that for years as my assistant. I have to check, make sure that Liza's reading you your bedtime story. And that she's changing your diaper. Liza always read me good night moon. After that she'd read me the final days about Nixon's last days in office. And then I'd be like. That's what we read the boys. Yeah, final days. Mama, mama, read us about Nixon. All right, well Kissinger came and they both prayed. Oh, is that true? Sure, everything I say is true. Okay. That's nice, it's nice to think of them sleeping soundly while you're here, eating pizza and drinking a little too much. Copious realm. I took a break from the drinking. You want a little bit more? I think I was wise. Did you notice the glitter in here? Do you see that? No. I think that's just asbestos. Yeah, I did put a bit in. I think you made this in an old school. I did. That was retrofitted in the 1920s. I found a Nevada bomb shelter. I swear to God, when I was a young lad, I ran track, Newton North High School. That was our arrival. Ran track there many times. Lungs burning. Like a year or two after I graduated, they said they tore down that gymnasium because it was filled with asbestos. And I just want you to think about that. I bet you would have done a lot better if there wasn't asbestos. Yeah. Yeah. Yeah, what a handicap. I used to say to the coach, I think it's the asbestos. I think that's the reason I came at last. And the coach would- You don't wanna go on a date with me? Must be the asbestos. Acne? That's asbestos. Long legs and skinny shoulders? Asbestos! People think my jokes are tired? Asbestos! I used it for, I mean, many, many years of excuses. Didn't like my late night show? Asbestos! The important thing- Oh, come on! You gotta warn us! You gotta warn us. It really does sound like the Tin Man from The Wizard of Oz fell down a well. Keep on your toes, podcasters. Let's go, assholes and elbows. Stay frosty, come on. What did you do in track? You ran? Yeah, I wanted to be a sprinter because I was pretty fast. But then they said, you're so long legged and you're getting so tall. We think you're gonna be really good. And I thought at the mile, and they said, no, the two mile. So I ran the two mile, and that just wasn't fun. And I wasn't any good at it. Paparazzi! As helicopters keep, whenever the paparazzi senses that I'm talking about my glory days as a high school athlete, they circle. And I can't have it. I just can't have it. Do you think it would have been different if you ran just the mile? I think it would have been different if I had just joined the chess club. Oh! Or better yet, the checkers club. Or the spelling bee. Anything would have been better for me. I wasn't meant for that life. I think I knew then that my mind was too important. And that I, to spend all that blood nourishing my muscle would be a waste of time. So at that point in my life, I decided I must sacrifice my athletic skills because one day there was something called a podcast. You decided. Oh, I knew. I knew that one day radio would go away, but then it would come back on this weird computer thing. And I would be there with my muscle-less body. And my giant head and talking face. And I would lead a new revolution that would bring us to the very middle of the podcast and university. You guys? Yeah? Pretty great times. Uh-oh. Oh my God, I feel like you just got a diagnosis. Yeah, this is where I say goodbye. All right. You only? Yep. Okay, we're still here? I have no idea where we are in the firmament of Summers' Moors. We are in the fifth episode of the fourth episode. I messed up. We are in the fourth episode of Summers' Moors. I want you to really actually try to say it. We are in the fourth episode of Summers' Moors. We will have one more outdoor episode and one more in-studio episode. Very good. And we will do it and we will like it. Yes. Okay. Well, thank you very much, Dean Martin of our time. You are a testament. You got him good with that one. No, trust me. Somewhere a 90-year-old man is having a good chuckle. Burn. It is a sick burn that I just gave right now. It's not a sick burn, it's a healthy burn. It's not. Well, I didn't say Foster Brooks and that's an even kookier, smaller reference. So hey, if you're out there and you like my references, come say hi to me at the local mall. I'll be there cutting a ribbon. I have a question. I'm very excited to see the pizza art. We saw it beforehand, but after those flames, those solo pie flames, what will this pizza art look like? We will only find out if you stay tuned. Oh my God. We're gonna see the pizza art fully cooked next episode and we're gonna have a special dessert treat presented by my wife, Amanda. Yay. So what you're saying is that our podcast listeners should keep listening because they can listen to us see uncooked pizzas turn to cooked pizzas. If you stop listening now. Ha ha ha ha ha ha. Ha ha ha ha ha. Ha ha ha ha. Listen up, listeners. You're about to see something that was uncooked. Go to cooked in an audio format. Oh, hang on to your assholes, because here it comes. Ha ha ha ha ha. Ha ha ha ha ha. Ha ha ha ha. All right, Matt, take us home. Okay, let's go home, everybody. Big hugs. Really get in there and snuggle. Everybody's got great legs and we're looking forward to tomorrow. That makes no sense. What? Am I the last person here that's sane? No, I think I am. Yeah, okay. Yeah, you said hold on to your assholes. Yeah, but somebody's talking about this. I would say that any Eduardo. That's me just normal talk. I think he's sobered up a little bit. I'm fine. Sobered up, I was. You stumbled on a few phrases there. Yeah, you did. Of course I did. Because I've got new teeth. Ha ha ha ha ha. Well, I'm sorry, I don't think it's funny that a man my age has to have dentures refitted and I had to have them refitted again tonight. Okay, so now say something sane. Okay, no, wait. Do it now. Stay tuned. Oh, boy. For the next episode. Okay. Summer s'mores and we'll be right back. Okay. And we will see how that cheese melts. And Conan, say something sane. My name is Conan O'Brien and this is Summer S'mores and we're waiting for uncooked pizzas to become cooked pizzas. I am as sober as a judge. Stay tuned. Brian hold. Summer s'mores with Conan O'Brien, Sonam Avsesian and Matt Gourley. Produced by me, Matt Gourley. Executive produced by Adam Sachs, Nick Leal and Jeff Ross at Team Coco and Colin Anderson and Cody Fisher at Earwolf. Theme song by The White Stripes. Incidental music by Jimmy Vivino. Take it away, Jimmy. Our supervising producer is Aaron Blair and our associate talent producer is Jennifer Samples. Engineering by Eduardo Perez. Additional production support by Mars Melnick. Talent booking by Paula Davis, Gina Battista and Brit Kahn. You can rate and review this show on Apple podcasts and you might find your review read on a future episode. Got a question for Conan? Call the Team Coco hotline at 323-451-2821 and leave a message. It too could be featured on a future episode. And if you haven't already, please subscribe to Conan O'Brien Needs a Friend on Apple podcasts, Stitcher or wherever fine podcasts are downloaded."}}, "transcribed_data": {"podcast_title": "Conan O’Brien Needs A Friend", "episode_title": "Summer S’mores with Conan and the Chill Chums Season 3 Episode 4", "episode_image": "https://image.simplecastcdn.com/images/d139afc2-e8b0-4ec2-bc74-fdc3c88f649a/d59c963f-c9dc-41d8-9005-369e80634b3b/3000x3000/screen-shot-2023-05-01-at-12-14-01-pm.jpg?aid=rss_feed", "episode_transcript": " This special episode of Summer S'mores is presented by Solo Stove. Solo Stove is uniquely designed to burn off smoke before it ever escapes the top of the fire pit. Trust us, once you've sat around a smokeless fire, you'll never wanna go back. Go check them out at solostove.com. Use promo code Conan to get $10 off your new pit. Summer S'mores with Conan and the Chill Chums, a six-part series with Conan O'Brien, Sonam Avsesian, and Matt Gourley. Let's get started. Hey! Yeah! Yeah! Yeah! Yeah! Yeah! Yeah! Yeah! Yeah! Why? Do you wanna work someplace else? Because this is pretty stupid, you have to admit. It's so dumb. The mushroom kids, the mushroom kids. We represent the mushroom kids. Why doesn't Gourley set up the pizza art and I'll set up the glasses? Great, so we're starting with the glasses. What should I do, boss? Well, I think you're doing it. Go rob a bank, you hobo. I'm going to that side. I'll start, I'll intro us in, I'll do the YouTube and then Conan over to you for the glasses. I'll kill you. I'll be killed, okay. You got me. Welcome to Summer Chores and... Hey, you okay? Uh-huh. Oh my God, we're not even, not that much time has elapsed and I'm worried about Sona most of all. You should be. You should be. She is drinking a powerful rum drink. Matt, how are you doing? Quickly. You said Summer Chores instead of Summer S'mores. Welcome to Summer Chores with Kobe and the... Okay. We're doing this podcast, Don't You See? I don't think anyone said Don't You See since about 1944. Don't you see? We must win World's War II. The best part is, listeners, you can go to YouTube and check out all kinds of clips from this series. Yeah, if hearing about it doesn't annoy you enough and you wanna see this total meltdown of us outside on this nice veranda. Do you wanna see the three hottest people that you've ever seen in life? We're so fucking sexy. I'm wearing a bikini the size of a doily. Sona, what are you doing with the cord of your headset? I'm doing unibrow. You're doing unibrow? For the YouTube people. Okay, hey YouTube people. Hey YouTube. Dear YouTube. You look fantastic. Thank you. You look amazing. Thank you. Let me see, point it to me. Unibrow. Whoa. Well, I think the important thing is that we're here, we're together, and two of you are wasted. I'd like to point out that I'm a very thoughtful person. Pfft. Pfft. Pfft. Pfft. A very thoughtful person. You're busted, you little dandy. Yeah. No, I am not. I blame the microphone, which is a Krieger, which is not the German brand I prefer. It is Schlutendaden. Anyway, I knew that it was your birthday coming up, and I tried very hard to get you a wonderful, this is for you, Mr. Matt Gourley. Yes. I tried to get you the perfect gift. I conspired, I went online, and I found this place that would sell me mid-century vintage cocktail glasses that looked like pineapples because they have a copper top. They're really cool looking, and they have a built-in straw. And I thought, oh my God, this is so Matt Gourley, and it's also so Summers-Moors. I tried, I ordered these things and paid for them, and now I would like David Hopping to enter the scene, because David, I think you could maybe explain. David! David is my assistant who really does things as opposed to Sona, who pretends to do things. Anyway, so, David. Not an important part of the interview. I'm Martin Murray. You're a whole. Five, five, five. David does your day-to-day assistant duties, and I do big picture. Oh! That's right. What's big picture? Yes, no, you know, when I'm planning to launch satellites, my purchase of, you know what? I have to say, when I tried to outbid Elon Musk for Twitter, Sona was instrumental. The big picture. Yeah, I'm a big picture. But anyway, do us a favor and tell us, Mr. Hopping, what's the status, because first of all, take us through it, because we've talked about this before, but I ordered these glasses, and I was really excited for them to come, and then they weren't showing up, and then you told me there was a problem, and then you said an investigation has been launched. Yeah, it's kind of exciting. Ooh, a little bit. Let's hear about it. Um, so, they're not here. That's pretty exciting. That's my favorite part of the story. They're missing. I did check earlier, and now it says that a claim has been filed, and now it says that I need to contact the seller, so basically we ordered these from like, not eBay, but like and eBay. What do you mean, like and eBay? So it's like from a seller. F-bay? Like, I was like messaging the girls, what? It's called sap.com, and yeah, it's not good. She seems really nice, though. Can I ask you a question? Yeah. My money's gone through, yes? So you're out of pocket at this point. So I am out of pocket. And David, just to be perfectly honest, these weren't cheap. No. Okay, so I am out of pocket, this amount of money, and yet right now we're just hearing these vague claims that there's an investigation, right? Like we can see every step of the journey the package went on. Like it went from Connecticut to New Jersey to something called Bell, California, that sounds nice. That's hilarious. Then it went out for delivery, and then just. Vanished. So now what is that, in your opinion, David, and I know that you're a very good detective, what do you think happened to the glasses if you had to guess? Do you think someone stole them along the way or do you think it's an innocent accident? I mean, I don't wanna accuse anyone of stealing, but I think they were stolen. Let's be clear, the real tragedy is I've turned 50 years old and I am weeks without gift. Yeah. And I'll tell you, I don't know how much longer I can hold on. Yeah. Well, first of all, it's not just without gift, you're weeks without twee cocktail glasses. Exactly. From the 1950s. My reason for living. Yeah, exactly. This is, an injustice has been done, good money has been spent, you know how hard I work and how much I deserve the money that I make, and you know that this is a crime. This is a terrible crime against a great American who has brought laughter to people for 30 years. Makes it about himself. When do we expect a resolution? Yes, thank you, David. Oh, you know what, Matt, I apologize. I did momentarily make it about myself and I'm sorry. And I just want you to know that Conan O'Brien is sorry for the loss of the glasses that Conan O'Brien got you. When can we expect a resolution? The investigation was supposed to end two days ago. Two days ago. And there's no update. What investigation? There's no Inspector Clouseau out there. Who's investigating? The UPS is investigating themselves. The UPS? Oh, this is ridiculous. You know what, I'm sorry, David, I don't wanna throw you under the bus, but I would pretend that this happened if I forgot to order something. And then I would have- Oh my God, did you do that, David? You have receipts. I would pull them up, but then everyone would see how much you paid. Hey, you're in this big picture, why don't you get on this? Yeah. Oh, yes. Sona, Sona, Sona, let me ask you a question. How would you- I would call UPS. And what would you do? I would give them a piece of my mind. Let's role play that. Hi, this is UPS. Hi, UPS. This is Sona. I'm calling from, you may have heard of him, Conan O'Brien's office. Never once heard of him. Okay. Well, we had a package. Okay. And guess what? They never showed up. This is your literal job, UPS, to just deliver this shit. You're right. Where is it? What's in the package? It doesn't matter what's in the package. You're right. How can I locate it without the contents, you dill? Why do you need the contents? You dill? Well, you should be asking me for my tracking number. Do you even work for UPS? No. You dill? I'm a temp, you dill. Who did I call? Can I ask you a question? Yeah, you dill weed. Your biggest insult is comparing someone to a pickle? Yeah. Wow, what happened to UPS? I'll tell you what. We don't lose packages here at UPS. All right, okay. Oh, no. I'm dealing with fools. No, I would call and get angry. I will say something, David. I'll do it for you. David, can I, David, you do a great job. But Sona's the OG. And Sona has a temper that is off the charts. Get on this. Sona. It started nice. But Sona, I am saying a positive thing, which is I used to hear Sona get on the phone, half the time for me to try and find out what had gone wrong for me. Half the time, he's trying to show you that I did a lot of personal calls. No, and she would get stuff done. And then half the time, or maybe 80% of the time, it would be saying to someone in LA County, I know I went too fast and you gave me a speeding ticket, but you can't F with me. Sona's good at getting out of speeding tickets. Oh my God, no one gets out of speeding tickets like Sona. I have a spotless record and I've gotten a lot of tickets. So you're admitting that you did speed. I did. And so you have a- I'm sorry, when was the date the radar gun was last calibrated? Those are the questions you ask when you fight tickets. You say, hey, how far were you from my car? Where were you parked? Were you parked there for a long time? You're insane. No, this is actually- I got out of every ticket. Matt, I'm telling you, I would hear this stuff on the phone and she got out of every single ticket. And I hear her saying things like, my car's coated in aluminum. So no radar beam can, it was amazing. I don't care. And she always got out of it. It's just not worth it. I got out of a red light camera ticket. They had a video of me going through the red and I still beat that ticket. How did you get out of it? Because I fought it and then it got denied. Then I fought it again, then it got denied. Then I went to court and they lost the video. Why aren't you putting this amount of energy into my goddamn glasses? No, Sona, seriously, David, you do an amazing job. But I think if Sona was on this, those glasses would be here in 40 seconds. Yeah, I could call and yell. Because she would go total crazy apeshit on them in a way that, listen, I don't wish this on you, David. I don't want you to become a monster, but Sona is a monster and she would- Aren't you complimenting me? I don't understand what's happening. I think you're an incredible, I think when King Kong got to the top of the Empire State Building and swatted those biplanes down, it was amazing. You are an out of control, insane person. You're the Kraken. But guess what? You're an amazing Kraken. You're the Loch Ness Monster on crack and you get it done every time. What is this? I don't know if I should say thank you. Get me my glasses. Just say thank you. I don't want to say, I don't know. I don't feel complimented. You will once the drink wears off. Yeah. We gotta get to some pizza art. Why don't you- Yeah, let's get to some pizza art. We spent a lot of time on this. Thank you, David. Thank you. David, thank you. I'll take the info. Thank you for your service. Thank you and you have failed and now Sona will pick up the gauntlet. Let us move on. Summer Smore series is back. Each year we gather around a solo stove fire pit. That's kind of nice. Love you guys. I love you too. I'm okay. I know. Matt and I love each other. Sona is just okay. This year solo stove sent us the bonfire. It's decided to put out some serious heat without putting off that dirty S word. You know what I'm talking about. Smoke. Yeah. Here's what I gotta tell you. The solo stove is uniquely designed to burn off smoke before it ever escapes the top of the fire pit. Once you set around a smokeless fire, you'll never want to go back. Guys, correct me if I'm wrong. I've sat around some fires in my day. Okay. Yeah. Smoke gets in my eyes. I start crying. People think I'm having an emotional breakdown. I'm taken away and put into an institution. There's no smoke here. We've got a nice fire. We've got some heat, but no smoke. That's why we know your crying is actually just emotional and not smokey. Exactly. I'm crying because I'm with two people I love very much. Aw. Oh wait, who's here? It's us. It's me. It's me and Matt. Oh wait, sorry, my glasses weren't on. Anyway, solo stove has multiple different colors. It are portable, so you can take it into the back country. You can go to the beach. You can go up to the top of a mountain. You can go into a deep cave. It looks good. It works great. Plus it has a lifetime warranty, which means we could do easily 7,000 seasons of this show. That's a lot. I'd like to retire at some point. I don't think so. Your family has said they're fine with you working. Anyway, we can do a lot of seasons and that solo stove would keep on cooking. Go check them out at solo stove.com and use promo code Conan to get $10 off your new pit. I am very pleased to introduce my sister-in-law, Sarah Lund. She'll be coming in here in a second. She has taken great pains to create three pizzas with very specific pizza art. Oh, wow. This is something Sarah helped us out last year. She did incredible work using Marshmallow. She's very artistic. Oh yeah, that's what she does for a living. She's an artist and production designer. Yeah, she's terrific. I like her. And so she's going to do, she's going to render some pizza art is what you're saying. And she's done this professionally for Pizza Hut. She's done pizza art. Very cool. Yeah. All right, so I don't quite know what pizza art is. I don't either, but we're about to find out. I'm a little bit, I'm going to say beguiled. Are you? Yeah, I've never been beguiled before in my life. Are you bewitched? I'm bewitched, I'm bewildered. I'm beside myself. I'm behind the times. I am very excited. Sonya, how you doing? I'm all right. How do you feel? Yeah, I'm fine. Do you want a big hug? I can't drink anymore or I will vomit into the solo stove. Can I say one thing? You are crying and your tears are pure rum. Oh, I gotta drink them. I'm excited. Check this out. Oh, what's up? I just got a notification on my phone. There's a new episode of Conan O'Brien needs a friend. Oh, there is. That's incredible. Kelly Clarkson is available. Oh, wow, very good. That's a good one. I like Kelly. Oh, here we go. Oh, it's Sarah Lund, everybody. Sarah, thank you. Nice to see you again. Hi, everyone. Hi. If you want to talk, you can stand by the mic or you can just show off your wares, whatever you like. Hello. Sarah, you did an amazing job last year with the s'mores art, really incredible. Now you're working with pizza, which I think is a much more difficult medium. It is a very difficult medium. In fact, it's only gonna look nice this one time once it goes in the oven. It will become bloated and distorted like my face after 50. Yeah, yeah, pretty much. As she agreed with you. Hey, Sarah, thanks for jumping up and saying, oh no, Conan, you look amazing. Helping us out here, we also have my beautiful wife, Amanda, and my beautiful solo stove representative, DG. Yay. Yes, okay, let's take a look. We've got... All right, should we do the tour? Is it DJ or DG? DG. DG, DG, you money. I thought you said DJ, but it's DG. I did say DG. Who said DG? Yeah, thank you, Sona. You said it right. Thank you. How are you? Oh, ooh. So what are we looking at here? This is Conan. That's me. Is that me or is that Michelangelo's David? I can't tell. Oh, oh my God. These are really good. That's terrific. That's beautiful. Okay, with the hummus. You know what, DG brought out hummus with my pizza and I'm just very upsetting. It's not upsetting, admit it, you like it. Oh, look at him, look at that with his glasses. Oh my God, I wanna punch that pizza. Hey, really? I wanna quit that pizza. You wanna quit that pizza. She's laughing hard at you. Amanda, admit, you'd also like to punch the pizza of your husband. Punching a pizza is funny. I think it was the thought of violence towards your husband that abused you. Stop trying to destroy our already fragile marriage. Okay, let's take a good look at these. These are incredible. You have a, I think that's gorely. What do you mean you think that's gorely? I don't know. I think it's ham hair. You know what, I've often looked at your hair and thought that looks like ham to me and I've several times I've tried to bite it. Sona, you look beautiful in that. Oh yeah, I know, Sarah, thank you. Look at your scallion earring. Oh my God, my earring, I just saw that. It's a scallion? I'm all about that earring life. It's like a green onion. The first two years that I worked with Sona, she used green onions in her ears, but it's more of a superstitious thing. And then let's see the Conan. This is Conan just post surgery. Cheese hair. Color drained from his face. And then you've surrounded me with mushrooms. Not my favorite, but you know what? I like the aesthetic. I think I look pretty. It's all about the aesthetic. And I think you've done it. You've really captured my fear and my self-loathing, my uncertainty and all my genetic frailties in one pizza. And I think you've done, this is beautiful work. It really is. It really is. Very nice. It's really nice, Sarah. Thank you. That was where the other, your twin was. We had to get rid of it. Oh. What's that? What happened to my twin? You were just malformed. You're like separated at birth. My mother, there's family lore that I, was a malformed Conan twin. I think you're the malformed twin. No, I'm saying I'm the malformed one. The really good one went off. That's our, Ryan Reynolds, I think. I can't wait to see these things get cooked and we all get just blistered and mutilated and pizza-warded. Mine's gonna be like a religious experience where mine becomes even more beautiful and that's when you all realize that I am. Oh, maybe you should burn that one. No, oh, come on. Let's be nice here. I've always been nice to you, Sona. Yeah, he brought out hummus with my pizza. I didn't say to do that. I just suggested it be injected into the crust. Oh, okay, well. Only this crude barbarian didn't follow my orders. Fish slot, DG. Should we start with the cruel master himself and put Conan into the 900 degree oven? Yeah. Let's do it. Let's go for it. We'll just leave it there for a while. I just want it to be there for seven days. I hope you sunscreened your pizza because you're about to get blistered. This is nice. She's a very talented woman. Yes. Who's looking after your daughter if your wife's here? We haven't seen her in weeks. Okay, you're a terrible father, but you know what? It's for the podcast, so I approve. And Sona? Yes. Have you checked in on your kids? I have, I just watched them while they were sleeping. You know what's weird? Sona has a camera that looks at her twins when they're sleeping. She also has a camera that looks at me when I'm sleeping. I do too. She did that for years as my assistant. I have to check, make sure that Liza's reading you your bedtime story. And that she's changing your diaper. Liza always read me good night moon. After that she'd read me the final days about Nixon's last days in office. And then I'd be like. That's what we read the boys. Yeah, final days. Mama, mama, read us about Nixon. All right, well Kissinger came and they both prayed. Oh, is that true? Sure, everything I say is true. Okay. That's nice, it's nice to think of them sleeping soundly while you're here, eating pizza and drinking a little too much. Copious realm. I took a break from the drinking. You want a little bit more? I think I was wise. Did you notice the glitter in here? Do you see that? No. I think that's just asbestos. Yeah, I did put a bit in. I think you made this in an old school. I did. That was retrofitted in the 1920s. I found a Nevada bomb shelter. I swear to God, when I was a young lad, I ran track, Newton North High School. That was our arrival. Ran track there many times. Lungs burning. Like a year or two after I graduated, they said they tore down that gymnasium because it was filled with asbestos. And I just want you to think about that. I bet you would have done a lot better if there wasn't asbestos. Yeah. Yeah. Yeah, what a handicap. I used to say to the coach, I think it's the asbestos. I think that's the reason I came at last. And the coach would- You don't wanna go on a date with me? Must be the asbestos. Acne? That's asbestos. Long legs and skinny shoulders? Asbestos! People think my jokes are tired? Asbestos! I used it for, I mean, many, many years of excuses. Didn't like my late night show? Asbestos! The important thing- Oh, come on! You gotta warn us! You gotta warn us. It really does sound like the Tin Man from The Wizard of Oz fell down a well. Keep on your toes, podcasters. Let's go, assholes and elbows. Stay frosty, come on. What did you do in track? You ran? Yeah, I wanted to be a sprinter because I was pretty fast. But then they said, you're so long legged and you're getting so tall. We think you're gonna be really good. And I thought at the mile, and they said, no, the two mile. So I ran the two mile, and that just wasn't fun. And I wasn't any good at it. Paparazzi! As helicopters keep, whenever the paparazzi senses that I'm talking about my glory days as a high school athlete, they circle. And I can't have it. I just can't have it. Do you think it would have been different if you ran just the mile? I think it would have been different if I had just joined the chess club. Oh! Or better yet, the checkers club. Or the spelling bee. Anything would have been better for me. I wasn't meant for that life. I think I knew then that my mind was too important. And that I, to spend all that blood nourishing my muscle would be a waste of time. So at that point in my life, I decided I must sacrifice my athletic skills because one day there was something called a podcast. You decided. Oh, I knew. I knew that one day radio would go away, but then it would come back on this weird computer thing. And I would be there with my muscle-less body. And my giant head and talking face. And I would lead a new revolution that would bring us to the very middle of the podcast and university. You guys? Yeah? Pretty great times. Uh-oh. Oh my God, I feel like you just got a diagnosis. Yeah, this is where I say goodbye. All right. You only? Yep. Okay, we're still here? I have no idea where we are in the firmament of Summers' Moors. We are in the fifth episode of the fourth episode. I messed up. We are in the fourth episode of Summers' Moors. I want you to really actually try to say it. We are in the fourth episode of Summers' Moors. We will have one more outdoor episode and one more in-studio episode. Very good. And we will do it and we will like it. Yes. Okay. Well, thank you very much, Dean Martin of our time. You are a testament. You got him good with that one. No, trust me. Somewhere a 90-year-old man is having a good chuckle. Burn. It is a sick burn that I just gave right now. It's not a sick burn, it's a healthy burn. It's not. Well, I didn't say Foster Brooks and that's an even kookier, smaller reference. So hey, if you're out there and you like my references, come say hi to me at the local mall. I'll be there cutting a ribbon. I have a question. I'm very excited to see the pizza art. We saw it beforehand, but after those flames, those solo pie flames, what will this pizza art look like? We will only find out if you stay tuned. Oh my God. We're gonna see the pizza art fully cooked next episode and we're gonna have a special dessert treat presented by my wife, Amanda. Yay. So what you're saying is that our podcast listeners should keep listening because they can listen to us see uncooked pizzas turn to cooked pizzas. If you stop listening now. Ha ha ha ha ha ha. Ha ha ha ha ha. Ha ha ha ha. Listen up, listeners. You're about to see something that was uncooked. Go to cooked in an audio format. Oh, hang on to your assholes, because here it comes. Ha ha ha ha ha. Ha ha ha ha ha. Ha ha ha ha. All right, Matt, take us home. Okay, let's go home, everybody. Big hugs. Really get in there and snuggle. Everybody's got great legs and we're looking forward to tomorrow. That makes no sense. What? Am I the last person here that's sane? No, I think I am. Yeah, okay. Yeah, you said hold on to your assholes. Yeah, but somebody's talking about this. I would say that any Eduardo. That's me just normal talk. I think he's sobered up a little bit. I'm fine. Sobered up, I was. You stumbled on a few phrases there. Yeah, you did. Of course I did. Because I've got new teeth. Ha ha ha ha ha. Well, I'm sorry, I don't think it's funny that a man my age has to have dentures refitted and I had to have them refitted again tonight. Okay, so now say something sane. Okay, no, wait. Do it now. Stay tuned. Oh, boy. For the next episode. Okay. Summer s'mores and we'll be right back. Okay. And we will see how that cheese melts. And Conan, say something sane. My name is Conan O'Brien and this is Summer S'mores and we're waiting for uncooked pizzas to become cooked pizzas. I am as sober as a judge. Stay tuned. Brian hold. Summer s'mores with Conan O'Brien, Sonam Avsesian and Matt Gourley. Produced by me, Matt Gourley. Executive produced by Adam Sachs, Nick Leal and Jeff Ross at Team Coco and Colin Anderson and Cody Fisher at Earwolf. Theme song by The White Stripes. Incidental music by Jimmy Vivino. Take it away, Jimmy. Our supervising producer is Aaron Blair and our associate talent producer is Jennifer Samples. Engineering by Eduardo Perez. Additional production support by Mars Melnick. Talent booking by Paula Davis, Gina Battista and Brit Kahn. You can rate and review this show on Apple podcasts and you might find your review read on a future episode. Got a question for Conan? Call the Team Coco hotline at 323-451-2821 and leave a message. It too could be featured on a future episode. And if you haven't already, please subscribe to Conan O'Brien Needs a Friend on Apple podcasts, Stitcher or wherever fine podcasts are downloaded."}, "podcast_summary": "- TL;DR: In this episode, Conan, Sonam, and Matt are joined by Sarah Lund, who creates pizza art using various toppings.\n- Sarah creates pizza art featuring Conan, Matt, and Sona using hummus, cheese, scallions, and more.\n- The pizzas are put in the oven, and the results will be revealed in the next episode.\n- Conan reminisces about his high school track days and his decision to prioritize his mind over athleticism.\n- Stay tuned for the next episode to find out how the pizzas turn out and for a special dessert treat.", "podcast_guest": "Matt Gourley", "podcast_highlights": "Chapter 1: The Missing Glasses\n\nChapter 2: Summer Chores with Conan and the Chill Chums\n\nChapter 3: The Investigation\n\nChapter 4: Pizza Art and Solo Stove\n\nChapter 5: Cooking the Pizza Art\n\nChapter 6: The Finale and Teaser for Next Episode"}