{"podcast_details": {"podcast_details": {"title": "The Infinite Monkey Cage", "title_detail": {"type": "text/plain", "language": null, "base": "https://podcasts.files.bbci.co.uk/b00snr0w.rss", "value": "The Infinite Monkey Cage"}, "links": [{"rel": "alternate", "type": "text/html", "href": "http://www.bbc.co.uk/programmes/b00snr0w"}, {"href": "http://www.bbc.co.uk/programmes/b00snr0w/episodes/downloads.rss", "rel": "self", "type": "application/rss+xml"}], "link": "http://www.bbc.co.uk/programmes/b00snr0w", "subtitle": "Brian Cox and Robin Ince host a witty, irreverent look at the world through scientists' eyes.", "subtitle_detail": {"type": "text/html", "language": null, "base": "https://podcasts.files.bbci.co.uk/b00snr0w.rss", "value": "Brian Cox and Robin Ince host a witty, irreverent look at the world through scientists' eyes."}, "summary": "Brian Cox and Robin Ince host a witty, irreverent look at the world through scientists' eyes.", "summary_detail": {"type": "text/plain", "language": null, "base": "https://podcasts.files.bbci.co.uk/b00snr0w.rss", "value": "Brian Cox and Robin Ince host a witty, irreverent look at the world through scientists' eyes."}, "authors": [{"name": "BBC", "email": "podcast.support@bbc.co.uk"}], "author": "BBC", "author_detail": {"name": "BBC", "email": "podcast.support@bbc.co.uk"}, "itunes_type": "episodic", "publisher_detail": {"name": "BBC", "email": "podcast.support@bbc.co.uk"}, "itunes_new-feed-url": "https://podcasts.files.bbci.co.uk/b00snr0w.rss", "language": "en", "ppg_seriesdetails": {"frequency": "weekly", "dayslive": "-1"}, "ppg_systemref": {"systemid": "pid.format", "key": "PT017"}, "ppg_network": {"id": "radio4", "name": "BBC Radio 4"}, "image": {"href": "http://ichef.bbci.co.uk/images/ic/3000x3000/p0c7h4qk.jpg"}, "rights": "(C) BBC 2023", "rights_detail": {"type": "text/plain", "language": null, "base": "https://podcasts.files.bbci.co.uk/b00snr0w.rss", "value": "(C) BBC 2023"}, "published": "Sat, 05 Aug 2023 18:15:00 +0000", "published_parsed": [2023, 8, 5, 18, 15, 0, 5, 217, 0], "tags": [{"term": "Science", "scheme": "http://www.itunes.com/", "label": null}, {"term": "Comedy", "scheme": "http://www.itunes.com/", "label": null}], "itunes_explicit": null, "media_rating": {"scheme": "urn:simple", "content": "nonadult"}, "rating": "nonadult"}, "first_episode": {"title": "Cosmic Dust", "title_detail": {"type": "text/plain", "language": null, "base": "https://podcasts.files.bbci.co.uk/b00snr0w.rss", "value": "Cosmic Dust"}, "summary": "Brian Cox and Robin Ince find out about dust that is raining down on Earth from space. They are joined by planetary scientists Matthew Genge and Penny Wozniakiewicz and comedian Alan Davies. They learn how billions of tiny micrometeorites land on the surface of the Earth every year, hidden amongst pollution particles and household dust. Where does cosmic dust come from and what can it tell us about the birth of the solar system?\n\nNew episodes are released on Saturdays. If you're in the UK, listen to the full series first on BBC Sounds: bbc.in/3K3JzyF\n\nProducer: Caroline Steel\nExecutive Producer: Alexandra Feachem", "summary_detail": {"type": "text/html", "language": null, "base": "https://podcasts.files.bbci.co.uk/b00snr0w.rss", "value": "Brian Cox and Robin Ince find out about dust that is raining down on Earth from space. They are joined by planetary scientists Matthew Genge and Penny Wozniakiewicz and comedian Alan Davies. They learn how billions of tiny micrometeorites land on the surface of the Earth every year, hidden amongst pollution particles and household dust. Where does cosmic dust come from and what can it tell us about the birth of the solar system?\n\nNew episodes are released on Saturdays. If you're in the UK, listen to the full series first on BBC Sounds: bbc.in/3K3JzyF\n\nProducer: Caroline Steel\nExecutive Producer: Alexandra Feachem"}, "subtitle": "Brian Cox and Robin Ince find out about mysterious dust from space.", "subtitle_detail": {"type": "text/plain", "language": null, "base": "https://podcasts.files.bbci.co.uk/b00snr0w.rss", "value": "Brian Cox and Robin Ince find out about mysterious dust from space."}, "content": [{"type": "text/plain", "language": null, "base": "https://podcasts.files.bbci.co.uk/b00snr0w.rss", "value": "Brian Cox and Robin Ince find out about dust that is raining down on Earth from space. They are joined by planetary scientists Matthew Genge and Penny Wozniakiewicz and comedian Alan Davies. They learn how billions of tiny micrometeorites land on the surface of the Earth every year, hidden amongst pollution particles and household dust. Where does cosmic dust come from and what can it tell us about the birth of the solar system?\n\nNew episodes are released on Saturdays. If you're in the UK, listen to the full series first on BBC Sounds: bbc.in/3K3JzyF\n\nProducer: Caroline Steel\nExecutive Producer: Alexandra Feachem"}], "published": "Sat, 05 Aug 2023 18:15:00 +0000", "published_parsed": [2023, 8, 5, 18, 15, 0, 5, 217, 0], "itunes_duration": "2563", "links": [{"length": "41008000", "type": "audio/mpeg", "href": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p0fwf3xq.mp3", "rel": "enclosure"}, {"rel": "alternate", "type": "text/html", "href": "http://www.bbc.co.uk/programmes/p0fwwxq7"}], "ppg_enclosurelegacy": {"url": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p0fwf3xq.mp3", "length": "41008000", "type": "audio/mpeg"}, "ppg_enclosuresecure": {"url": "https://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/https/vpid/p0fwf3xq.mp3", "length": "41008000", "type": "audio/mpeg"}, "id": "urn:bbc:podcast:p0fwwxq7", "guidislink": false, "link": "http://www.bbc.co.uk/programmes/p0fwwxq7", "itunes_explicit": false, "media_content": [{"url": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p0fwf3xq.mp3", "filesize": "41008000", "type": "audio/mpeg", "medium": "audio", "expression": "full", "duration": "2563"}], "authors": [{"name": "BBC Radio 4"}], "author": "BBC Radio 4", "author_detail": {"name": "BBC Radio 4"}, "ppg_canonical": "/programmes/p0fwwxq7"}, "transcribed_data": {"podcast_title": "The Infinite Monkey Cage", "episode_title": "Cosmic Dust", "episode_image": "http://ichef.bbci.co.uk/images/ic/3000x3000/p0c7h4qk.jpg", "episode_transcript": " This is the BBC. This podcast is supported by advertising outside the UK. BBC Sounds music radio podcasts. Hello, I'm Brian Cox. I'm Robin Ince and welcome to the final episode of the 27th series of the Infinite Monkey Cage. Now, if you're listening to Monkey Cage in order, you'll be expecting an episode on AI. But due to unforeseen circumstances, that's not what we're doing. But we couldn't edit it out of the introduction we did last week. And therefore, I've got to mention it to explain to you why we're not doing AI. Though actually what happened was the super intelligent AI we used to create this show couldn't deal with the self-referential nature of the demand of writing a show on AI, using AI, and disappeared up its own serial port. Actually, I guess it wasn't available. So we'll be returning to it next week. That's not actually why our guest was available but has not yet become sentient. Which again is one of those annoying things. This AI business, right, I read the Daily Express and I was told that the robot overlords will be in charge by now. Well, they're not. Blinking Daily Express yet again with its false promises of robot overlords. Anyway, today we've been saved by the age-old practice of looking to the heavens for inspiration. And there you can see that Brian, of course, immediately moving from science there into finding Jesus in much the same way that last week he found the skull of Mary Magdalene. Frankly, this series has gone down a very different route to the one that I thought. And if you're thinking, is there going to be a reboot of Harry Seacombs Highway starring Brian Cox, highly possible. What a niche reference. I don't think so. It's niche. They've got it. Don't call the audience niche. This is as broad as they get round here. You should come to one of those Radio 3 free jazz concerts. Then you'll see niche. No-one even knows when the gig started and the tuning up stopped. And for the younger members of our audience, below the age of 60... We don't have anyone below the age of 60! Anyway, I've not found Jesus. I've found dust. Which is not surprising because he doesn't pay his servants enough. Does he have servants? Of course he does. Things have worked out well. He pays the old lady three shillings and sixpence. He hasn't even told her about despilization. Disgusting. No, I've found dust because today we're exploring cosmic dust. What does the rain of dust from space that falls onto Earth every day tell us? No, you're not doing that properly. You should do it like you do it on the TV. What does the rain of dust from space, the glittering and glimmering fragments, motes of dust that twinkle in the imagination, extinguished by the dark? Ah... Yeah, I like that. APPLAUSE And what does that dust tell us? About the origin and evolution of our solar system, the planets and perhaps even life. To help us understand, we're joined by two scientists who know an enormous amount about very, very small things and someone who knows a very, very small amount but about everything else. And they are... They are! I'm Matthew Gensch and I am a planetary scientist at Imperial College in London. And the most wonderful thing that I've ever found from space was a rock from Mars. Ooh! In Antarctica. I've flexed. And I'm Penny Vosgenkevich. I'm also a planetary scientist from the University of Kent. And the most wonderful thing that I have found from outer space are impact craters on spacecraft that have been hit by tiny pieces of dust at really high speed. Ooh! Scary. Lot of pressure, Alan. Yeah. Yeah. Hello, everyone. I'm Alan Davies. I have a BA in drama from the University of Kent. And the most wonderful thing I've found from space is... Do you remember that ball that Harry Kane put over the bar in the World Cup? It landed in my garden about three weeks ago. And this is our panel. Penny, let's start with the definition. So what do we mean by cosmic dust? Ooh. Why did you start with that? OK. Sorry. I love the shock there. After an introduction today, we're going to be talking about cosmic dust. I cannot believe they've asked me what cosmic dust is. I know! I know! Can we just rule out that you buy it in a wrap from someone at a party? It's not that sort of thing. No. Before I go down the wrong rabbit hole altogether, it's not that sort of thing. No. If you find a planetary scientist who settles you, cosmic dust, at a party, it probably is cosmic dust. So don't sniff it. No. So cosmic dust is essentially dust from space. So dust that doesn't come from Earth, but has come from, in the most likely case, from comets or from asteroids. I always refer to cosmic dust as anything that's from space, whether it's landed on the surface or not. I'm going to have Matt tell me off now, I feel. No. No, no, no. Not at all. But we will discuss it later. Yes. Exactly. Do you want more? Yes. But I like the way you delivered that like an episode of Call My Bluff. Well, that's one definition there of cosmic dust. Let's see what Matt has to say. But that is, I mean, the idea of dust from space, that dust is able to pass to the ground, to me, it sounds quite remarkable that such a thing is possible to detect. So the weird thing about cosmic dust, though, is we only call it cosmic dust once it's landed on Earth and we've found it. Before that, you call it a micrometeoroid. What size of grains are we talking about? So we're talking about grains that are less than two millimetres in size. So that's what we call dust. And they are had to be dust particles in space. The Earth moves through a very tenuous cloud of dust called the zodiacal cloud. It sounds much more exciting than it is, very, very thin. And we sweep up that dust and it lands on Earth. And how many of these small sub millimetre particles are there? OK, so it's estimated that each year per metre squared, let's say, so per metre squared on the Earth's surface, you'll have about six micrometeorites or pieces of cosmic dust arrive at the surface of the Earth. How much of the cosmic dust is made up of the dead skin of aliens? It's quite a remarkable thought, though. So about six of these particles on the average per square metre. Per year. So that means that the roof of your house is covered in cosmic dust. So what it means is they are everywhere. They surround us. There are cosmic dust particles in this room right now. Some of the audience, some of the listeners at home will have cosmic dust on their clothes. It doesn't mean you're dirty or anything. It just means you're special. They are absolutely everywhere. But then surrounding us are millions and millions and millions of ordinary terrestrial dust particles, especially in my house. I like the fact you've turned this into a soap powder advert. I can get the blood and the egg and the sweat out of my football shirt, but I can't seem to get the cosmic dust out of it. So do you have a special dust pan that you go around with? Because it sounds like it'd be tricky to tell our normal Earth dust from the special space dust when you're sweeping up. I mean, I assume you have a pan. Is it not a pan? Actually, yes. You do? I do, because I'm a bit lazy. I went to the Antarctic and I collected dust. That's not lazy, is it? No. How does he get out of his job? He goes off to the Antarctic like every other lazy bugger. It's not as if I walked or anything. I flew. But I was lazy because I was collecting cosmic dust. And I found this layer just below the snow that was just dust. And so I got a plastic bag and just sweeped it into the plastic bag. It took me about 10 seconds. And I've been studying that for the last 10 years. Had it been there for ages? Oh, at least 700,000 years, because there's tiny little droplets inside that were made by this big impact that happened 700,000 years ago, probably in the Mekong Delta in Vietnam. And it scattered debris over most of the planet, including Antarctica. What are the different kind of tricks of detection to make sure that it's not just general dust and that it's cosmic dust? So the proper answer to that is we know that this stuff has been in space, because when something is in space, it's exposed to radiation from the sun. And it's exposed more to radiation from the rest of the galaxy. And that radiation generates new radioactive isotopes that decay really quickly. So if you find them, then that thing has been exposed to radiation in space relatively recently. And as soon as I mention radiation, everybody goes, oh my God, the amounts of radiation we're talking about are so tiny that actually radiation in the environment, you know, from your watch, from your mobile phone, is actually worse than the radiation from cosmic dust. So what you've actually done there is double people's paranoia. Yeah, I know. So if you know what you're looking for, then, is it going to be a little bit more difficult to find radiation in space? What are you looking for then? Then in principle, you could gather dust from the roof of your house or whatever it is. And in principle, you could sift through it and find it by eye if you know what you're looking for. More than in principle, we've done this. We've collected dust on rooftops and we've gone through it. It takes a long time to go through it because there's loads and loads of ordinary earth dust up there. And we found the tiny little melted droplets that come through the atmosphere. Penny, you've been doing this. Where have you been collecting again? Canterbury Cathedral. So you found proper heavenly dust. I have, yes. At the time, it was just a dustpan and brush. But we have upgraded. We now have our own vacuum cleaner. It's brilliant. So we have a project where we're going to be going to some of the other cathedrals across the UK and trying to collect them there. Why in particular cathedral roofs? There are scientific reasons as well as just wanting to get onto a roof that's really cool. So scientifically, the cathedral roofs are very old and they have very good records as to the types of activities that have been going on around them and whether they've had changes, if they've had bits of roofing repaired, if they've had welding going on nearby. So you know what to look out for when you're doing your searches for these particles in terms of like the terrestrial dust that we've been generating in the area. This is really helping with your reboot of Harry Seacombe's Highway as well, because now you can pretend there's a scientific reason that you're at Winchester Cathedral before you start playing If I Ruled the World on your Wurlitzer. You're really going for that younger demographic. I really am, yeah, yeah, yeah. What are the sources of this dust? Well, we think that most of the dust comes from asteroids. They are generated by, in the case of asteroids, it's likely to be impacts between different asteroids, pieces of asteroid. Each impact liberates a huge number of tiny particles that can then pass around, orbit around the sun, and some of them eventually come into contact with the Earth. Similarly with comets, I think we've probably seen comets going past and they've got these nice tails behind them. So one of those particular tails, it's called a dust tail, and that's dust being liberated from the surface because as it gets closer to the sun, comets are made of icy and rocky material and that ice starts to change into vapor instantaneously, and the dust that it was once holding together is then let go and it forms this tail. And again, those particles are then swirling around the solar system, causing a hazard or coming to Earth. Does this worry you at all, Alan, in terms of space exploration? The dusty hazards? Yeah, I'm very interested in the potential damage. We're all going to have to leave, you know, the Earth's not going to last forever. We're going to all have to get in ships and leave, and we need to know what's in the way. I think there are other things to worry about before that. I mean, we're talking about at least a billion years hence. Yeah, but it's good to plan ahead though. Now, you've got some... First of all, can you just tell me what this is that you're about to show us? So at the University of Kent, we have a facility called a light gas gun. Essentially, it allows us to take small objects about the size of micrometeorites that we're interested in and shoot them really fast to the kind of speeds that you might encounter if you're in space and you get hit by one. The gun, it's about seven kilometres a second. So what I've got here is some aluminium plates, solid aluminium plates that we've basically hit at seven kilometres a second. And you can see that you make a massive hole that's over a centimetre wide. The projectile that we were talking about here is a few millimetres in size, so it's much larger than the original thing that hit. And then you've got a huge amount of spray behind that and another hole. And then, yeah, you generate a lot of debris when you get hit by these objects, which can then go on to hit more objects. For those people listening on the radio and podcast, which is all of them, just to describe it, it's made a tremendous mess. I'm looking at it now and it's like a sizeable bullet hole, really, isn't it? So when you fly in your spaceship and you're in the cloud of millions of these, you're doomed, really, aren't you? Yes, but luckily, space is really big. And although there are lots of these particles, they're spread out. So the chances are much lower of being hit by something, especially as you go to larger sizes. Basically, you have like an exponential kind of graph where with size, really small objects, you have lots of them and much bigger ones. It just tails off. You have very few of them. When you send something out into space, you've got a rough idea of a route you're going to pick through clouds of hazard. No, I can't see. No. So what you do is you design things like bumper shields and spacecraft shielding so that if you do get hit, you're fine. You talk about it going up incremental and then the decrease as the objects get larger. Exponential, exponential. Yeah, incremental, exponential, whatever it might be. You're in charge of those things. Just a bit different. You do all the big, clever words about space. Incremental is different to exponential. OK. It's about as different as it could possibly be. Isn't it? Yeah. Virtually the opposite. The opposite. I was thinking of size, so how incremental size goes down, then saying exponential goes up and then the... The number of them increases exponentially as the size decreases. Right. Yeah, that was wrong anyway. But keep it in because it's failure that makes us human. I was just wondering about are the people wandering around who every now and again will go, ow, what the hell was that? And you go, oh, it's just stuff from space. How come that doesn't happen? I mean, you do get meteorites landing on the Earth. So, I mean, the most famous recent example would have been the Winchcombe meteorite, which landed, I don't know, the year because I always forget these things. But during Covid lockdown, so landed on someone's driveway. That was quite a sizable chunk. The UK gets hit by several meteorites every year. There's several thousand land on Earth every year. Now, don't go out immediately buying yourself a hard hat. One person has been hit by a meteorite. That was back in 1990 in Uganda. It was a 2.5 gram piece that bounced and then hit this person. And actually in the 1800s in Gloucestershire, a meteorite fell as a series of little stones. And it's described how kids were trying to catch them out of the air. They thought they were beetles falling. They were falling through the trees and they were trying to catch these meteorites. So the chances of you personally being hit by a meteorite are extraordinarily low in the list of things that you should be worried about, like radiation. Being hit by a meteorite is not one of them. And what do we hope to learn? What can we learn from this dust? What are you trying to understand about the solar system and its evolution with those? One of the wonderful things about space dust is, you know, we have a hundred billion of them land on Earth every year. There's a lot of dust out there and only a few thousand meteorites. And so meteorites are really good samples of a few asteroids. So they provide us with a lot of information about a few asteroids. Cosmic dust provides us with a little bit of information about a whole load of asteroids. So let's just look at what's out there in general. So in terms of us understanding how the solar system formed, what were the conditions, how many asteroids when they formed had ice inside them which melted, how many of them contained organic molecules, what were those organic molecules, were they delivered to the early Earth? So we look at a whole set of different projects about the nature of asteroids and how they formed four and a half billion years ago. Because, of course, that informs us about the formation of planetary systems in general. And the only example that we have that we can actually get our hands on is our own solar system. You mentioned very, very briefly there, Matt, this idea of basically life coming from out of space. And this is something that when we were looking at the notes beforehand, Brian went, as he often does in the green room, that looks like rubbish. I think it's a load of rubbish. It's not going to be true at all. So Penny, this idea is very aggressive when he gets to the biological, the future. He likes a subatomic world and anything above that. There's a difference here, sir, you've extrapolated. What Matt said is organic material. Yeah. He didn't say life. Well, no, but that's where we're going to get to now. Go on, Alan. Alan, come on. You believe that the world is infested with aliens. I'll believe whoever shouts at me the loudest. Wow. No, Penny, that idea that some of the building blocks is this. Some of the building blocks now. Yeah, yeah, yeah, we're slowly getting there. Well, the point is it's like doing a kind of tabloid thing, isn't it? The headline says life came in bits of magic dust. And then later on we get to the boring bits that are actually the accurate science. It's how this show has worked for years. So the building blocks of life coming from another place in the universe, does that play a part in terms of the cosmic dust story? Yes. So the theories that surround the formation of the Earth end up with an Earth that doesn't have much water, doesn't have many organics. And so it's quite sterile. And it's not really a place where you would expect life to start or be able to start. So some of the theories about comets and asteroids and the dust particles that came from those are that they've brought in after the Earth had formed, they've brought in those building blocks so that life could then be able to start and use those. So they've fed life. Right. So life would be quite impossible without the alien overlords getting involved with their asteroid system. I think that's what's being said, isn't it, Brian? OK, move on now. I prefer to think of it as the spice rack of creation. Just a little bit of this and a little bit of that and you know, there's an amoeba. Welcome to Alan Davies' Guide to Life on the Discovery Channel. Life is a little bit this, little bit that and then just a little pinch of that. The next thing you know, something started wriggling. Then it's subdivided. You're not actually that far off. You know, it's pretty much the way you cook, Alan, which is ignoring any recipe and just throwing things in. And if you just happen to get the right recipe, then you get life. If you put in just the right amount at the right time in the right place and you leave it for several hundred million years, then that's a lot of cooking. Can I ask you, you're a space person, how long do you think there was water on Earth before there was life? How long was there just an ocean with nothing swimming in it? So we think that water was added to the Earth during a period called the Late Heavy Bombardment. That sounds like the Reading Festival, doesn't it, the heavy bomb. So this was a period after the formation of the Earth when debris in the solar system is being thrown all over the place by the giant planets. And some of it is hitting our planet. And we think that that's when all these goodies, the water, these organic molecules are added to the early Earth. And we know it was during that time that the first living things appeared. So incredibly quickly, unbelievable amount of hurry to make the first living thing. So actually, water and life is being added to the planet at the same time. And the interesting thing is, is that just random chance or does it happen every time you add the right ingredients under the right conditions? Because if it is, if it's spontaneous like that, then there is life everywhere in the universe. Oh, good noise. If you're in the Goldilocks zone, right? Oh, you've got to be in the Goldilocks zone. Can you work out the Goldilocks zone for every star? I mean, if you know how hot the star is, where the Goldilocks zone is, so you can look in the... But, you know, the whole stuff with porridge, it doesn't really make any sense because there are places in solar systems like around Europa, Europa around Jupiter. It's got a water ocean that's outside the Goldilocks zone. And it's being heated up by Jupiter, just deforming it. Jupiter's gravity is stretching Europa as it goes round and round its orbit and that keeps it liquid water. There could be fish people swimming around on Europa. We don't know. See, this is the bit we need again to get the tabloids. Brian Cox reveals, because they'll say it was Brian, they won't say it was you because they have to go with it, you know. Brian Cox says, fish people rule the universe. There won't be fish people in the ocean of Europa. I'm just going to put that on record. Hang on a minute. We don't know for sure, do we? You think about what we mean by... What about sea monkeys? What about sea monkeys? There might well be. I mean, there's one mission on the way now, the European mission, JUS, and there's Europa Clipper, which is being launched next year. And there's serious missions which you're going to see if that may be habitat for life. But I think we don't expect them to be fish. Well, that's the thing is we don't expect them to. If we've had liquid water there for the last four billion years, that's a long time for evolution to happen. If there are volcanic vents that allow for these habitats, then who knows how far evolution has gone. I agree, fish people, you know, with fish radios and Wi-Fi, that's probably unlikely. Fish radios? Well, now you're making it silly. I was happy with fish people, but fish people on rollerblades, fish things to do. No, I'm not happy with that. You've made it too starlight express. I want to ask Alan, what's your picture of this strange twilight world beneath the ice? Well, it makes me think in a moment, Brian. I'm thinking, I mean, we accepted them all through our childhood, but fish fingers didn't even look at all remotely like fingers, did they? I mean, they were just rectangular. They could have done five different size ones in the packet, at least. But then it would have been looking like a bit like a fish hand. And no one really wants a fish hand for their tea, do they? The only food stuff that you're allowed to mould into something representing people is a gingerbread man. And it's inexplicable to me why there isn't humanoid shaped toast. What I'm enjoying about this show is realising that you're really hungry. I think it was just the mention of the fish people. Perhaps it's because I'm a human. As soon as I hear about fish, I think, how would I cook that? So you went from fish people in the oceans of Europa to fish fingers, because you think of fish people with hands. With hands. They might have looked like old fashioned fingers. They might have looked like based on the fingers of someone who'd got their hands trapped in a loom or something like that. Or webbed. Yeah, exactly. Yeah. What are the seas on Europa made of from? Water. Is it? I can't help but feel that, and I blame myself for this, that the fish people has taken us slightly off the subject of micrometeorology. So we get this data. So we've got samples from the asteroids and samples from the comets. So what is that telling us about the formation history of the solar system? So the difference in the region where the earth formed, for example, and then going out to the regions of the Saturn and Jupiter and then out to the ice giants. For the inner regions of the solar system, you had the sun that was heating up materials and it was making it impossible for things like water to condense. So you have this hot inner region where the rocky planets formed. Then if you go beyond something that they call the snow line, you actually start to have water vapor being able to condense and crystallize and form ices. As you go further out, you have other volatiles that are able to condense out things like carbon dioxide. You have different chemistry in different regions of the solar system when these objects, when the asteroids, when the comets are all forming and they're all preserving. And actually, water has been a bit of a problem because we've been looking, embarrassingly, we've been looking for the source of the earth's oceans, which you'd think would be easy because there's a lot of water there. And we keep analyzing materials and we haven't found an exact match yet. And we'd expect it to be like coming from asteroids or coming from comets. And so it should be easy to find. And so far we've found. It's a remarkable thought, isn't it, Alan? We say the oceans for granted. We just think that they're part of the earth, the blue planet. And yet we know that that water was delivered somehow from space. I didn't know that. You just told me that and that's alarming. It's kind of the optional extra of planet Earth. You know, it was added later on, somebody, you know. It's cold at the top and the bottom, isn't it? Really cold. It's funny how often that works. Do you think there's ice first and then things got warmer and then there was water? Well, actually, funny you should say that. Has there water first that got very, very cold? I might give you a job, Alan. It's water water started off as ice. So Penny just mentioned that as you go outwards in the solar system away from the early sun, temperatures are getting colder and colder until eventually it starts snowing and you get this nice Christmas all the year round. Lots of snow in this nebula and it sticks together to make larger objects. So that's the ice grains. And those ice grains get built into some of the early asteroids. And it's those asteroids that then hit the earth. The ice melts on the asteroid, turns into mud, into clay minerals that contain water. When they hit the earth, they release that water. And you do that enough and you get an ocean. I think there's one thing that... Sorry, Alan. I mean, this is good stuff. I don't normally listen to radio programs like this. I thought you'd say if I'd listened to it in the first place, I wouldn't be here. But I suppose one of the things we are missing to some extent, the elephant in the room, and we're ignoring it, which is I think a lot of the audience sat here now are still wondering what part the Norwegian jazz scene has played in the world of micrometeoroids. And this is a lovely moment because the audience are thinking, I'm just going on some kind of surreal tour, but I'm not. The Norwegian jazz scene, I hope this is true to say, Penny, really plays its part in the science that both you and Matt study. Absolutely. Yes. So there is a gentleman called John Larson, who actually Matt has worked with extensively, who samples dust from roofs and was the first person to, more recently, find extraterrestrial dust particles on rooftops, just in urban environments, anywhere. Yeah, he started sending me emails saying, I'm looking for cosmic dust on rooftops. And I said, don't, because I knew there's just so much terrestrial dust. I just can't cope with the jazz musician looking for cosmic dust. He's a famous... He must have been really late after the gig, he just wandered up the fire escape. Everybody knows him in Norway. Everyone. You say John Larson, oh, you mean John Larson, jazz singer, yes, we know. I met him. Yeah, he's delightful, chap. Absolutely delightful. How long did he spend looking through the dust? So he was telling me... Through the dust. Because you spend a lot of time looking down a microscope, so he now needs glasses. And apparently he was telling me his daughters are just so incredibly embarrassed by him, because he keeps getting up on the roof of neighbours' houses to look for... And sometimes the police have to coax him down again. So after five years of sending me emails all the time, he eventually did find some real cosmic dust. And it's been great. So he has written these fantastic books on how to collect cosmic dust on your rooftop. And you can do this. You can actually do this at home. Be very careful. Please don't send me the dust. I'm not going to look at it. But what it means is, you know, anybody who's really interested can grab themselves a little bit of outer space. Didn't it take him, was it five years? I read somewhere 300 kilograms of dust or something. And he found a particle. Just imagine what 300 kilograms of roof litter looks like and smells like. I love you. I will not look at your dust. It reminds me of those old TV art shows. I'm sorry, but we cannot return your dust. Let me give you an average email that I get saying, Dear Dr. Gench, I have collected 20,000 particles from the top of my roof. I am going to send them to you. Please confirm that they are my criminal tribes for the rest of your career. Penny, what about you? What's the kind of do you have to deal with certain, you know, in terms of micrometeoroid emails or letters? I tend to get meteorite emails asking me to tell them if they have a meteorite or not. There's quite a large number of what we call meteor wrongs that get sent in. In terms of our understanding of the evolution of the solar system, and you mapped it out. And so the formation of the rocky planets and the ice line and so on. How valuable have these samples of dust been in allowing us to tell that story? So both Matt and myself have worked on a mission that was called Stardust. So this was a mission to a comet by NASA. And essentially it had like a tennis racket shaped collector, which was actually really sophisticated. It was made of an aluminium frame. And in the frame you had these aerogel cells. So aerogel is a really weird material. It's like a really, really low density foam, for want of a better word. And so basically as it flew through the comet tree tail, it held out this collector and particles hit it. And then it brought those back and we could analyse them. So one of the cool things that we found about that was when we were going out to comets, we thought that what would come back would be very pristine materials from the early solar system, in the outer regions of the solar system. And that meant we were looking for things like molecular cloud materials, stuff that had literally just compressed, come together as a comet and done nothing else. What we actually found was a huge number of minerals that formed much closer to the sun. And it meant that rather than just coming together and staying the same since the beginning of the solar system, we actually had materials that had been much closer to the sun and then were cycled out to the outer regions of the solar system. And what's really cool is we find some grains in meteorites that appear to come from outside our solar system. Just think about that for a second. Outside our solar system that predates our solar system. And the ones that we observe in space are made out of glass. But the ones we find in our solar system are mainly made out of crystals. And why the difference? What happens to them to turn them into crystals? And it's because they're being cycled through this hot place, which is the inner solar system, and then thrown all the way out beyond Neptune again. It's a remarkable thought, isn't it, that material is exchanged not only between different regions of our solar system, but between solar systems. So the oldest grains that have been found so far, I think they're about seven billion years. So our solar system is four and a half billion years old, and these are about seven billion years old. And I must just ask how we know. So how do you date a piece of silicon carbide from an alien solar system? If you analyze anything from Earth that isn't a meteorite, and you look at its isotopic composition, so the mixture of isotopes it contains, chemical elements, they fall quite a small range. And then the pre-solar grains, these interstellar grains, have hugely different isotopic compositions. And the reason for this is they are made where you make the isotopes. And that's in giant stars towards the end of their lifetime and in supernova. That makes the dust grains, and then those dust grains come together in these giant clouds in space, which eventually collapse to start making planets. And so every atom in our bodies has been through that process. We have all been through stars and cycled through space and eventually collapsed to make a new baby star. Seven billion years as well, just thinking that is over half the age of the universe. You know, that's a remarkable kind of, again, thinking of that story. Pre-dates coronation history. And so then it's possible, at least, that on your roof, when you go home tonight, you've got particles of cosmic dust from other solar systems that are older than our solar system. You could be sleeping beneath bits of a supernova, sleeping underneath a red giant star. So next time you bash your cushions together, wow. If you do it enough, you'll form a planet. I'm going to make a new series called The Wonders of Dust, in which I travel to all the continents of the world. You could do it with, you remember those two women who used to go around cleaning dirty houses? And then you could be in that as well. And then while they're banging the cushions, you go, look at the wonder here. This was a disgusting house filled with hoarding. But now the very, very building blocks of life and fish people too. It is. Anyway, so when you turn on a two-bar electric fire that hasn't been used for ages and you get that smell, something's happening there. This is a different... Dust has been there for decades. Now heat, and then you boil a kettle next to it. And provided you don't electrocute yourself, you could form life. Right, this is probably... Cut that bit. There's at no point going to have to... Don't try it at home. That's what Robin's going to say. The most warnings ever. Please do not get out a two-bar fire, which is now technically illegal and you're not meant to have any more. Place it next to your kettle steam and then afterwards go and climb on your roof to look for micrometeoroids. Please avoid all of those things. And if you do do those things and you do fall off the roof, just say, I think it was something I heard on in our time. So just to avoid... Penny, just to find a question. What for you is the biggest question that you believe could possibly be answered by cosmic dust? I mean, there must be within this field things where we go, we're not there yet, but the possible questions that we can start to answer with cosmic dust. I think it's probably about the diversity of materials that we have in the solar system and the diversity of the objects that we have left in the solar system. Recently I've been looking at stuff that is technically not cosmic dust with Penny, but it's our tiny dust particles from asteroids, from asteroid Ryugu, that was sampled by the Japanese space agencies. These are cosmic dust. They're tiny little particles. Just they were brought to us. Actually, we've discovered looking at those particles, they are incredibly different from everything we've seen before. And Alan, what are you hoping cosmic dust is going to answer for us? I hope it leads to peace in our time. You know, and people being kinder to, you know, fish. A lot of people don't know that Alan was Miss East Anglia in 1984 and you gave that answer then as well, didn't you? I hope to be Miss East Anglia in the future. We've asked the audience a question as well and today we asked them, what do you think is the smallest thing you could ever find in a field? There's a very good answer here. Well done to Louise's husband, who I'm glad to say is only Louise's husband. He does not see himself as having any identity beyond that, which I think means that we're beginning to move forward nowadays. And his answer is the letter I. Yes, yes. That's a lovely thing just to watch the patterns of people comprehending. It's in the word field. Oh, okay. Look, never mind. Well, that's a typographic. It's about the font, isn't it? Because the I is smaller in this font. Yeah, yeah. He's an observational comic. He has observed field as it has been typed there and he's observed that the letter I in this font is the smallest one. It's the dot of the letter I, isn't it? The smallest thing in the field. Because it's actually the same height as the L. Well, I suppose it, yeah. But yeah, but there's a middle period, isn't there, where there's nothing whatsoever. So if we see that as the empty space there in the atomic model of the letter I. There's less ink in the I than the L. Yeah, there is, yeah. Let's do that again then. What do you think is the smallest thing you could ever find in a field? Right, that was the question. I think it would probably be the letter I in this particular piece of paper that I've been given, where the word field has been printed, thinking about the amount of ink that has been involved in the creation of this. No, because Alan's right, because if it had just said the dot on the I. The dot on the I, yeah. That would have been clear. Well, I mean, Louise's husband, I was behind you all the way just a minute ago, but frankly now I'm pretty cross that you've put me through that. What have you got then? Well, I've got a couple here, the smallest thing you could ever find in a field. Daniel says it's a Nobel Prize winner. They're often outstanding in their field. Someone called on themself, John says the smallest thing you could ever find in a field are the benefits of Brexit. A little bit of politics. See, if we're referring to an outdoor field, perhaps a small duck. If we're referring to a quantum field, quark. That's what the duck said anyway. That's very well done. So thank you very much to our panel, Matt Genge, Penny Vodunovic, I'm not going to say that correct, am I? Do you want to say it? Vodunovic. It wasn't far off, was it? Vodunovic, it's so easy. Vodunovic. Penny Vodunovic and Alan Davies. In fact, no, Penny Vodunovic and Alan Davies. How about Clevitt and Alan Davies? A-land. A-land Davies. This is the end of Series 27 and it has been a wonderful series. It has been one of my favourite series we've ever, ever done. I hope you've enjoyed the series. The thing that I particularly enjoyed about this series is there's not been a single episode that has really been about physics. And Brian didn't notice until today. Today's episode was almost about physics, but somehow we managed to turn it into being one about fish people. So I'm very pleased about that. We've had no black holes, we've had no particle accelerator, we've had no dead cats. Instead we've had fungus, sharks and Richard III. This is some of the emails that we've been receiving. Liam says of this series, at last a series where I understood some of it. Polly says, happy that you didn't let that bloke from Oldham just make stuff up. It clearly is always made up. What a load of rubbish. And Lyn says, what a load of nonsense about William Thackeray playing the spoons as a musical instrument. But that's actually addressed to Melvin Bragg. We will be back in the autumn with Series 28 of the Infinite Monkey Cage in which we will be entirely devoting the whole thing to the use of spherical harmonics in modelling physical systems. And I guess it will be Jim Alcalili, Jim Alcalili and Jim Alcalili. Balls! Ideally Iced Spherical Balls! Ideally Iced... Ideally Iced... Ideally Iced... Ideally Iced... Ideally Iced Balls! Ideal Iced Spherical Balls. Goodbye. Goodbye. Feeling that nice again? From BBC Radio 4 and the team behind the hit series Slice Bread comes Toast. A look at the wonder products which left their backers burnt. I'm Sean Farrington, BBC Business Journalist. We'll hear about the hype. For a while it did look as if this would be the future. And then we'll unpick what went wrong. They didn't spend enough time researching what the consumers would want. Was their big idea always destined to be Toast? Going to be talking about things like wearable technology, Google Glass and how about the Sinclair C5, the electric vehicle from the 1980s? It's ideal for shopping, for going to the office, going to school, any trip around town. And learning about new developments inspired by those spectacular failures. Toast, a new series available now on BBC Sounds. Toast."}}, "transcribed_data": {"podcast_title": "The Infinite Monkey Cage", "episode_title": "Cosmic Dust", "episode_image": "http://ichef.bbci.co.uk/images/ic/3000x3000/p0c7h4qk.jpg", "episode_transcript": " This is the BBC. This podcast is supported by advertising outside the UK. BBC Sounds music radio podcasts. Hello, I'm Brian Cox. I'm Robin Ince and welcome to the final episode of the 27th series of the Infinite Monkey Cage. Now, if you're listening to Monkey Cage in order, you'll be expecting an episode on AI. But due to unforeseen circumstances, that's not what we're doing. But we couldn't edit it out of the introduction we did last week. And therefore, I've got to mention it to explain to you why we're not doing AI. Though actually what happened was the super intelligent AI we used to create this show couldn't deal with the self-referential nature of the demand of writing a show on AI, using AI, and disappeared up its own serial port. Actually, I guess it wasn't available. So we'll be returning to it next week. That's not actually why our guest was available but has not yet become sentient. Which again is one of those annoying things. This AI business, right, I read the Daily Express and I was told that the robot overlords will be in charge by now. Well, they're not. Blinking Daily Express yet again with its false promises of robot overlords. Anyway, today we've been saved by the age-old practice of looking to the heavens for inspiration. And there you can see that Brian, of course, immediately moving from science there into finding Jesus in much the same way that last week he found the skull of Mary Magdalene. Frankly, this series has gone down a very different route to the one that I thought. And if you're thinking, is there going to be a reboot of Harry Seacombs Highway starring Brian Cox, highly possible. What a niche reference. I don't think so. It's niche. They've got it. Don't call the audience niche. This is as broad as they get round here. You should come to one of those Radio 3 free jazz concerts. Then you'll see niche. No-one even knows when the gig started and the tuning up stopped. And for the younger members of our audience, below the age of 60... We don't have anyone below the age of 60! Anyway, I've not found Jesus. I've found dust. Which is not surprising because he doesn't pay his servants enough. Does he have servants? Of course he does. Things have worked out well. He pays the old lady three shillings and sixpence. He hasn't even told her about despilization. Disgusting. No, I've found dust because today we're exploring cosmic dust. What does the rain of dust from space that falls onto Earth every day tell us? No, you're not doing that properly. You should do it like you do it on the TV. What does the rain of dust from space, the glittering and glimmering fragments, motes of dust that twinkle in the imagination, extinguished by the dark? Ah... Yeah, I like that. APPLAUSE And what does that dust tell us? About the origin and evolution of our solar system, the planets and perhaps even life. To help us understand, we're joined by two scientists who know an enormous amount about very, very small things and someone who knows a very, very small amount but about everything else. And they are... They are! I'm Matthew Gensch and I am a planetary scientist at Imperial College in London. And the most wonderful thing that I've ever found from space was a rock from Mars. Ooh! In Antarctica. I've flexed. And I'm Penny Vosgenkevich. I'm also a planetary scientist from the University of Kent. And the most wonderful thing that I have found from outer space are impact craters on spacecraft that have been hit by tiny pieces of dust at really high speed. Ooh! Scary. Lot of pressure, Alan. Yeah. Yeah. Hello, everyone. I'm Alan Davies. I have a BA in drama from the University of Kent. And the most wonderful thing I've found from space is... Do you remember that ball that Harry Kane put over the bar in the World Cup? It landed in my garden about three weeks ago. And this is our panel. Penny, let's start with the definition. So what do we mean by cosmic dust? Ooh. Why did you start with that? OK. Sorry. I love the shock there. After an introduction today, we're going to be talking about cosmic dust. I cannot believe they've asked me what cosmic dust is. I know! I know! Can we just rule out that you buy it in a wrap from someone at a party? It's not that sort of thing. No. Before I go down the wrong rabbit hole altogether, it's not that sort of thing. No. If you find a planetary scientist who settles you, cosmic dust, at a party, it probably is cosmic dust. So don't sniff it. No. So cosmic dust is essentially dust from space. So dust that doesn't come from Earth, but has come from, in the most likely case, from comets or from asteroids. I always refer to cosmic dust as anything that's from space, whether it's landed on the surface or not. I'm going to have Matt tell me off now, I feel. No. No, no, no. Not at all. But we will discuss it later. Yes. Exactly. Do you want more? Yes. But I like the way you delivered that like an episode of Call My Bluff. Well, that's one definition there of cosmic dust. Let's see what Matt has to say. But that is, I mean, the idea of dust from space, that dust is able to pass to the ground, to me, it sounds quite remarkable that such a thing is possible to detect. So the weird thing about cosmic dust, though, is we only call it cosmic dust once it's landed on Earth and we've found it. Before that, you call it a micrometeoroid. What size of grains are we talking about? So we're talking about grains that are less than two millimetres in size. So that's what we call dust. And they are had to be dust particles in space. The Earth moves through a very tenuous cloud of dust called the zodiacal cloud. It sounds much more exciting than it is, very, very thin. And we sweep up that dust and it lands on Earth. And how many of these small sub millimetre particles are there? OK, so it's estimated that each year per metre squared, let's say, so per metre squared on the Earth's surface, you'll have about six micrometeorites or pieces of cosmic dust arrive at the surface of the Earth. How much of the cosmic dust is made up of the dead skin of aliens? It's quite a remarkable thought, though. So about six of these particles on the average per square metre. Per year. So that means that the roof of your house is covered in cosmic dust. So what it means is they are everywhere. They surround us. There are cosmic dust particles in this room right now. Some of the audience, some of the listeners at home will have cosmic dust on their clothes. It doesn't mean you're dirty or anything. It just means you're special. They are absolutely everywhere. But then surrounding us are millions and millions and millions of ordinary terrestrial dust particles, especially in my house. I like the fact you've turned this into a soap powder advert. I can get the blood and the egg and the sweat out of my football shirt, but I can't seem to get the cosmic dust out of it. So do you have a special dust pan that you go around with? Because it sounds like it'd be tricky to tell our normal Earth dust from the special space dust when you're sweeping up. I mean, I assume you have a pan. Is it not a pan? Actually, yes. You do? I do, because I'm a bit lazy. I went to the Antarctic and I collected dust. That's not lazy, is it? No. How does he get out of his job? He goes off to the Antarctic like every other lazy bugger. It's not as if I walked or anything. I flew. But I was lazy because I was collecting cosmic dust. And I found this layer just below the snow that was just dust. And so I got a plastic bag and just sweeped it into the plastic bag. It took me about 10 seconds. And I've been studying that for the last 10 years. Had it been there for ages? Oh, at least 700,000 years, because there's tiny little droplets inside that were made by this big impact that happened 700,000 years ago, probably in the Mekong Delta in Vietnam. And it scattered debris over most of the planet, including Antarctica. What are the different kind of tricks of detection to make sure that it's not just general dust and that it's cosmic dust? So the proper answer to that is we know that this stuff has been in space, because when something is in space, it's exposed to radiation from the sun. And it's exposed more to radiation from the rest of the galaxy. And that radiation generates new radioactive isotopes that decay really quickly. So if you find them, then that thing has been exposed to radiation in space relatively recently. And as soon as I mention radiation, everybody goes, oh my God, the amounts of radiation we're talking about are so tiny that actually radiation in the environment, you know, from your watch, from your mobile phone, is actually worse than the radiation from cosmic dust. So what you've actually done there is double people's paranoia. Yeah, I know. So if you know what you're looking for, then, is it going to be a little bit more difficult to find radiation in space? What are you looking for then? Then in principle, you could gather dust from the roof of your house or whatever it is. And in principle, you could sift through it and find it by eye if you know what you're looking for. More than in principle, we've done this. We've collected dust on rooftops and we've gone through it. It takes a long time to go through it because there's loads and loads of ordinary earth dust up there. And we found the tiny little melted droplets that come through the atmosphere. Penny, you've been doing this. Where have you been collecting again? Canterbury Cathedral. So you found proper heavenly dust. I have, yes. At the time, it was just a dustpan and brush. But we have upgraded. We now have our own vacuum cleaner. It's brilliant. So we have a project where we're going to be going to some of the other cathedrals across the UK and trying to collect them there. Why in particular cathedral roofs? There are scientific reasons as well as just wanting to get onto a roof that's really cool. So scientifically, the cathedral roofs are very old and they have very good records as to the types of activities that have been going on around them and whether they've had changes, if they've had bits of roofing repaired, if they've had welding going on nearby. So you know what to look out for when you're doing your searches for these particles in terms of like the terrestrial dust that we've been generating in the area. This is really helping with your reboot of Harry Seacombe's Highway as well, because now you can pretend there's a scientific reason that you're at Winchester Cathedral before you start playing If I Ruled the World on your Wurlitzer. You're really going for that younger demographic. I really am, yeah, yeah, yeah. What are the sources of this dust? Well, we think that most of the dust comes from asteroids. They are generated by, in the case of asteroids, it's likely to be impacts between different asteroids, pieces of asteroid. Each impact liberates a huge number of tiny particles that can then pass around, orbit around the sun, and some of them eventually come into contact with the Earth. Similarly with comets, I think we've probably seen comets going past and they've got these nice tails behind them. So one of those particular tails, it's called a dust tail, and that's dust being liberated from the surface because as it gets closer to the sun, comets are made of icy and rocky material and that ice starts to change into vapor instantaneously, and the dust that it was once holding together is then let go and it forms this tail. And again, those particles are then swirling around the solar system, causing a hazard or coming to Earth. Does this worry you at all, Alan, in terms of space exploration? The dusty hazards? Yeah, I'm very interested in the potential damage. We're all going to have to leave, you know, the Earth's not going to last forever. We're going to all have to get in ships and leave, and we need to know what's in the way. I think there are other things to worry about before that. I mean, we're talking about at least a billion years hence. Yeah, but it's good to plan ahead though. Now, you've got some... First of all, can you just tell me what this is that you're about to show us? So at the University of Kent, we have a facility called a light gas gun. Essentially, it allows us to take small objects about the size of micrometeorites that we're interested in and shoot them really fast to the kind of speeds that you might encounter if you're in space and you get hit by one. The gun, it's about seven kilometres a second. So what I've got here is some aluminium plates, solid aluminium plates that we've basically hit at seven kilometres a second. And you can see that you make a massive hole that's over a centimetre wide. The projectile that we were talking about here is a few millimetres in size, so it's much larger than the original thing that hit. And then you've got a huge amount of spray behind that and another hole. And then, yeah, you generate a lot of debris when you get hit by these objects, which can then go on to hit more objects. For those people listening on the radio and podcast, which is all of them, just to describe it, it's made a tremendous mess. I'm looking at it now and it's like a sizeable bullet hole, really, isn't it? So when you fly in your spaceship and you're in the cloud of millions of these, you're doomed, really, aren't you? Yes, but luckily, space is really big. And although there are lots of these particles, they're spread out. So the chances are much lower of being hit by something, especially as you go to larger sizes. Basically, you have like an exponential kind of graph where with size, really small objects, you have lots of them and much bigger ones. It just tails off. You have very few of them. When you send something out into space, you've got a rough idea of a route you're going to pick through clouds of hazard. No, I can't see. No. So what you do is you design things like bumper shields and spacecraft shielding so that if you do get hit, you're fine. You talk about it going up incremental and then the decrease as the objects get larger. Exponential, exponential. Yeah, incremental, exponential, whatever it might be. You're in charge of those things. Just a bit different. You do all the big, clever words about space. Incremental is different to exponential. OK. It's about as different as it could possibly be. Isn't it? Yeah. Virtually the opposite. The opposite. I was thinking of size, so how incremental size goes down, then saying exponential goes up and then the... The number of them increases exponentially as the size decreases. Right. Yeah, that was wrong anyway. But keep it in because it's failure that makes us human. I was just wondering about are the people wandering around who every now and again will go, ow, what the hell was that? And you go, oh, it's just stuff from space. How come that doesn't happen? I mean, you do get meteorites landing on the Earth. So, I mean, the most famous recent example would have been the Winchcombe meteorite, which landed, I don't know, the year because I always forget these things. But during Covid lockdown, so landed on someone's driveway. That was quite a sizable chunk. The UK gets hit by several meteorites every year. There's several thousand land on Earth every year. Now, don't go out immediately buying yourself a hard hat. One person has been hit by a meteorite. That was back in 1990 in Uganda. It was a 2.5 gram piece that bounced and then hit this person. And actually in the 1800s in Gloucestershire, a meteorite fell as a series of little stones. And it's described how kids were trying to catch them out of the air. They thought they were beetles falling. They were falling through the trees and they were trying to catch these meteorites. So the chances of you personally being hit by a meteorite are extraordinarily low in the list of things that you should be worried about, like radiation. Being hit by a meteorite is not one of them. And what do we hope to learn? What can we learn from this dust? What are you trying to understand about the solar system and its evolution with those? One of the wonderful things about space dust is, you know, we have a hundred billion of them land on Earth every year. There's a lot of dust out there and only a few thousand meteorites. And so meteorites are really good samples of a few asteroids. So they provide us with a lot of information about a few asteroids. Cosmic dust provides us with a little bit of information about a whole load of asteroids. So let's just look at what's out there in general. So in terms of us understanding how the solar system formed, what were the conditions, how many asteroids when they formed had ice inside them which melted, how many of them contained organic molecules, what were those organic molecules, were they delivered to the early Earth? So we look at a whole set of different projects about the nature of asteroids and how they formed four and a half billion years ago. Because, of course, that informs us about the formation of planetary systems in general. And the only example that we have that we can actually get our hands on is our own solar system. You mentioned very, very briefly there, Matt, this idea of basically life coming from out of space. And this is something that when we were looking at the notes beforehand, Brian went, as he often does in the green room, that looks like rubbish. I think it's a load of rubbish. It's not going to be true at all. So Penny, this idea is very aggressive when he gets to the biological, the future. He likes a subatomic world and anything above that. There's a difference here, sir, you've extrapolated. What Matt said is organic material. Yeah. He didn't say life. Well, no, but that's where we're going to get to now. Go on, Alan. Alan, come on. You believe that the world is infested with aliens. I'll believe whoever shouts at me the loudest. Wow. No, Penny, that idea that some of the building blocks is this. Some of the building blocks now. Yeah, yeah, yeah, we're slowly getting there. Well, the point is it's like doing a kind of tabloid thing, isn't it? The headline says life came in bits of magic dust. And then later on we get to the boring bits that are actually the accurate science. It's how this show has worked for years. So the building blocks of life coming from another place in the universe, does that play a part in terms of the cosmic dust story? Yes. So the theories that surround the formation of the Earth end up with an Earth that doesn't have much water, doesn't have many organics. And so it's quite sterile. And it's not really a place where you would expect life to start or be able to start. So some of the theories about comets and asteroids and the dust particles that came from those are that they've brought in after the Earth had formed, they've brought in those building blocks so that life could then be able to start and use those. So they've fed life. Right. So life would be quite impossible without the alien overlords getting involved with their asteroid system. I think that's what's being said, isn't it, Brian? OK, move on now. I prefer to think of it as the spice rack of creation. Just a little bit of this and a little bit of that and you know, there's an amoeba. Welcome to Alan Davies' Guide to Life on the Discovery Channel. Life is a little bit this, little bit that and then just a little pinch of that. The next thing you know, something started wriggling. Then it's subdivided. You're not actually that far off. You know, it's pretty much the way you cook, Alan, which is ignoring any recipe and just throwing things in. And if you just happen to get the right recipe, then you get life. If you put in just the right amount at the right time in the right place and you leave it for several hundred million years, then that's a lot of cooking. Can I ask you, you're a space person, how long do you think there was water on Earth before there was life? How long was there just an ocean with nothing swimming in it? So we think that water was added to the Earth during a period called the Late Heavy Bombardment. That sounds like the Reading Festival, doesn't it, the heavy bomb. So this was a period after the formation of the Earth when debris in the solar system is being thrown all over the place by the giant planets. And some of it is hitting our planet. And we think that that's when all these goodies, the water, these organic molecules are added to the early Earth. And we know it was during that time that the first living things appeared. So incredibly quickly, unbelievable amount of hurry to make the first living thing. So actually, water and life is being added to the planet at the same time. And the interesting thing is, is that just random chance or does it happen every time you add the right ingredients under the right conditions? Because if it is, if it's spontaneous like that, then there is life everywhere in the universe. Oh, good noise. If you're in the Goldilocks zone, right? Oh, you've got to be in the Goldilocks zone. Can you work out the Goldilocks zone for every star? I mean, if you know how hot the star is, where the Goldilocks zone is, so you can look in the... But, you know, the whole stuff with porridge, it doesn't really make any sense because there are places in solar systems like around Europa, Europa around Jupiter. It's got a water ocean that's outside the Goldilocks zone. And it's being heated up by Jupiter, just deforming it. Jupiter's gravity is stretching Europa as it goes round and round its orbit and that keeps it liquid water. There could be fish people swimming around on Europa. We don't know. See, this is the bit we need again to get the tabloids. Brian Cox reveals, because they'll say it was Brian, they won't say it was you because they have to go with it, you know. Brian Cox says, fish people rule the universe. There won't be fish people in the ocean of Europa. I'm just going to put that on record. Hang on a minute. We don't know for sure, do we? You think about what we mean by... What about sea monkeys? What about sea monkeys? There might well be. I mean, there's one mission on the way now, the European mission, JUS, and there's Europa Clipper, which is being launched next year. And there's serious missions which you're going to see if that may be habitat for life. But I think we don't expect them to be fish. Well, that's the thing is we don't expect them to. If we've had liquid water there for the last four billion years, that's a long time for evolution to happen. If there are volcanic vents that allow for these habitats, then who knows how far evolution has gone. I agree, fish people, you know, with fish radios and Wi-Fi, that's probably unlikely. Fish radios? Well, now you're making it silly. I was happy with fish people, but fish people on rollerblades, fish things to do. No, I'm not happy with that. You've made it too starlight express. I want to ask Alan, what's your picture of this strange twilight world beneath the ice? Well, it makes me think in a moment, Brian. I'm thinking, I mean, we accepted them all through our childhood, but fish fingers didn't even look at all remotely like fingers, did they? I mean, they were just rectangular. They could have done five different size ones in the packet, at least. But then it would have been looking like a bit like a fish hand. And no one really wants a fish hand for their tea, do they? The only food stuff that you're allowed to mould into something representing people is a gingerbread man. And it's inexplicable to me why there isn't humanoid shaped toast. What I'm enjoying about this show is realising that you're really hungry. I think it was just the mention of the fish people. Perhaps it's because I'm a human. As soon as I hear about fish, I think, how would I cook that? So you went from fish people in the oceans of Europa to fish fingers, because you think of fish people with hands. With hands. They might have looked like old fashioned fingers. They might have looked like based on the fingers of someone who'd got their hands trapped in a loom or something like that. Or webbed. Yeah, exactly. Yeah. What are the seas on Europa made of from? Water. Is it? I can't help but feel that, and I blame myself for this, that the fish people has taken us slightly off the subject of micrometeorology. So we get this data. So we've got samples from the asteroids and samples from the comets. So what is that telling us about the formation history of the solar system? So the difference in the region where the earth formed, for example, and then going out to the regions of the Saturn and Jupiter and then out to the ice giants. For the inner regions of the solar system, you had the sun that was heating up materials and it was making it impossible for things like water to condense. So you have this hot inner region where the rocky planets formed. Then if you go beyond something that they call the snow line, you actually start to have water vapor being able to condense and crystallize and form ices. As you go further out, you have other volatiles that are able to condense out things like carbon dioxide. You have different chemistry in different regions of the solar system when these objects, when the asteroids, when the comets are all forming and they're all preserving. And actually, water has been a bit of a problem because we've been looking, embarrassingly, we've been looking for the source of the earth's oceans, which you'd think would be easy because there's a lot of water there. And we keep analyzing materials and we haven't found an exact match yet. And we'd expect it to be like coming from asteroids or coming from comets. And so it should be easy to find. And so far we've found. It's a remarkable thought, isn't it, Alan? We say the oceans for granted. We just think that they're part of the earth, the blue planet. And yet we know that that water was delivered somehow from space. I didn't know that. You just told me that and that's alarming. It's kind of the optional extra of planet Earth. You know, it was added later on, somebody, you know. It's cold at the top and the bottom, isn't it? Really cold. It's funny how often that works. Do you think there's ice first and then things got warmer and then there was water? Well, actually, funny you should say that. Has there water first that got very, very cold? I might give you a job, Alan. It's water water started off as ice. So Penny just mentioned that as you go outwards in the solar system away from the early sun, temperatures are getting colder and colder until eventually it starts snowing and you get this nice Christmas all the year round. Lots of snow in this nebula and it sticks together to make larger objects. So that's the ice grains. And those ice grains get built into some of the early asteroids. And it's those asteroids that then hit the earth. The ice melts on the asteroid, turns into mud, into clay minerals that contain water. When they hit the earth, they release that water. And you do that enough and you get an ocean. I think there's one thing that... Sorry, Alan. I mean, this is good stuff. I don't normally listen to radio programs like this. I thought you'd say if I'd listened to it in the first place, I wouldn't be here. But I suppose one of the things we are missing to some extent, the elephant in the room, and we're ignoring it, which is I think a lot of the audience sat here now are still wondering what part the Norwegian jazz scene has played in the world of micrometeoroids. And this is a lovely moment because the audience are thinking, I'm just going on some kind of surreal tour, but I'm not. The Norwegian jazz scene, I hope this is true to say, Penny, really plays its part in the science that both you and Matt study. Absolutely. Yes. So there is a gentleman called John Larson, who actually Matt has worked with extensively, who samples dust from roofs and was the first person to, more recently, find extraterrestrial dust particles on rooftops, just in urban environments, anywhere. Yeah, he started sending me emails saying, I'm looking for cosmic dust on rooftops. And I said, don't, because I knew there's just so much terrestrial dust. I just can't cope with the jazz musician looking for cosmic dust. He's a famous... He must have been really late after the gig, he just wandered up the fire escape. Everybody knows him in Norway. Everyone. You say John Larson, oh, you mean John Larson, jazz singer, yes, we know. I met him. Yeah, he's delightful, chap. Absolutely delightful. How long did he spend looking through the dust? So he was telling me... Through the dust. Because you spend a lot of time looking down a microscope, so he now needs glasses. And apparently he was telling me his daughters are just so incredibly embarrassed by him, because he keeps getting up on the roof of neighbours' houses to look for... And sometimes the police have to coax him down again. So after five years of sending me emails all the time, he eventually did find some real cosmic dust. And it's been great. So he has written these fantastic books on how to collect cosmic dust on your rooftop. And you can do this. You can actually do this at home. Be very careful. Please don't send me the dust. I'm not going to look at it. But what it means is, you know, anybody who's really interested can grab themselves a little bit of outer space. Didn't it take him, was it five years? I read somewhere 300 kilograms of dust or something. And he found a particle. Just imagine what 300 kilograms of roof litter looks like and smells like. I love you. I will not look at your dust. It reminds me of those old TV art shows. I'm sorry, but we cannot return your dust. Let me give you an average email that I get saying, Dear Dr. Gench, I have collected 20,000 particles from the top of my roof. I am going to send them to you. Please confirm that they are my criminal tribes for the rest of your career. Penny, what about you? What's the kind of do you have to deal with certain, you know, in terms of micrometeoroid emails or letters? I tend to get meteorite emails asking me to tell them if they have a meteorite or not. There's quite a large number of what we call meteor wrongs that get sent in. In terms of our understanding of the evolution of the solar system, and you mapped it out. And so the formation of the rocky planets and the ice line and so on. How valuable have these samples of dust been in allowing us to tell that story? So both Matt and myself have worked on a mission that was called Stardust. So this was a mission to a comet by NASA. And essentially it had like a tennis racket shaped collector, which was actually really sophisticated. It was made of an aluminium frame. And in the frame you had these aerogel cells. So aerogel is a really weird material. It's like a really, really low density foam, for want of a better word. And so basically as it flew through the comet tree tail, it held out this collector and particles hit it. And then it brought those back and we could analyse them. So one of the cool things that we found about that was when we were going out to comets, we thought that what would come back would be very pristine materials from the early solar system, in the outer regions of the solar system. And that meant we were looking for things like molecular cloud materials, stuff that had literally just compressed, come together as a comet and done nothing else. What we actually found was a huge number of minerals that formed much closer to the sun. And it meant that rather than just coming together and staying the same since the beginning of the solar system, we actually had materials that had been much closer to the sun and then were cycled out to the outer regions of the solar system. And what's really cool is we find some grains in meteorites that appear to come from outside our solar system. Just think about that for a second. Outside our solar system that predates our solar system. And the ones that we observe in space are made out of glass. But the ones we find in our solar system are mainly made out of crystals. And why the difference? What happens to them to turn them into crystals? And it's because they're being cycled through this hot place, which is the inner solar system, and then thrown all the way out beyond Neptune again. It's a remarkable thought, isn't it, that material is exchanged not only between different regions of our solar system, but between solar systems. So the oldest grains that have been found so far, I think they're about seven billion years. So our solar system is four and a half billion years old, and these are about seven billion years old. And I must just ask how we know. So how do you date a piece of silicon carbide from an alien solar system? If you analyze anything from Earth that isn't a meteorite, and you look at its isotopic composition, so the mixture of isotopes it contains, chemical elements, they fall quite a small range. And then the pre-solar grains, these interstellar grains, have hugely different isotopic compositions. And the reason for this is they are made where you make the isotopes. And that's in giant stars towards the end of their lifetime and in supernova. That makes the dust grains, and then those dust grains come together in these giant clouds in space, which eventually collapse to start making planets. And so every atom in our bodies has been through that process. We have all been through stars and cycled through space and eventually collapsed to make a new baby star. Seven billion years as well, just thinking that is over half the age of the universe. You know, that's a remarkable kind of, again, thinking of that story. Pre-dates coronation history. And so then it's possible, at least, that on your roof, when you go home tonight, you've got particles of cosmic dust from other solar systems that are older than our solar system. You could be sleeping beneath bits of a supernova, sleeping underneath a red giant star. So next time you bash your cushions together, wow. If you do it enough, you'll form a planet. I'm going to make a new series called The Wonders of Dust, in which I travel to all the continents of the world. You could do it with, you remember those two women who used to go around cleaning dirty houses? And then you could be in that as well. And then while they're banging the cushions, you go, look at the wonder here. This was a disgusting house filled with hoarding. But now the very, very building blocks of life and fish people too. It is. Anyway, so when you turn on a two-bar electric fire that hasn't been used for ages and you get that smell, something's happening there. This is a different... Dust has been there for decades. Now heat, and then you boil a kettle next to it. And provided you don't electrocute yourself, you could form life. Right, this is probably... Cut that bit. There's at no point going to have to... Don't try it at home. That's what Robin's going to say. The most warnings ever. Please do not get out a two-bar fire, which is now technically illegal and you're not meant to have any more. Place it next to your kettle steam and then afterwards go and climb on your roof to look for micrometeoroids. Please avoid all of those things. And if you do do those things and you do fall off the roof, just say, I think it was something I heard on in our time. So just to avoid... Penny, just to find a question. What for you is the biggest question that you believe could possibly be answered by cosmic dust? I mean, there must be within this field things where we go, we're not there yet, but the possible questions that we can start to answer with cosmic dust. I think it's probably about the diversity of materials that we have in the solar system and the diversity of the objects that we have left in the solar system. Recently I've been looking at stuff that is technically not cosmic dust with Penny, but it's our tiny dust particles from asteroids, from asteroid Ryugu, that was sampled by the Japanese space agencies. These are cosmic dust. They're tiny little particles. Just they were brought to us. Actually, we've discovered looking at those particles, they are incredibly different from everything we've seen before. And Alan, what are you hoping cosmic dust is going to answer for us? I hope it leads to peace in our time. You know, and people being kinder to, you know, fish. A lot of people don't know that Alan was Miss East Anglia in 1984 and you gave that answer then as well, didn't you? I hope to be Miss East Anglia in the future. We've asked the audience a question as well and today we asked them, what do you think is the smallest thing you could ever find in a field? There's a very good answer here. Well done to Louise's husband, who I'm glad to say is only Louise's husband. He does not see himself as having any identity beyond that, which I think means that we're beginning to move forward nowadays. And his answer is the letter I. Yes, yes. That's a lovely thing just to watch the patterns of people comprehending. It's in the word field. Oh, okay. Look, never mind. Well, that's a typographic. It's about the font, isn't it? Because the I is smaller in this font. Yeah, yeah. He's an observational comic. He has observed field as it has been typed there and he's observed that the letter I in this font is the smallest one. It's the dot of the letter I, isn't it? The smallest thing in the field. Because it's actually the same height as the L. Well, I suppose it, yeah. But yeah, but there's a middle period, isn't there, where there's nothing whatsoever. So if we see that as the empty space there in the atomic model of the letter I. There's less ink in the I than the L. Yeah, there is, yeah. Let's do that again then. What do you think is the smallest thing you could ever find in a field? Right, that was the question. I think it would probably be the letter I in this particular piece of paper that I've been given, where the word field has been printed, thinking about the amount of ink that has been involved in the creation of this. No, because Alan's right, because if it had just said the dot on the I. The dot on the I, yeah. That would have been clear. Well, I mean, Louise's husband, I was behind you all the way just a minute ago, but frankly now I'm pretty cross that you've put me through that. What have you got then? Well, I've got a couple here, the smallest thing you could ever find in a field. Daniel says it's a Nobel Prize winner. They're often outstanding in their field. Someone called on themself, John says the smallest thing you could ever find in a field are the benefits of Brexit. A little bit of politics. See, if we're referring to an outdoor field, perhaps a small duck. If we're referring to a quantum field, quark. That's what the duck said anyway. That's very well done. So thank you very much to our panel, Matt Genge, Penny Vodunovic, I'm not going to say that correct, am I? Do you want to say it? Vodunovic. It wasn't far off, was it? Vodunovic, it's so easy. Vodunovic. Penny Vodunovic and Alan Davies. In fact, no, Penny Vodunovic and Alan Davies. How about Clevitt and Alan Davies? A-land. A-land Davies. This is the end of Series 27 and it has been a wonderful series. It has been one of my favourite series we've ever, ever done. I hope you've enjoyed the series. The thing that I particularly enjoyed about this series is there's not been a single episode that has really been about physics. And Brian didn't notice until today. Today's episode was almost about physics, but somehow we managed to turn it into being one about fish people. So I'm very pleased about that. We've had no black holes, we've had no particle accelerator, we've had no dead cats. Instead we've had fungus, sharks and Richard III. This is some of the emails that we've been receiving. Liam says of this series, at last a series where I understood some of it. Polly says, happy that you didn't let that bloke from Oldham just make stuff up. It clearly is always made up. What a load of rubbish. And Lyn says, what a load of nonsense about William Thackeray playing the spoons as a musical instrument. But that's actually addressed to Melvin Bragg. We will be back in the autumn with Series 28 of the Infinite Monkey Cage in which we will be entirely devoting the whole thing to the use of spherical harmonics in modelling physical systems. And I guess it will be Jim Alcalili, Jim Alcalili and Jim Alcalili. Balls! Ideally Iced Spherical Balls! Ideally Iced... Ideally Iced... Ideally Iced... Ideally Iced... Ideally Iced Balls! Ideal Iced Spherical Balls. Goodbye. Goodbye. Feeling that nice again? From BBC Radio 4 and the team behind the hit series Slice Bread comes Toast. A look at the wonder products which left their backers burnt. I'm Sean Farrington, BBC Business Journalist. We'll hear about the hype. For a while it did look as if this would be the future. And then we'll unpick what went wrong. They didn't spend enough time researching what the consumers would want. Was their big idea always destined to be Toast? Going to be talking about things like wearable technology, Google Glass and how about the Sinclair C5, the electric vehicle from the 1980s? It's ideal for shopping, for going to the office, going to school, any trip around town. And learning about new developments inspired by those spectacular failures. Toast, a new series available now on BBC Sounds. Toast."}, "podcast_summary": "- TL;DR: This podcast episode is about cosmic dust and what it can tell us about the origin and evolution of our solar system and potential for life.\n- Cosmic dust is dust from space that lands on Earth, and it contains valuable information about the composition and history of asteroids and comets.\n- Each year, about six micrometeorites or pieces of cosmic dust land on every square meter of Earth's surface.\n- Cosmic dust has been found to contain different minerals and isotopic compositions, providing insights into the diversity of materials in the solar system.\n- Researchers have also discovered pre-solar grains in meteorites that come from outside our solar system and predate it by billions of years.\n- The presence of water and organic molecules in cosmic dust suggests that it may have contributed to the formation of life on Earth.\n- Overall, cosmic dust provides valuable clues about the formation and development of our solar system and its potential for hosting life.\n- Inspiring Takeaway: The study of cosmic dust reveals the interconnectedness of the universe and the incredible stories hidden within even the smallest particles.", "podcast_guest": "Matthew Gensch", "podcast_highlights": "Chapter 1: Unforeseen Circumstances\nChapter 2: The Age-old Practice\nChapter 3: Cosmic Dust and its Origins\nChapter 4: The Search for Life\nChapter 5: The Value of Cosmic Dust\nChapter 6: The Smallest Thing in a Field"}